[
  {
    "chunk_id": 1,
    "text": "The Archive Inspector is used to locate files in an archive. The respective access group user can launch and purge files found in the archive. As soon as the target file is located, it is treated as a regular UNIX and standard commands can be used to interact with it. Note! It is not encouraged to alter or remove a file from the archive using UNIX commands. If altering is desired, make a copy of the file. If removal is desired, use the Archive Inspector. To open the Archive Inspector, click the Manage button from the top bar and select Archive Inspector from the list. Open The Archive Inspector Main Window Info Sensitive information is blurred on the screen. You will see the actual path of the file when using the Archive Inspector. Searching the Archive Initially, the dialog is empty and must be populated with data using the corresponding Search Archive dialog. When you click on the Search button, the Search Archive dialog appears where you can select the number of rows you want to view in the Archive Inspector . Each row represents information about a data batch (file). Open The Search Archive dialog Settings Description Settings Description Archive Profile Select the Archive profile that corresponds to the data of interest. If no profile is selected archive entries for all profiles will be shown. Workflow Option to narrow the search with respect to the workflow that archived the file. Agent Option to narrow the search with respect to the agent that archived the file. Period Option to search for data archived during a certain period. You can either select the User Defined option in the drop-down list and then enter date and time in the From and To fields, or you can select one of the predefined time intervals in the drop-down list; Last Hour, Today, Yesterday, This Week, Previous Week, Last 7 Days, This Month or Previous Month. Accessing the Inspector The Archive Inspector table shows the file(s) based on the search criteria specified in the Archive Inspector#Search Archive dialog. Open Archive Inspector Table - Selection Each file (row) in the table has a set of properties associated with it. Property Description Property Description ID Refers to the ID of the archived entry. Workflow Full name of the archiving workflow. The format is <folder>.<configuration>.<workflow name> Agent Name of the archiving agent. File path The full path of the file stored on disk. Timestamp The time when the entry was inserted in the archive. MIM Values Adherent MIM resources are defined as Logged MIM Data in the Archiving agent configuration dialog. Profile Name of the profile used to archive the file. Note! If the profile is not available, < Profile not found > message is displayed. An example screen: Open Table Toolbar The table toolbar for the Archive Inspector presents with more options to manipulate data within the table. Table Toolbar - Default View The following are the buttons found on the toolbar: Default options Option Description Search Displays the Search Archive dialog where search criteria may be defined to identify the files to be displayed, see Archive Inspector#Search Archive for more information. Refresh Refreshes the table. Delete All Deletes all shown items. With one file selected Clear Selection(s) Clears the currently selected item(s). View Raw Data Opens the Raw Data Viewer screen. An example of a Raw Data Viewer dialog : Open View MIM Values Shows the associated MIM values. For further information, see the figure below: MIM Values Dialog Note! The dialog also appears when you double-click on a row of the table. Delete Deletes the currently selected file. With multiple file(s) selected Clear Selection(s) Clears the current selection. Delete Delete selected files. Delete If Keep Files is disabled in the Archive profile, all selected files are removed from the archive, including their corresponding references in the database. If Keep Files is enabled or if the Archive profile that archived the entry is not available, only the references are removed while the files shown in Archive Inspector are still kept on disk. Refer to the documentation on the Keep Files option to know more.",
    "title": "Archive Inspector - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352174072/Archive+Inspector",
    "word_count": 688,
    "char_count": 4158
  }
]