[
  {
    "chunk_id": 1,
    "text": "To open the Decoder agent configuration, click Configuration  New Configuration . Select Workflow from the Configurations dialog. When prompted to Select workflow type , click Batch  OK . Click Add agent . In the Agent Selection dialog click the Processing tab and select Decoder . Double-click the agent icon or select the icon and click on Edit to display the Agent Configuration dialog. Open Currently, there are the following built-in decoders available. Different settings are available depending on the Decoder you select. CSV Format JSON MZ Tagged Format Avro Format Open Setting Description Setting Description Decoder Click Browse to select from a list of available decoders created in the Ultra Format Editor, as well as the default built-in decoders. Decoder-specific settings are described in the table below. On Error Options to control how to react upon decoding errors. Cancel Batch - The entire batch is cancelled. This is the standard behavior. Route Raw Data - Route the remaining, undecodable, data as raw data. This option is useful if you want to implement special error handling for batches that are partially processed. Full Decode This option is only available when you have selected a decoder created in the Ultra Format Editor. Select this option to fully decode the UDR before it is sent out from the decoder agent. This action may have a negative impact on performance, since not all fields may be accessed in the workflow, making decoding of all fields in the UDR unnecessary. To detect all decoding errors, you must you must select this option. If this checkbox is cleared (default), the amount of work needed for decoding is minimized using \"lazy\" decoding of field content. This means that the actual decoding work may be done later in the workflow, when the field values are accessed for the first time. Corrupt data (that is, data for which decoding fails) may not be detected during the decoding stage but can cause a workflow to abort later in the process. MZ Tagged Specific Settings Tagged UDR Type Click the Add button to select from a list of available internal UDR formats stored in the Ultra and Code servers, to reprocess UDRs of an internal format and send them out. If the compressed format is used, the decoder automatically detects this. JSON Specific Settings UDR Type Click Browse to select the UDR type you want the Decoder to send out. You can either select one of the predefined UDRs or the DynamicJson UDR, which allows you to add a field of type any for including payload. Unmapped Fields If you have selected DynamicJson as UDR Type , you can select the option data in this field to include the payload. If you have selected another UDR type that contains any, or a map field, you can select to put any unmapped fields into the field you select in this list. All fields of any or map type in the selected UDR type will be available. If set to (None), any unmapped fields will be lost. Schema Path Enter the path to the JSON schema you want to use in this field. CSV Specific Setting UDR Type Click Browse to select the UDR type you want the Decoder to send out. You can either select one of the predefined UDRs or the DynamicCsv UDR if the CSV format is not known. Format Select the CSV format you want to use; Unix , Mac , Windows , or Excel , or select to define your own customized format. If you select Custom , the following four settings will be enabled. Delimiter Enter the delimiter character(s) for the fields in the CSV. Use Quote Select this option if quotes are used in the CSV. Quote If Use Quote is selected, enter the type of quotes used in the CSV. Line Break Enter how line breaks are expressed in the CSV. Avro Specific Settings Schema Registry URL URL to a schema register used for obtaining Avro schema used for decoding. Example Format: <http> or <https>//<host address>:<port>/<schema_register_endpoint_path> Example: \" http://localhost:8081/schemas/ids \" Note! It is possible to use a proxy to contact a schema register. See HTTP Proxy Support for information on how to configure the proxy on the execution context level. Schema Field Field in JSON formatted schema register response containing schema Note! The use and settings of private threads for an agent, enabling multi-threading within a workflow, are configured in the Thread Buffer tab. For further information, see the Thread Buffer Tab in Workflow Template .",
    "title": "Decoder Agent Configuration - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352141417",
    "word_count": 751,
    "char_count": 4398
  }
]