[
  {
    "chunk_id": 1,
    "text": "The DB Ref Event is triggered when a user performs any of the following operations on its tables: Commits changes to a database table Performs import operations If Enable Advanced Logging is selected in a Reference data profile, additional information will be included as follows: SQL statements for commit operations Generated SQL and log files' locations for import operations For more information about Reference Data Management, see the Reference Data Management user's guide. Filtering In the Event Setup tab, the values for all the event fields are set by default to All in the Match Value(s) column, which will generate event notifications every time a DB Ref event is generated. Double-click on the field to open the Match Values dialog where you can click on the Add button to add which values you want to filter on. If there are specific values available, these will appear in a drop-down list. Alternatively, you can enter a hard coded string or a regular expression. The following fields are available for filtering of DB Ref events in the Event Setup tab: DB Ref event specific fields profileIdentity - This fields contains the name of the Data Reference profile. user - This field contains the name of the user that performed the operation. Fields inherited from the Base event The following fields are inherited from the Base event, and can also be used for filtering, and described in more detail in Base Event : category - If you have configured any Event Categories, you can select to only generate notifications for DB Ref events with the selected categories. See Event Category for further information about Event Categories. contents - This field contains a string with event specific information. If you want to use this field for filtering you can enter a part of the contents as a hard coded string. eventName - This field can be used to specify which event types you want to generate notifications for. This may be useful if the selected event type is a parent to other event types. However, since the DB Ref event is not a parent to any other event, this field will typically not be used for this event. origin - This field always contains the IP address of the Platform. severity - With this field you can determine to only generate notifications for events with a certain severity; Information, Warning, Error or Disaster. timeStamp - This field contains the date and time for when the Platform generated the event. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2014-06-15 09:.*\" for catching all DB Ref events from 9:00 to 9:59 on the 15th of June, 2014. Note! The values of these fields may also be included in the notifications according to your configurations in the Notifier Setup tab. Examples DB Ref Event Configuration Example - DB Ref event notification saved in a Log File Open This configuration will give you the following notification setup: When a user a updates table data with a Reference Data profile, a notification will be generated. When this notification is generated, a new line with information will be logged in the reference_data .txt file located in the /home/user/reference_date folder, containing the following data: The Reference Data profile. The user that triggered the creation of the event. The type of operations that was performed by the user. The timestamp for when the event was triggered The Reference Data profile that was accessed When Enable Advanced Logging is selected in the Reference Data profile profile, the event also includes the SQL statements that were executed as part of the operations. The SQL statements are provided either in a referenced file or directly in the event depending on the type of operation. Example - DB Ref Event notification saved in a database Open This configuration will give you the following notification setup: When a user a updates table data with a Reference Data profile, a notification will be generated. When this notification is generated, an entry will be added in the refdatalog table in the database: The event message, inserted in the message column in the database table. The timestamp from the Platform, inserted in the time column in the database table. When Enable Advanced Logging is selected in the Reference Data profile profile, the event also includes the SQL statements that were executed as part of the operations. The SQL statements are provided either in a referenced file or directly in the event depending on the type of operation.",
    "title": "DB Ref Event - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352171995/DB+Ref+Event",
    "word_count": 760,
    "char_count": 4527
  }
]