[
  {
    "chunk_id": 1,
    "text": "Open In MediationZone 9.4, there are the following known issues: 1 Installation and Upgrade Issues 1.1 Unable to Change Platform Database After Installation 1.2 Error Occurs When Performing Multiple Installations on a Host with Different UNIX User IDs 1.3 Issues with HTTP Batch after Upgrading 1.4 Configuration History Loss After Upgrade from MediationZone 8 1.5 Deleted Configuration History Unavailable After Upgrade from MediationZone 8 1.6 Only the first EC is started when multiple ECs are specified 2 User Interface issues 2.1 New Desktop Issues 2.1.1 Database Agent Assignment Tab Value Are Not Cleared 2.1.2 Database Agent MIM Browser Need To Click Twice To Close It 2.1.3 External Reference Profile Datalist Can Be Altered in Read-Only Mode 2.1.4 Login Web UI Will Go To Last Page That Last User Accessed 2.1.5 Type Assigned Indication not Shown in MIM Browser 2.1.6 Idle Timeout Only Warns the User Once 2.1.7 Data Veracity Repair Jobs Show in One Line 2.2 Accessibility Issues 2.3 Known Differences Between Desktops 3 Data Veracity issues 3.1 Data Veracity Search Filtering For Some Fields Are Case-Sensitive 3.2 Data Veracity Filter's Full Query Is Not Available on Desktop 3.3 Adding an Empty Query Group With A Parent Condition In Data Veracity Search & Repair Filter Will Result In An Error 3.4 Importing Old Data Veracity Collection Agent Workflow Configurations Returned Validation Errors 3.5 Data Veracity Filters Are Not Refreshed Automatically 3.6 Data Veracity New Restricted Fields That Were Used For An Existing Repair Rule Is Not Disabled 4 Duplicate UDR issues 4.1 Duplicate UDR Inspector Stuck Loading When Attempting To Delete Records 4.2 System Log Shows Unknown User On Deleting A Record In Duplicate UDR Inspector 4.3 Duplicate UDR Inspector Allows To Delete Records Without Profile Locking 4.4 Duplicate UDR Inspector Didnt Return Records Properly 4.5 Duplicate UDR MIMs Shows 0 4.6 Incorrect Handling When Duplicate UDR Process Old Data With System Arrival Time 4.7 Duplicate UDR Inspector Table Header Row Count Is Not Updated When Records Found Is 0 4.8 Rename Duplicate UDR Profile Doesnt Auto Reflect In Duplicate UDR Agent 4.9 Exception Thrown When Truncating Previous Tables After Changing DB Profile In Duplicate UDR Profile 4.10 File Directory Is Not Empty When Delete Duplicate UDR File Storage Profile 5 Reference Data Management 5.1 Reference Data Management Table Shows No Data And All Functions Are Locked 5.2 Import/Export Ongoing Process Are Not Aborted When Navigating Away From Reference Data Management 6 SAPCC Rest Agent 6.1 Unable To Add Additional Parameter In Desktop Online Workflow Page 7 Other issues 7.1 Error Thrown When SAPCC Agent Not Added With Any Host 7.2 Inappropriate Validation Handling On Workflow Group Scheduling 7.3 Database Forwarding Agent Validation Message 7.4 External References Can Be Removed when a Workflow is Dependent on It 7.5 Keystore Information Is Gone After Imported Notification Workflow From MZ8.3 Installation and Upgrade Issues Unable to Change Platform Database After Installation It is not possible to change platform database after the installation is completed which used to be a feature that available since 8.x. This issue will be fixed in future releases. Error Occurs When Performing Multiple Installations on a Host with Different UNIX User IDs The /tmp/syslog/syslog-debug.log file is created when a host machine contains an MZ 9 installation. This file will be overwritten by any subsequent MZ 9 installations that are performed on the same host machine with a different UNIX user ID. However, the attempt to overwrite this file will fail and cause errors to the subsequent installations. To solve this issue, modify the platform.xml file setting by using the mzsh topo open platform command. Edit the platform.xml file, and change the directory to use another directory using the following command: <property name=\"mz.syslog.debuglogfile.filedir\" value=\"[the directory]\"/> . Issues with HTTP Batch after Upgrading When upgrading from MediationZone 8 to MediationZone 9, there are the following issues with the HTTP Batch agent: In MediationZone 8, the HTTP Batch agent has a non-standard way to configure keystore information where instead of referencing a file on disk, the full file content is kept in the configuration. Currently there is no way to configure this in the same way in MediationZone 9. If you configure a keystore in MediationZone 8, either in the profile or in the agent, the certificate handling will be completely disabled, and all server certificates are accepted. This is different compared to the REST client agent where the profile/keystore is used as both keystore and truststore. Configuration History Loss After Upgrade from MediationZone 8 After upgrading from MediationZone 8, existing configuration history will no longer be available. This issue will be fixed in future releases. Deleted Configuration History Unavailable After Upgrade from MediationZone 8 After upgrading from MediationZone 8, previously deleted configuration history in MediationZone 8 is no longer accessible in the Configuration Tracer. This issue will be fixed in future releases. Only the first EC is started when multiple ECs are specified When specifying multiple ECs during installation using a comma-delimited format (e.g., ec1,ec2,ec3), the installation completes successfully. However, only the first EC (ec1) is started post-installation. The remaining ECs are not started as expected. User Interface issues New Desktop Issues Database Agent Assignment Tab Value Are Not Cleared When Value Type is set to \"To UDR\" or \"NULL\", the Value column are not cleared. Database Agent MIM Browser Need To Click Twice To Close It The MIM browser open from database agent, need to close it by hitting twice on cancel button or the X button to close it. External Reference Profile Datalist Can Be Altered in Read-Only Mode When certain procedures are made, it is possible to alter the data list found in the external reference profile while the read-only mode is used. This causes a system-wide DRRCPException to be thrown. Login Web UI Will Go To Last Page That Last User Accessed User A log out from web UI, and User B login, it will automatically go to the page last accessed by User A. Type Assigned Indication not Shown in MIM Browser This can be viewed in the Legacy Desktop if required. Idle Timeout Only Warns the User Once Inactive users will be logged out after a configurable period, following a warning to that effect. If a user is active after the warning they won't be logged out, but if they are inactive again then they will be logged out with no warning. Data Veracity Repair Jobs Show in One Line When viewing the repair jobs in the new UI they are displayed in one line which is hard to read. Accessibility Issues The new web-native desktop aims to be fully accessible, but there are currently some outstanding issues regarding this. These include: In some interfaces, the keyboard navigation doesn't follow the ideal order or convention Incorrect behavior of radio buttons Known Differences Between Desktops There are some known, minor issues with differences between the two Desktops. Data Veracity issues Data Veracity Search Filtering For Some Fields Are Case-Sensitive The filtering for the source_node and message fields in the Data Veracity Search & Repair table are case-sensitive. Data Veracity Filter's Full Query Is Not Available on Desktop The full filter query for Data Veracity is not available for viewing on the Desktop. A partial display of the query can be seen in the filter listing under Data Veracity > Filter listing. Open Open Adding an Empty Query Group With A Parent Condition In Data Veracity Search & Repair Filter Will Result In An Error Attempting to add an empty query group with a parent condition will cause an error to be thrown upon clicking OK . A sample of the query setup is shown below. Open Open Importing Old Data Veracity Collection Agent Workflow Configurations Returned Validation Errors If you have an old Data Veracity Collection Agent Workflow configuration from version 8.x, it is possible that validation errors about invalid Analysis Agents may occur. Example error during import: The following agents returned validation errors. Analysis_1 is invalid. The UDR type DataVeracityUDR (DataVeracity) doesn't exist The following agents returned validation errors. Analysis_1 is invalid. The UDR type DataVeracityUDR (DataVeracity) doesn't exist Example error when viewing the invalid workflow Analysis Agent configuration: Error: Failed to set UDR Types Message: Unable to create UDR type description from DataVeracityUDR (DataVeracity). Error: Failed to set UDR Types Message: Unable to create UDR type description from DataVeracityUDR (DataVeracity). To resolve this, you will need to re-add the Data Veracity UDR for Analysis Agent input UDR Types or use the Set To Input button if applicable. After adding the appropriate Analysis UDR Types, save the workflow configuration. Data Veracity Filters Are Not Refreshed Automatically The Filter page is not always the latest, after creating a new Filter from the Data Veracity Search page, you may need to click the Refresh button to view it. Data Veracity New Restricted Fields That Were Used For An Existing Repair Rule Is Not Disabled If setting a new restricted field that was used in a previously created Repair Rule, it is expected that the rule on the said field should be grayed out when viewing the saved Repair Rule and be ignored when applying repair tasks. This is not the case as the rule on the said field still appears to be editable in the old Saved Repair Rule. Duplicate UDR issues Duplicate UDR Inspector Stuck Loading When Attempting To Delete Records When a Duplicate UDR profile is being used by a running workflow, attempting to delete any records for that profile in Duplicate UDR Inspector would cause the Inspector to be stuck loading. System Log Shows Unknown User On Deleting A Record In Duplicate UDR Inspector After deleting any records in Duplicate UDR Inspector, the log message in the System Log, will show the Username as <Unknown>. Duplicate UDR Inspector Allows To Delete Records Without Profile Locking Currently, when executing a workflow using the Duplicate UDR profile, the profile remains unlocked, allowing for the deletion of records from the Duplicate UDR Inspector. Duplicate UDR Inspector Didnt Return Records Properly With certain search date criteria in Duplicate UDR Inspector, some records are not returned. Duplicate UDR MIMs Shows 0 Duplicate UDR Inspector shows these MIMs as 0 even when there are Duplicate UDR caught. Dup_UDR_1.dups UDRs Dup_UDR_1.Inbound UDRs Dup_UDR_1.Outbound UDRs Dup_UDR_1.r_3 UDRs Incorrect Handling When Duplicate UDR Process Old Data With System Arrival Time With the SQL Storage Duplicate UDR profile set to use System Arrival Time , UDRs with dates older than the system time on the Platform will not be handled properly. The Duplicate UDR Inspector will not display any data despite the UDRs being processed. When using File Storage Duplicate UDR profile with System Arrival Time as well, you might see Records and Duplicates as 0 in the legacy desktop Duplicate UDR Inspector. Duplicate UDR Inspector Table Header Row Count Is Not Updated When Records Found Is 0 When searching a profile that has no records after previously searching with a profile that has any records, the table header would still display previous row count. Rename Duplicate UDR Profile Doesnt Auto Reflect In Duplicate UDR Agent When renaming a Duplicate UDR profile in the configuration browser, the Duplicate UDR agent that is using this profile is does not refresh with the new name automatically. This does not affect the workflow when executing with the profile. Exception Thrown When Truncating Previous Tables After Changing DB Profile In Duplicate UDR Profile Upon saving a copy of Duplicate UDR profile A to another Duplicate UDR profile. Changing the DB profile to a different schema and clicking on Yes at the confirmation message to truncate previous tables would lead to an exception error. File Directory Is Not Empty When Delete Duplicate UDR File Storage Profile When deleting a Duplicate UDR File Storage profile and choosing Yes to delete relational data, the system will fail to empty the File Directory. Reference Data Management Reference Data Management Table Shows No Data And All Functions Are Locked After searching in Reference Data Management with any number of results on the table, navigate away from Reference Data Management to another page. Navigate back to Reference Data Management and click on Get Started. Once the Query dialog is opened, refresh the page, and click on Query to select the same profile and table and the apply, you would find that table is now empty, and all functions are locked. Import/Export Ongoing Process Are Not Aborted When Navigating Away From Reference Data Management Running import/export processes are not aborted when navigating away from the Reference Data Management page. SAPCC Rest Agent Unable To Add Additional Parameter In Desktop Online Workflow Page In Desktop Online Add/Edit Workflow page, click on the Add button for Additional Parameters field, we will see the pop up missing Key and Value fields, so currently user is unable to add Additional Parameters in Workflow page. However, user can add Additional Parameters in Legacy Desktop. Other issues Error Thrown When SAPCC Agent Not Added With Any Host In the SAP CC Batch agent, do not add any host, click the Save As button, and you will find the error shown below: java.lang.NullPointerException: Cannot invoke \"String.matches(String)\" because \"hosts\" is null Inappropriate Validation Handling On Workflow Group Scheduling In Workflow Group Scheduling, when adding a duplicate execution day plan, it prompts the wrong validation message content and if the user continues to save, scheduling data will be wiped off. Database Forwarding Agent Validation Message In Database Forwarding Agent, when we have a field NULL/To UDR, the validation message that prompted does not properly describe the problem. External References Can Be Removed when a Workflow is Dependent on It External references of the type Database Properties can be removed even if they are in use. Any workflows using these references will become invalid. Keystore Information Is Gone After Imported Notification Workflow From MZ8.3 System Import Notification Workflow from MZ8.3, found that Keystore information in the SAP CC Notification agent is gone.",
    "title": "Known Issues - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352087016/Known+Issues",
    "word_count": 2318,
    "char_count": 14623
  }
]