[
  {
    "chunk_id": 1,
    "text": "With Execution Manager you can enable, activate, and monitor multiple workflow groups. To open the Execution Manager, go to Manage  Tools & Monitoring and then select Execution Manager . Open The Execution Manager The Execution Manager contains three tabs, Overview , Running Workflows , and Detail Views . You can open a separate Detail View tab for every workflow group or groups, that you want to monitor. Note! The times displayed in the Start time and Next run columns are based on the timezone of the Desktop Client. Overview Tab The Overview tab is comprised of the Status box and the workflow groups table. Status Log In the Status Log, you see a log of events for workflows and workflow groups, which are also displayed in the System Log . Workflow Groups Table The Workflow Groups Table displays the following information about all the workflow groups that are configured in the system: Column Description Open Selection Checkbox The selection check boxes can be used for selecting specific entries that you want to perform actions for. When selecting a check box, the table action bar will change and display a number of buttons you can use to perform different actions, see Execution Manager | Table Action Buttons and Right click Menu . Name This column displays the workflow group name. Mode This column shows whether the workflow group is enabled or disabled. If the workflow group is enabled it can be activated by its scheduling criteria. If it is disabled, the workflow group can only be started manually. State This column displays the current state of the workflow group, see Workflow Group States . Runtime Info This column displays detailed information about the workflow group state. Started By This column displays how the workflow group was started: Schedule - based on the workflow group scheduling criteria A user The parent workflow group Workflow name if it is auto-started Note! The value will be Unknown if the Platform has been restarted. Start Time This column displays the last time an execution was started. The time will be based on the timezone of the Desktop client. Next Run This column displays the next scheduled execution time. The time will be based on the timezone of the Desktop client. Note! If the workflow is not enabled this space column will be empty. Next Suspend Action This column displays the suspend action which is either the scheduled execution suspension of a configuration (workflow or workflow group) or the removal of such a suspension (activation enabling). Table Action Buttons and Right-click Menu When selecting one or multiple check boxes for workflow groups, the table action bar will change and display a number of buttons you can use to perform different actions. Right-clicking a row in the table opens a menu with the same options although they will only apply for the workflow group you right-click, that is only one single group. The following actions are available: Action Description Clear Clears all selected check boxes. This option is only available in the Table Action Bar since right-clicking a workflow group will always a one-group operation. Detail View/Open in Detail View Opens the workflow group(s) in a separate View tab in the Detail Views tab. Start Triggers execution of the selected workflow group(s). Stop Stops the execution of the selected workflow group(s). Enable Enables the selected workflow group(s). Disable Disables the selected workflow group(s). Note! In the Table Action Bar, this option is available when clicking on the three dots to the right in the panel and selecting it in the menu that is displayed. View Abort Message Opens an error dialog box that specifies the reason for aborting the execution of the particular workflow group or its workflow member. Note! In the Table Action Bar, this option is available when clicking on the three dots to the right in the panel and selecting it in the menu that is displayed. Open Editor Opens the workflow group configuration. Running Workflows Tab The Running Workflows tab displays the workflows that are currently running as well as the ones that are unreachable. Open Note! To stop a workflow, right-click on the workflow and then select Stop . You can also open the Workflow Monitor by selecting Open Monitor . The Running Workflow tab table contains the same columns as the Overview tab, as well as the following: Column Description Name This column displays the name(s) of the running workflow(s). Status This column displays the status of the workflow(s), see Workflow Monitor | Workflow_states . EC This column displays the pico name of the EC on which the workflow is running. Debug This column displays whether debug is turned on or off, see Workflow Monitor . Backlog This column displays the number of files that are yet to be processed. The value in the Backlog column is identical to the Source Files Left MIM value. Throughput This column displays the throughput for the workflow's collecting agent. The value shows either number of UDRs or bytes, depending on what the collecting agent produces, and is updated every five seconds as long as the workflow is being executed. Detail Views Tab The Detail Views tab displays the workflow group(s) that you have selected to view details for in the Overview tab. Note! Detail views are saved as part of the user preferences, and therefore enable you to export and import them along with user information. A workflow group that is marked with a yellow warning icon in the Detail View is invalid. The table in this tab contains the same columns as the Running Workflows tab as well as the following: Column Description Prereq This column displays a comma-separated list of the workflow group Prerequisites settings. See Members Execution Order . Next Suspend Action The suspend action is either the scheduled execution suspension of a configuration (workflow or workflow group), or the removal of such a suspension (activation enabling). Right-click Menu If you right-click on a row in the table, a menu opens with the following options: Entry Description Debug On/Off This option turns debug on or off for the selected workflow, see Workflow Monitor . Open in Monitor This option opens the selected workflow in the Workflow Monitor. Note! This option is not applicable to workflow groups. Opening a Detail View for a Workflow Group To open a Detail View of a workflow group: In the Overview tab, right-click the workflow group, or select the check boxes for a number of workflow groups. Select Open Detail View option in the right-click menu, or click on the Detail View button in the table action bar. The New Detail View dialog box appears. Open New Detail View dialogue Enter a unique name for the view and click OK. The Detail Views tab opens and displays the selected workflow groups and their members in a separate table. Open Detailed View tab Managing Detail Views Click on the Manage Detail Views button to set the visibility of the Detail Views of workflow groups. To Manage Detail View Tabs: Select Manage Detail Views ; the Manage Detail Views window opens. Open Manage Detail Views Select the Visible checkbox to set the visibility of Detail Views of each workflow group. In the table, you can click the Refresh button to refresh the Detail Views table or click the Delete button to delete the Detail Views table of the workflow group.",
    "title": "Execution Manager - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352073880/Execution+Manager",
    "word_count": 1232,
    "char_count": 7360
  }
]