[
  {
    "chunk_id": 1,
    "text": "View existing configurations or specific attributes by opening the file pico.conf or use the mzsh topo set command. Viewing Pico Configurations Run the following command to view one or more pico configurations: mzsh topo get <path expression> Example. Viewing a pico configuration using a full path $ mzsh topo get topo://container:main1/pico:ec2 You can view multiple pico configurations by replacing the full path with a regular expression. Example. Viewing all pico configurations using a regular expression $ mzsh topo get topo://container:main1/pico:.* Viewing Pico Attributes Pico Level Attributes Run the following command to view a specific attribute in a pico configuration: mzsh topo get topo://container:main1/pico:<pico>/val:<attribute> Example - Viewing a specific attribute in a pico configuration mzsh topo get topo://container:main1/pico:ec1/val:config.properties.ec.httpd.port Output: { \"data\" : \"9090\", \"file\" : \"/home/user/mz/common/config/cell/default/master/containergroups/default/containers/main1/ec1.conf\", \"ref\" : \"topo://cell:default/group:default/container:main1/pico:ec1/val:config.properties.ec.httpd.port\", \"result\" : 0 } You can exclude the metadata from the command output by using the --format flag. Example - Viewing a specific attribute in a pico configuration $ mzsh topo get --format data-only topo://container:main1/pico:ec1/val:config.properties.ec.httpd.port You can retrieve the attribute of multiple pico processes by replacing the full path with a regular expression. Example - Viewing a specific attribute of multiple pico configurations $ mzsh topo get --format data-only topo://container:main1/pico:.*/val:config.properties.ec.httpd.port Container Level Attributes Run the following command to view an attribute on container level: $ mzsh topo get topo://container:<container>/val:common.<attribute> Cell Level Attributes Run the following command to view an attribute on cell level: $ mzsh topo get topo://val:common.<attribute>",
    "title": "Viewing Pico Configurations and Attributes - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352185758/Viewing+Pico+Configurations+and+Attributes",
    "word_count": 236,
    "char_count": 1975
  }
]