[
  {
    "chunk_id": 1,
    "text": "Before starting any upgrade from version 8 systems to version 9 systems  no matter if standard or simplified upgrade is followed  this step is necessary. Depending on the features used, some configuration may be invalid. The same applies for some command line interface and web interface commands used in scripts. The subsections describe how to handle changes. Install a temporary version 9 system. This temporary installation will be used to export out validated configurations for use in the steps mentioned in Upgrade Platform Container from 8.3 to 9.4 | Platform Container Post Upgrade Steps Follow the standard installation instructions Installation Instructions . Port DTK extensions (if any) to Java 17 and MZ 9.4: Creating a DTK Plugin . Detailed instructions for DTK differences between the MZ versions can be found here: Porting agent configuration from Version 8 DTK . Commit your ported DTK extensions to the system. mzsh pcommit <dtk extension>.m Restore your version 8 configuration. System Import the backup configs from desktop or run following command: mzsh mzadmin/<password> systemimport <backup directory>/<filename>.zip Note that any version of 8-track configuration (8.0, 8.1, 8.2, 8.3) can be imported. See the table Managing Configuration Exports for a list of the changed and removed functionality and how to adapt your configuration or ways of working. Upgrade your CI/CD scripts. A selection of mzsh commands have been changed and/or removed. These commands are listed below. Create a script like the one below and save it to a file called search_commands.sh . #!/bin/bash # Check if the search directory is provided as an argument if [ -z \"$1\" ]; then echo \"Usage: $0 <search_directory>\" exit 1 fi # Define the search directory to search in SEARCH_DIR=\"$1\" # Define the list of commands to search for because they have been changed or removed COMMANDS=( \"agentstoinstrument\" \"apl-loglevel\" \"demo-command\" \"echo\" \"exit\" \"getconfigreferences\" \"jcreate\" \"kafka\" \"kafkaconsume\" \"keytool\" \"launch-desktop\" \"listlicensechecks\" \"og-for-assert\" \"logs\" \"noop\" \"oracle-install-3pp\" \"picoviewer\" \"quit\" \"regenconfig\" \"regenerateconfigs\" \"regenerateordered\" \"regenultra\" \"regenultras\" \"reloadkeystore\" \"saphana-install-3pp\" \"script\" \"spacecopy\" \"spacecreate\" \"spacelist\" \"spaceremove\" \"sysinfo\" \"syslogtest\" \"syslogw\" \"test-command2-file-handling\" \"test-user-mgmt\" \"udrview\" \"validateultradesc\" \"webdesktop\" \"zktest\" ) # Loop through each command and search for it in the specified directory for command in \"${COMMANDS[@]}\"; do echo \"Searching for '$command'...\" grep -rlw \"$command\" \"$SEARCH_DIR\" done Run the script against the folder where CI/CD scripts are stored. ./search_commands.sh <search folder> See table in Differences in mzsh Commands for information on replacement possibilities. Upgrade your scripts and/or interfaces using Web API. All systems using the Web Interface API must be changed to use the Operations API. Refer to Replacement of Web API for how to do the changes. Save the updated DTK extensions (if any) and CI/CD scripts (if any), and make an export of the updated configuration. This will be used in the new deployment. Export of configuration can be done in the UI, or by running the following command: mzsh mzadmin/<password> systemexport <directory>/<backup filename>.zip",
    "title": "Preparations for Upgrading from 8.3 to 9.x - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/545194266/Preparations+for+Upgrading+from+8.3+to+9.x",
    "word_count": 473,
    "char_count": 3320
  }
]