[
  {
    "chunk_id": 1,
    "text": "UDR types can be viewed in the UDR Internal Format Browser. It is accessed either by right-clicking on the text pad in the Analysis or Aggregation agents and selecting the UDR Assistance... option, or by clicking on the New Configuration button in Desktop, selecting APL Code or Ultra Format from the menu, which will open the APL Code Editor or Ultra Format Editor, and then right-clicking on the text pad and selecting the UDR Assistance... option. Open Open The AbstractWSCycle UDRs are created and saved in a folder, created and named according to the following structure: WS.[Directory Name].[WSProfile Name].cycles.[WSCycleUDR Names] The UDR types related to the XML schema are created and saved in a folder, created and named according to the following structure: WS.[Directory Name].[WSProfile Name].[alias].[complexTypeUDRs] The alias is replaced with the name of the Target Name space (tns). The name is set in the XML Schema part of the WSDL file. If the target name space has no name alias, the UDR will be saved in the [WSProfile Name] folder. Caution! When concatenating WSDL files, the aliases in the files can be identical, and if this occurs, the structure will be changed to avoid a name conflict. If the names include invalid characters, they will be replaced with underscore characters. The structure can be as follows: WS.[Directory Name].[WSProfile Name].[WSDL Filename].[alias] If the WSDL filename includes invalid name characters, these will be replaced with underscore characters in the WSDL Filename . Caution! If the WSDL file that you use to configure the WS profile includes a variable named \"Thread\", it is automatically changed to \"thread\". You must then rename the variable to thread in the APL code in the Analysis or Aggregation agent in your workflow. This prevents compilation issues when you try to compile your workflow.",
    "title": "Web Service UDR Type Folder Structure - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352115369",
    "word_count": 297,
    "char_count": 1859
  }
]