[
  {
    "chunk_id": 1,
    "text": "The Diameter Dynamic event is triggered by DNS lookups for Diameter peers. If dynamic peer discovery is enabled, these DNS lookups are performed when: A Diameter workflow is started. The routing table of a Diameter Stack agent is dynamically updated. The TTL (time to live) of a cached DNS record expires. For information about how to enable dynamic peer discovery, see the section Realm Routing Table in Diameter Routing Profile . Filtering In the Event Setup tab, the values for all the event fields are set by default to All in the Match Value(s) column, which will generate event notifications every time a Diameter dynamic event is generated. Double-click on the field to open the Match Values dialog where you can click on the Add button to add which values you want to filter on. If there are specific values available, these will appear in a drop-down list. Alternatively, you can enter a hard coded string or a regular expression. The following fields are available for filtering Diameter dynamic events in the Event Setup tab: Diameter dynamic event specific fields DynamicPeers - This field contains a comma separated list of dynamically discovered peers in a realm and their settings. The field is formatted as follows: [<host>,<port>,<protocol>],... realmName - This field contains the name of the realm for which the event is generated. Fields inherited from the Base event The following fields are inherited from the base event, and can also be used for filtering, and described in more detail in Base Event : category - If you have configured any Event Categories, you can select to only generate notifications for Diameter dynamic events with the selected categories. See Event Category for further information about Event Categories. contents - This field contains a string with event specific information. If you want to use this field for filtering you can enter a part of the contents as a hard coded string. eventName - This field can be used to specify which event types you want to generate notifications for. This may be useful if the selected event type is a parent to other event types. However, since the Diameter dynamic event is not a parent to any other event, this field will typically not be used for this event. origin - If you only want to generate notifications for events that are issued from certain Execution Contexts, you can specify the IP addresses of these Execution Contexts in this field. receiveTimeStamp - This field contains the date and time for when the event was inserted into the Platform database. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2014-06.*\" for catching all Diameter dynamic events from 1st of June, 2014, to 30th of June, 2014. severity - With this field you can determine to only generate notifications for events with a certain severity; Information, Warning, Error or Disaster. timeStamp - This field contains the date and time for when the Execution Context generated the event. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2014-06-15 09:.*\" for catching all Diameter dynamic events from 9:00 to 9:59 on the 15th of June, 2014. Note! The values of these fields may also be included in the notifications according to your configurations in the Notifier Setup tab.",
    "title": "Diameter Dynamic Event - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352172035/Diameter+Dynamic+Event",
    "word_count": 566,
    "char_count": 3365
  }
]