[
  {
    "chunk_id": 1,
    "text": "Open The following provides important information related to MediationZone 9.4: 1 Upgrade Directly from MediationZone 8.3 2 Support for Insecure Ciphers Removed 3 Deprecated Agents or Features 4 Replaced and Sunset Functionality 5 Some Functionality only Available in Legacy Desktop Client 6 Auto Edit Mode in UDR File Editor 7 REST is not Supported for Conditional Trace 8 Context-Sensitive Help and Offline Documentation in Browser Not Available 9 Performance Degradation When Using Unsupported Oracle versions and Oracle JDBC drivers 10 Importing Old IPDR SP Agent Workflow Configurations Returned Validation Errors 11 Unavailable mzsh Commands 12 Proxy Support Upgrade Directly from MediationZone 8.3 We usually require step-wise upgrades between all majors and minors, but with this release, you can upgrade directly from 8.3, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/513900786 . This is a deviation from the regular procedure for this release. Support for Insecure Ciphers Removed Support for using the old RC4 or ARCFOUR ciphers in the SFTP agents have been removed since these ciphers are considered insecure. Deprecated Agents or Features When the term deprecated is used for an agent or a feature, this means: The agent or feature is still available for use in the current version. You are not encouraged to use the agent or feature long-term. You need to switch to an alternative soon as the agent and feature will be replaced, or sunset in upcoming versions. Info ! Profiles and agents to be deprecated: REST Server profile REST Client agent REST Server agent HTTPD agent Desktop Launcher Legacy Kafka agents Real-Time Disk collection agent Real-Time Diskforwarding agent Legacy Ultra Avro Replaced and Sunset Functionality Functionality that has been replaced with a functional equivalent or sunset from the product is described in the MediationZone 9 Product Catalog here: 12. APPENDIX - Changes from 8.3 Product Catalog Some Functionality only Available in Legacy Desktop Client Certain features have not yet made it into the new Desktop and are only available in the Legacy Desktop client. These are described in Legacy Desktop . Auto Edit Mode in UDR File Editor While editing UDRs in bulk, there is a mode available called Auto Edit . Using this mode you can edit multiple UDRs using matchers and assignments. See https://infozone.atlassian.net/wiki/spaces/MD94/pages/352185299 . This mode is available in Legacy Desktop only. REST is not Supported for Conditional Trace In this new version of Conditional Trace, REST is not supported, configurations can be done in Desktop only. Context-Sensitive Help and Offline Documentation in Browser Not Available For this release, documentation is available in InfoZone and PDF format only. Performance Degradation When Using Unsupported Oracle versions and Oracle JDBC drivers As a result of our performance testing for MediationZone 9.3 and using Oracle database, there is noticeable performance degradation when connecting to Oracle versions older than Oracle 19 and using Oracle JDBC drivers older than OJDBC 10. We recommend that you use the latest supported Oracle versions and Oracle JDBC drivers when using MediationZone 9.3. Importing Old IPDR SP Agent Workflow Configurations Returned Validation Errors If you have an old IPDR Workflow configuration from version 8. x, it is possible that validation errors about invalid IPDR SP agents may occur. Example error during import: The following agents returned validation errors. IPDR_SP_1 is invalid. Default is not a valid property To resolve this, you will need to open the workflow and save the workflow configuration. Alternatively, you can manually add # to each Default value is  in the IPDR SP agents Advanced Properties tab. Unavailable mzsh Commands In this release the following mzsh commands from 8.x are not available: Command Comment Command Comment db-scripts jcreate keytool kpimodel Not needed anymore since the structure of the model can now be viewed in the user interface. apl-loglevel pexport reloadkeystore spaceactivation spacecopy spacecreate spacelist spaceremove Not valid any more since Configuration Spaces is no longer available. spark udrview echo Proxy Support Proxy support has not been added for any additional agents or functions in this release. Hint ! Proxy support has previously been added for: GCP Storage agent HTTP APL functions HTTP Batch agent HTTP2 APL Functions GCP agents HTTP/2 Client agent Salesforce Streaming agent Web Service agents Amazon S3 HTTP/2 Server agent REST Client_Deprecated Agent",
    "title": "Important Information - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352086996",
    "word_count": 693,
    "char_count": 4573
  }
]