[
  {
    "chunk_id": 1,
    "text": "The following functions for Azure described here are: 1 acquireAzureOAuthToken 2 acquireAzureOAuthTokenCustomAuthority acquireAzureOAuthToken Contacts Azure to set up an OAuth Token based on the stated parameters. AzureOAuthToken acquireAzureOAuthToken( string tenantID, string resourceID, string clientID, string certificate, string certifcatePassword ) Parameters Parameter Description Parameter Description tenantID The Tenant ID is a GUID for your instance, or domain. resourceID The Resource ID is the App ID uri of the Azure application that you want to receive an OAuth Token for. clientID Also known as an Application ID, a GUID that identifies the Azure application that is requesting the OAuth Token. certificate The full path and filename to the certificate. Must be set up on the EC that the workflow is running on. Only a PFX formatted certificate can be used. certificatePassword The password to the certificate. Returns An AzureOAuthToken UDR, or an exception if the parameters/credentials were incorrect. Example - acquireAzureOAuthToken AzureOAuth.AzureOAuthToken = AzureOAuth.acquireAzureOAuthToken(\"733f2c27-a0ca-45e1-a3b7-014bd4518ea3\", \"https://storage.azure.com/\", \"69bca157-2362-4ca7-adf3-6a26f6bd842f\", \"/opt/azure/certificate/appaccesscert.pfx\", \"verysecretpass\"); acquireAzureOAuthTokenCustomAuthority Contacts Azure to set up an OAuth Token based on the stated parameters with authorityHost . AzureOAuthToken acquireAzureOAuthToken( string tenantID, string resourceID, string clientID, string certificate, string certifcatePassword, string authorityHost ) Parameters Parameter Description Parameter Description tenantID The Tenant ID is a GUID for your instance, or domain. resourceID The Resource ID is the App ID uri of the Azure application that you want to receive an OAuth Token for. clientID Also known as an Application ID, a GUID that identifies the Azure application that is requesting the OAuth Token. certificate The full path and filename to the certificate. Must be set up on the EC that the workflow is running on. Only a PFX formatted certificate can be used. certificatePassword The password to the certificate. authorityHost The URL for the directory that Microsoft Authentication Library will request tokens from. Returns An AzureOAuthToken UDR, or an exception if the parameters/credentials were incorrect. Ex ample - acquireAzureOAuthTokenCustomAuthority AzureOAuth.AzureOAuthToken = AzureOAuth.acquireAzureOAuthToken(\"733f2c27-a0ca-45e1-a3b7-014bd4518ea3\", \"https://storage.azure.com/\", \"69bca157-2362-4ca7-adf3-6a26f6bd842f\", \"/opt/azure/certificate/appaccesscert.pfx\", \"verysecretpass\", \"https://login.microsoftonline.com/\"); This section includes the following subsection: Azure OAuth Token UDR",
    "title": "Azure Functions - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352150207/Azure+Functions",
    "word_count": 331,
    "char_count": 2745
  }
]