[
  {
    "chunk_id": 1,
    "text": "The following columns are available in the ECS Inspector table: Column Description UDRs Batches Column Description UDRs Batches Db ID This column displays a sequence number, automatically assigned to an entry. Insert Time This column displays the date and time when the entry was inserted in the ECS. Workflow This column displays the name of the workflow from which the data was sent. Agent This column displays the name of the agent that sent the entry to ECS. (ECS forwarding agent) (Collection agent) UDR Type This column displays the UDR type. Cancel Agent This column displays the name of the agent that issued the cancelBatch request. Cancel Message This column displays the message sent with the cancel request. The following example shows a user defined request, defined with APL using an Analysis agent: Example - A user request defined with APL cancelBatch(\"undefined_number_prefixes.\"); Error Code This column displays the Error Code as defined in the ECS. Error UDR Type This column displays the type of the Error UDR associated with the batch. Double-click on a table cell in this column to show information about the whole Error UDR. The Error UDR is populated with information needed in a workflow when reprocessing a batch. You can populate the Error UDR either from the Workflow properties dialog (see Error tab ), or from an agent using APL (see ECS Collection Agent Configuration ). The fields of the Error UDR automatically appear as MIM values in the reprocessing workflow. Open Example - ErrorUDR myErrorUDR eUDR = udrCreate( myErrorUDR ); eUDR.noOfUDRs = (long)mimGet( \"IN\", \"Outbound UDRs\" ); udrAddError( eUDR, \"nokSOURCE\", \"Switch not found.\" ); cancelBatch( \"Incorrect source.\", eUDR ); The error UDR format is defined as any other format from the Ultra Format Editor. internal myErrorUDR{ long noOfUDRs; }; RP Group This column displays the reprocessing group that the entry is assigned to, if any. Assignments can be made both manually and automatically. In the latter case, an Error Code must be mapped to a reprocessing group. RP State Initially, an entry has the reprocessing state New, that is the entry has not been reprocessed. In order for it to be collectable, it has to be assigned to a reprocessing group. When collected by an ECS collection agent, the state is changed to  Reprocessed. Note! Only entries in state New may be collected by the ECS collection agent. The state can manually be changed back to New if needed. Only entries set to Reprocessed can be removed. MIM Resource This column displays the MIM Resource defined in the Workflow Properties dialog. MIM Resources are configured differently for batches and UDRs: Note! To open the MIM Resource dialog, the MIM Resource field(s) have to be populated. (Configured in the Workflow properties dialog) (Configured in the ECS forwarding agent) MIM Value Double-clicking this field displays a new dialog, listing the MIM values. MIM value are configured differently for batches and UDRs: Note! To open the MIM Value dialog, the MIM Value field(s) have to be populated. (Configured in the Workflow properties dialog) (Configured in the ECS forwarding agent) Tags This column displays any tags that have been set for the UDRs. Last RP State Change This column displays the timestamp when the reprocessing state was last changed. The first time a UDR is sent to the ECS, it is set to state New, so in this case the column displays the timestamp when the UDR was inserted into the ECS. When the UDR is collected for reprocessing or if the state is changed manually, this column is updated with the current timestamp. <search field label(s)> If you have configured Searchable Fields in the ECS , the search field labels are displayed as individual columns.",
    "title": "ECS Inspector Table Columns - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/530972911",
    "word_count": 617,
    "char_count": 3748
  }
]