[
  {
    "chunk_id": 1,
    "text": "With the System Exporter, you can export data from your system into a Configuration Export (ZIP file) or a Workflow Package Export (MZP file). Note! In Legacy Desktop, you can also export to a directory. The export can contain your system's data, configurations, and runtime data. You can send this export data to another system, using the System Importer to import it and embed its contents locally. Example - How System Exporter can be used You can import a tested and exported ZIP or MZP file of configurations from a test system and use it safely in production. In System Exporter you can select data from the following folder types: Configuration: Workflow configurations, Profiles, Workflow groups, Ultra formats, alarm detectors, etc. Workflow packages: Workflow Packages are compiled versions of configuration, and are created in the Workflow Package mode in the System Exporter. See System Exporter | Workflow Package Export Type . Note! When exporting External References profiles of type Properties Database the External Reference Values will also be exported. In System Importer it can be selected if they should be imported or not. This section has the following subsections: 1 Export Types 2 Configuration Export Type 2.1 Exporting to Local Destination 2.2 Exporting to Remote Destination 3 Workflow Package Export Type 3.1 Exporting to Local Destination 3.2 Exporting to Remote Destination 4 How To Perform an Export Export Types There are two export types. They result in different behaviors when imported later. Select the one that suits your requirements: Configuration : The configurations must be compatible with the software packages of the system to which you import the configurations This is normally not a problem as long as you are using the same release. The export will be downloaded as a ZIP file. See the section below System Exporter | Configuration Export Type . Workflow Package : Export in Workflow Packages format. A Workflow Package is read-only and self-contained, with the same binaries as in the exporting system. A Workflow Package is not affected by, nor will it affect, any existing configurations when imported, since the used binaries are not replaced. When selecting Workflow Package Export Type, you compile a Workflow Package by selecting workflows in the Available Entries table. All dependent configurations will also be selected. See the section below System Exporter | Workflow Package Export Type . Note! See File System Profile to learn how to configure a File System Profile when exporting to Git or AWS S3 Bucket. Configuration Export Type You can export a configuration to your local browser or remote with a File System Profile of type Git or AWS S3. Currently, Git is available in the Desktop interface only. Open Configuration Export type - Local Destination Open Configuration Export type - Remote Destination When the Export Type is Configuration you can select data from the following types: Configuration: Workflow configurations, agent profiles, workflow groups, Ultra formats, or alarm detectors. Run-time: Some data that is generated by the system during workflow run-time. Clear the Option Exclude Runtime Data checkbox. System: Other customized parts such as; Data Veracity, Event Category, Folder (structure), Pico Host, Ultra, User, or Workflow Alarm Value. Workflow packages: Workflow Packages are compiled versions of configuration, and are created in the Export type Workflow Package in the System Exporter. The following options can be found on the toolbar: Option Description Option Description Export This will export the selected configuration(s). The behavior is different depending on your choice of Destination. Described in detail below. Refresh Refreshes the list of shown configurations. Options This will open the Options menu. Each available option can be toggled by the user. See the section System Exporter | Configuration Export Type Expand all Expands all folders in the Available entries section. Collapse all Minimizes all folders in the Available entries section. Configurations Export Type Options Based on the chosen options in the export window, the running system will execute the export operations differently. Open Configurations export type options The following options can be toggled by the users using the Options menu. Export Option Description Export Option Description Abort on error Select this option to abort the export process if an error occurs. If an error occurs and you do not select this option, the export will be completed, but the exported data might contain erroneous components. Note! Invalid Ultra and APL definitions are considered erroneous and result in aborting the export. Select Dependencies Select this option to have dependencies follow along with the entries that you actively select. Encryption Activates encryption on the chosen export. Exclude Runtime Data When enabled it excludes locally stored runtime data from the export. The runtime data that can be included is, Aggregation Session Data and Archive data Export as XML Exporting configuration objects with this option enabled will create compressed XML files instead of JSON. Exporting to Local Destination When the Export to Local Destination is complete, a dialog showing the exact time of the export appears, and the export is automatically downloaded and saved in your default download location. Open Dialog after Successful Export Exporting to Remote Destination When you click the Export button, the following dialog opens and you need to select a File System Profile . You can select the File System Profile either as Git or AWS S3 . Open Select a File System Profile When a profile is selected more fields will appear. When a Git File System Profile is selected it will look like this. Open File System Profile - Git Option Description Option Description Commit message The message will be visible in the Git log. Repository/Branch Read-Only Field, showing the Remote repository name and the branch selected in the profile. Select Target Folder A table showing the folders in the current repository, see GIT Support . New Folder Button Create a new folder on the root level. New Folder Icon on each row Create a new folder under the selected row When an AWS S3 File System Profile is selected it will look like this. Open File System Profile - AWS S3 Option Description Option Description File Name The file name of the export. It will automatically become a Zip file. Select Target A table showing the folders in AWS S3 Bucket. Select a folder to export to, when no folder or file is selected the export will be uploaded to the top level of the Bucket. Workflow Package Export Type When this type is selected, Workflow Packages can be created and exported as a MZP file. A Workflow Package is read-only and self-contained, with the same binaries as in the exporting system. A Workflow Package is not affected by, nor will it affect, any existing configurations when imported, since the used binaries are not replaced. When the Export Type is Workflow Package you can select data from the following types: Configuration: Workflow configurations, agent profiles, workflow groups, Ultra formats, or alarm detectors. System: Other customized parts such as; Data Veracity, Event Category, Folder (structure), Pico Host, Ultra, User, or Workflow Alarm Value. Open When one configuration is selected all dependent configurations will also be selected. Export Option Description Export Option Description Export The behavior is different depending on your choice of Destination. Described in detail below. Refresh Refreshes the list of shown configurations. Options This option is not available in workflow package selection mode. Expand all Expands all folders. Collapse all Collapses all folders. Exporting to Local Destination When you select to export to Local Destination, the following dialog box opens. In this dialog box, specify the Package name and Package version . The Output option can also be chosen  the file can either be downloaded to your browser as an MZP file or committed (inserted) to the system. Open Local Workflow Package Export Specify the following information in the Workflow package export options: Package name : The name of the workflow package. Package version : The version of the workflow package. Output option : Specify the output option of the workflow package. Select the Download option if you want to download the file to your browser as an MZP file or select the Commit option to create the Workflow package and import into the current system. Exporting to Remote Destination When you select to export to Remote Destination , the following dialog box appears. Select the File System Profile of type AWS S3. When the profile is selected more fields will show. Open Remote Workflow Package Export Specify the following information in the Workflow package export options: Package name : The name of the workflow package. Package version : The version of the workflow package. Output option : Only Download is valid when the destination is Remote Select Export Folder: A table showing the folders in AWS S3 Bucket. Select a folder to export to, when no folder is selected the export will be uploaded to Bucket top level. How To Perform an Export Note! Since no workflow state, i.e. File Sequence Number, is included in the exported data and only the initial value is exported, you need to take note of information such as file sequence numbers in Collector agents. Select Export Type, Configuration, or Workflow Package . Select Destination, Local or Remote In the System Exporter, select options according to your preferences in the Options dialog. Expand the folders in Available Entries and select the checkboxes in the Include column for the entries you want to export. Click the Export button to start the export process or to fill in the information regarding the Remote destination or Workflow Package name.",
    "title": "System Exporter - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352074086/System+Exporter",
    "word_count": 1588,
    "char_count": 9940
  }
]