[
  {
    "chunk_id": 1,
    "text": "The SNMP Request agent accepts input in the form of SnmpRequestUDR . Such input triggers the agent to produce a request to the specified target. This UDR is routed as input to an SNMP Request agent to trigger it to perform a request for a specific OID to a specific target. There are two kinds of triggered requests - resolved and unresolved. Resolved requests are mapped to the generated UDR structure of the connected SNMP profile. Unresolved requests are simple OID-Value mappings. Unresolved requests are also divided into scalar and tree requests. A scalar request retrieves a single scalar value while a tree request retrieves an entire MIB subtree, in the form of a flattened OID-Value map. If the Network Element is not specified in the CSV file, there are also fields available in this UDR for initiating a request. Setting Description Setting Description unresolved (boolean) This flag controls if the request is unresolved or not. tree (boolean) This flag controls if the request is a sub tree request or not. It is only valid if unresolved is true. community (string) What community to use for the request. baseOid (string) Base part of the OID to request. This field cannot be used with oidList . instanceOid (string) Instance part of the OID to request. This field cannot be used with oidList . oidList (list<OidUDR>) List of OIDs if you want to request several at the same time. remotehost (string) Address of host to send request to. remoteport (int) Port of host to send request to. Fields for initiating requests authPassword (string) authProto (int) context (any) contextEngineID (string) contextName (string) description (string) privPassword (string) privProto (int) retries (int) timeout (int) user (string) version (int)",
    "title": "SnmpRequestUDR - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352180115/SnmpRequestUDR",
    "word_count": 283,
    "char_count": 1743
  }
]