[
  {
    "chunk_id": 1,
    "text": "Search this document: Below are the terms and acronyms used throughout the MediationZone documentation. Terms Term Definition Agent An application that executes a specific task in a workflow. There are three types of agents: collection, processing and forwarding agents. Analysis Programming Language A structured programming language, used by the Analysis and Aggregation agents to analyze or manipulate UDR fields. Asynchronous agent An asynchronous agent enables the workflow to process multiple UDRs simultaneously by using a queue for each output route. Batch A file, containing external data records, that can only be collected by offline workflows. Offline workflows are also referred to as batch workflows. Begin Batch Indicates the start of a data batch to be fed into a workflow. All collection agents emit Begin Batch messages at the beginning of a data batch. Cancel Batch A message initiated by any agent that wants to cancel the current batch. Cell Cells contain a set of Container Groups. At the time of writing, only one predefined cell ( default ) is available. Collection Agent An agent that collects and inserts data into workflows, including file based and UDR based collectors. Configuration Configurations in the system include all the objects that you find in the Configuration Browser, for example, workflow configurations, agent profiles, workflow groups, Ultra formats, or alarm detectors. Data Batch The data transferred through a Workflow between a Begin Batch and End Batch message. In file based mediation, a data batch often contains a complete file. End Batch Indicates the end of a data batch fed into a Workflow. Error Correction System A central repository for erroneous records and batches. Execution Container In addition to the Platform Container, a MediationZone system may have several Execution Containers. Each container supports running any number of Execution Contexts (ECs) and Service Contexts (SC). Execution Context Execution Contexts are responsible for executing workflows. Execution Contexts may run both in the Platform Container and in any number of Execution Containers. Forwarding Agent An agent that distributes data from workflows. System A MediationZone system, refers to a Platform Container and any number of Execution Containers. System Installation The result of one or more Container installations, including the Platform Container. Meta Information Model MIM - Some agents in a workflow need information from the workflow or other agents in order to operate. For example, an agent that produces a file might need the source file name and the number of processed UDRs to be used in the outgoing file name. MediationZone uses the Meta Information Model to enable this. MIM resource An identifier for a specific resource, published by the Workflow or an agent. MIM resources are static during the workflow execution. MIM value The current value of a MIM resource. MIM resources can be assigned their values either statically, or when receiving Begin Batch or End Batch messages. MZ_HOME The installation directory of a container. Pico Configuration A set of attributes in the STR that defines a pico instance. Pico Instance A segment of MediationZone that is also a Java Virtual Machine (JVM). Pico Instances can be of the different types: Execution Context (EC) Command Line Platform Desktop Service Context (SC) Platform A core part of MediationZone that is responsible for providing services to other pico instances. Platform Container Each MediationZone system must have one Platform Container that includes the Platform. Additional Platform Containers may exist in a system, for high availability, but only one is active at a time. The Platform Container may also have Execution Contexts (EC) and Service Contexts (SC). Processing Agent An agent that processes data in a workflow. In a workflow, a processing agent can either have one incoming and one outgoing data stream, or just one incoming data stream. Profile A global configuration that is used by the agents. Some agents require a profile to finalize the configuration of the agent. Related UDRs Partial UDRs that originate from the same long-duration data exchange between two devices. Session An information record that MedationZone samples at any time during execution of a workflow. This record enables a recovery of the exact status of the workflow, when a failover occurs. In MediationZone, a session is considered to be closed either when a timeout occurs or when a predefined closing criteria (an APL if condition) is met. A session remains active until it is removed with the sessionRemove() function. Service Context Service Contexts are responsible for providing running distributed services that are required by various components in the system. Service Contexts may run both in the Platform Container and in any number Execution Containers. STR Container Each MediationZone installation is assigned a container name, to identify it uniquely within a MediationZone system. Put differently, the container name is an identifier for an MZ_HOME directory on a particular host. One host (physical or virtual) may hold several Containers, each one with a unique name and installed in separate MZ_HOME directories. Containers are used by STR to reference a MediationZone installation on a host. Pico instances can be defined for one or more containers. STR Container installation The result of running the MedationZone setup scripts to install the software in a (MZ_HOME) directory on a physical or virtual host. STR Container Group A Container Group contains a set of containers. At the time of writing, only one predefined Container Group ( default ) is available. Synchronous Agent A synchronous agent finishes processing of each UDR before it retrieves the next UDR in the queue. System A MediationZone system, refers to a Platform Container and any number of Execution Containers. System Installation The result of one or more Container installations, including the Platform Container. System Topology Registry A data structure that holds configurations, service configurations, and attributes that control the behavior of MediationZone. The data in STR can be edited in the System Administration GUI, text editor, or via the Command Line Tool (mzsh). Ultra The MediationZone format management system. Ultra Format Definition Language UFDL - An enriched programming language used to describe the physical structure of incoming and outgoing (external) data, internal (working) formats, as well as decoding and encoding rules. Usage Detail Record UDR - the MediationZone translation of what otherwise is known as CDR, Call Detail Record. Workflow A workflow is an executable object that is represented by a Workflow Table row in a Workflow configuration, an Execution Manager row, and a Workflow Monitor view. A workflow is included in a w orkflow configuration . You define a Workflow in the w orkflow configuration , further described in the Desktop User's Guide. Workflow Configuration A Workflow configuration consists of: A process-definition of agents and the routes between them (referred to as a template) Workflow Properties One or several workflow table rows (see Workflow) Workflow Group A group of workflows that are configured as a single entity and share criteria for scheduling and execution. Acronyms Acronym Definition APL Analysis Programming Language CRC Cyclic Redundancy Check DB Database EC Execution Context ECS Error Correction System FTP File Transfer Protocol GTP GPRS Tunneling Protocol GUI Graphical User Interface HA High Availability HOCON Human Optimised Config Notation HTTP Hypertext Transfer Protocol IP Internet Protocol IPDR Internet Protocol Data Record JAR Java Archive JMX Java Management Extensions JVM Java Virtual Machine MIB Management Information Base MIM Meta Information Model MZ MediationZone OS Operating System RAC (Oracle) Real Application Clusters RCP Remote Communication Protocol REST Representational State Transfer RTBS Real-Time Billing System SC Service Context SCP Secure Copy Protocol SFTP SSH File Transfer Protocol SID (Oracle) System ID STR System Topology Registry SQL Structured Query Language TCP Transmission Control Protocol TLS Transport Layer Security UDR Usage Detail Record UFDL Ultra Format Definition Language XML Extensible Markup Language",
    "title": "Terminology - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352151628/Terminology",
    "word_count": 1276,
    "char_count": 8345
  }
]