[
  {
    "chunk_id": 1,
    "text": "The MQTT agent generates Error, PublishAck and SubscribeResponse while it receives Publish, Subscribe and Unsubscribe. Error UDRs The following fields are included in the Error UDRs: Field Description Field Description affectedUDR (DRUDR) This field stores the unprocessed UDR in case of an error in processing by the MQTT agent. message (string) This field contains the error message from the MQTT agent. OriginalData (bytearray) This field contains the original data in bytearray format. PublishAck UDRs The following fields are included in the PublishAck UDRs: Field Description Field Description broker (string) This field contains the broker connection details in the following format: tcp://<ip address/hostname>:<port> complete (boolean) This field contains a value from the broker that indicates if the topic has been completely published. messageID (int) This field contains the identifier for the message. topics (list<string>) This field contains the list of subscribed topics for this particular broker. OriginalData (bytearray) This field contains the original data in bytearray format. SubscribeResponse UDRs The following fields are included in the SubscribeResponse UDRs: Field Description Field Description broker (string) This field contains the broker connection details in the following format: tcp://<ip address/hostname>:<port> data (bytearray) This field contains the data sent by the MQTT broker in bytearray format. id (int) This field contains the identifier for the message. qos (int) This field indicates the QoS value for this particular message. topic (string) This field indicates the MQTT topic for this particular message OriginalData (bytearray) This field contains the original data in bytearray format. Publish UDRs The following fields are included in the Publish UDRs: Field Description Field Description data (bytearray) This field contains the data sent to the MQTT broker in bytearray format. messageID (int) This field contains the identifier for the message. qos (int) This field indicates the QoS value for this particular message. retain (boolean) This field indicates if retain is set to true or false. topic (string) This field indicates the MQTT topic for this particular message OriginalData (bytearray) This field contains the original data in bytearray format. Subscribe UDRs The following fields are included in the Subscribe UDRs: Field Description Field Description qos (list<int>) This field contains a list of QoS values for the topics in the UDR. topics (list<string>) This field contains a list of topics for the UDR OriginalData (bytearray) This field contains the original data in bytearray format. Unsubscribe UDRs The following fields are included in the Unsubscribe UDRs: Field Description Field Description topics (list<string>) This field contains a list of topics for the UDR OriginalData (bytearray) This field contains the original data in bytearray format.",
    "title": "MQTT UDRs - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352112144",
    "word_count": 426,
    "char_count": 2925
  }
]