[
  {
    "chunk_id": 1,
    "text": "You can query the data stored in Data Hub via the Selection Screen in the Manage view. This requires that your user account belongs to an access group with execute permissions on Data Hub. For further information about access groups, see Access Controller . Data Hub Panel To query the Data Hub you must first select a Data Hub profile and one of its associated database tables in the Data Hub panel. Click the Filter button to open the Data Hub Profile panel and click Browse to select the relevant Data Hub profile. Open Data Hub selection panel Query Panel When you have selected a database table, you can configure the following: Display fields Search Query Open Data Hub Query Panel Display Fields This shows the database table columns that you would like to display in the Query Results . Open Display Fields selection dialog box Search Query This panel represents an expression based on the columns in the selected table. When you run a query, rows in the table that matches the expression will be displayed in the Query Results . Open Data Hub search query Item Description Item Description AND Click this button to apply AND logic on a set of rules or groups. OR Click this button to apply OR logic on a set of rules or groups. Field name This drop-down list contains columns in the selected database table that you can use in your query. The query is carried out based on this selection to populate the result for the Display Field. Open Field names Operator This is a comparison operator that is applied to the values in the specified column and the value. The available operators are listed according to the data type of the selected column. Open Operators drop-down Data Types and Operators All types equal not equal Integer- Floating-point- Date types less less or equal greater greater or equal between not between is null is not null String types equal not equal begins with does not begin with contains does not contain ends with does not end with is empty is not empty is null is not null Value This field contains a value that is used for comparison with the selected column. When between and not between is the selected operator, two value fields are displayed. When you click this field and the column is of a date type, or a column with a type hint in the selected profile, a date picker will be displayed. Add Click this button to add a new rule to the expression. Add Group Click this button to add a group of rules within the expression. The groups can be nested. Delete Click this button to delete a rule or a group. When you delete a group, the rules contained within it will be deleted as well. Reset Click this button to clear all rules and groups from the Search Query panel. OK Click this button to run a new query based on the configured rules. Running a Query To run a query: If your query should contain both AND and OR logic, delete the first rule by clicking on the Delete button, then and add a new group by clicking the Add Group button. Groups are not required, if the query contains only AND or OR. If you have created a new group, click the Add rule button to add a new rule. Select a column that you want to use in a rule. Select an operator. Enter a value for comparison with the selected column. Use the Add group and Add buttons to add more group conditions to the expression. Click the OK button. The result will be displayed in the data grid in the Query Results panel. It may take a few seconds or several minutes for the query to complete. Query Results Panel The Query Results panel will display all available rows including columns. The number of rows is indicated on the top right, next to the Export button. Open Data Hub query results Item Description Item Description Displayed Columns This is a list of columns in the selected table that are displayed in the Query Results panel. Export Click this button to export the query result content to a CSV file. For further information, see the section below, Exporting Query Result. Exporting Query Result To export a query result follow the steps below: Click the Export button in the Query Results Panel . In the Export search result dialog, enter the following: Filename - The export filename should contain alphanumeric- or dash (-) characters. Do not add a file extension or a path. Delimeter - You can enter a character or string that should represent the separator token, e.g. a comma or a semi-colon. Open Export search result dialog Select the check box Include Header to add the column names to the first row in the file. Click the OK button. The file will be saved as <filename>.csv in your default download folder. All the columns of the table will be included in the file.",
    "title": "Data Hub Query - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352182704",
    "word_count": 845,
    "char_count": 4685
  }
]