[
  {
    "chunk_id": 1,
    "text": "Usage usage: wfgroupremovewfgroup <workflow group name> <pattern match expression for workflow group names> This command removes one or more workflow groups from a workflow group. With this command you compare a single pattern match expression, or several, with the full workflow group name, <folder>.<workflowgroupconfigurationname>.<workflowgroupname> , of all the workflow groups. For further information about pattern match expression see mzsh Textual Pattern Matches . Note! With wfgroupremovewfgroup you cannot remove all the workflow groups from a workflow group, as this will result in an invalid workflow group configuration. In that case, the command aborts and an error message informs you about the abort cause. As the workflow group should not be emptied, the command enables you to remove all the workflow groups from the parent workflow group only if the workflow group also contains a workflow. This way, after removing all the workflow groups, the parent workflow group is not empty. See the figure below, The wfgroupremovewfgroup Command. Open The wfgroupremovewfgroup Command Return Codes Listed below are the different return codes for the wfgroupremovewfgroup command: Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if the number of arguments is incorrect. 2 Will be returned if the group is not found. 3 Will be returned if the workflow(s) you want to remove cannot be found. 4 Will be returned if there is no connection to Mgmt_Utils. 5 Will be returned if the group is locked. 6 Will be returned if the updating of group data failed. 7 Will be returned if the configuration lock could not be released. 8 Will be returned if the group is empty (all members have been removed).",
    "title": "wfgroupremovewfgroup - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352185122/wfgroupremovewfgroup",
    "word_count": 279,
    "char_count": 1755
  }
]