[
  {
    "chunk_id": 1,
    "text": "In a Reference Data profile configuration, you can select the tables that should be available for query and editing via the Reference Data Management dashboard or RESTful interface. For information about these interfaces, see the Reference Data Management Dashboard or RESTful Interface for Reference Data Management . This profile is loaded when you start the Platform. To create a new Reference Data profile configuration, click the New Configuration button from the Configuration dialog available from Configuration View , and then select Reference Data Profile from the menu . The contents of the menus in the menu bar may change depending on which configuration type has been opened in the currently active tab. The Reference Data profile uses the standard menu items and buttons that are visible for all configurations, and these are described in Common Configuration Buttons . To open an existing Reference Data profile configuration, click on the configuration in the Configuration Navigator, or right-click on the configuration and then select View Configuration . General The General tab is displayed by default. Open Reference Data profile - General tab Setting Description Setting Description Database This is the database the agent will connect and send data to. Click the Browse... button to get a list of all the database profiles that are available. For further information see Database Profile . If changes have been made in the selected database, click the Refresh button to retrieve updated db metadata that will be reflected in the table selector when adding entries into the Tables section of the configuration dialog. The Reference Data profile is supported for use with the following databases: Oracle PostgreSQL MariaDB SAP HANA Enable Enhanced Logging When you perform any of the following operations, entries are written to the System Log, and DB Ref event notifications are generated: Commit changes to the database Perform import operations Select Enable Enhanced Logging to include information about executed SQL statements in the event notifications. For more information about DB Ref events, see DB Ref Event . Tables Configurations of selected tables are listed here. Open Reference Data Profile - Add Table Dialog Setting Description Setting Description Table Select a table for the selected database with this table selector. Read Select this check box to enable read access to the selected tables. Users of the profile can query and export data. Write Select this check box to enable write access to the table data. If Read is also selected, users of the profile can insert, update, delete and import data. Last Update Select this check box to enable the Last Update feature. Last Update allows users to specify two columns in the table that will be used to automatically record the username and timestamp of when an entry was updated. Note! When creating tables to include the User column and Timestamp column, ensure that these columns are not UNIQUE and does not have any PRIMARY KEY constraints. The datatype for the User column should be set as VARCHAR and datatype of the Timestamp column should be set as TIMESTAMP. User Column This is to specify the name of the User column to be used for the Last Update feature. This column will be updated with the name of the last user to perform an operation on the record. This column can not be edited from Reference Data Management UI Timestamp Column This is to specify the name of the Timestamp column to be used for the Last Update feature. This column will be updated with the the timestamp when performing an operation on the record. This column can not be edited from Reference Data Management UI To Add a Table Note! Reference Data Management does not support tables that contain a column that has both GENERATED ALWAYS AS IDENTITY and PRIMARY KEY constraints. Having one or the other constraint in a column in your table will not affect Reference Data Management. Note! Modifications to a reference data entry are supported either on Oracle (based on ROWID pseudo column) or Postgres tables containing Primary Key constraint. Postgres tables without a Primary Key are not supported for data modifications. Note! Reference Data Management does not support the use of case sensitive identifiers. Click on the Add button. Select a table from the drop down list. Always select the Read access check box. If you want to enable editing of the table table, also select the Write access check box. If you want to enable Last Update, select the Last Update check box. Then fill up the User column and Timestamp column with the column names of your choice. Advanced In the Advanced tab, you can configure additional properties. You can use these parameters to tune the performance of database operations. Open Reference Data profile - Advanced tab prefetchSize - This setting defines the number of rows retrieved from the database in a single network round trip. Increasing the fetch size can improve query performance by reducing the number of trips between the application and the database, which is especially beneficial over high-latency connections. However, setting the fetch size too high may lead to increased memory consumption and potential out-of-memory errors. If prefetchSize is set to 0, no limit will be applied. The default value is 1000. maxRowsPerQuery - This setting sets the maximum number of rows returned for each query or table. It directly affects operations such as exporting results, for example, when using Manage  Reference Data Management  Export  Export Retrieved Rows (export query results). The default value is 50000.",
    "title": "Reference Data Profile - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352085007",
    "word_count": 915,
    "char_count": 5632
  }
]