[
  {
    "chunk_id": 1,
    "text": "The APN UDR types include the following UDRs: APNUDR APNResult APNUDR When the APN agent receives an APNUDR , it sends the message to the Apple device referenced by the DeviceToken . Open APNUDR fields The following fields are included in the APNUDR UDR: Field Description Field Description Body (string) This field contains the content of the text message to be sent. CustomPayload (string) This field contains a custom message with all the tags to be included. When populated (not set to null), it will override the contents of the Body and Title fields. Example - CustomPayload {\"acme2\" : [ \"bang\", \"whiz\" ]} DeviceToken (string) This field contains the token for the device that will receive the message. Title (string) This field contains the title of the text message to be sent. Example - Generated message from Body and Title fields APL: consume { APNUDR aUDR = udrCreate(APNUDR); aUDR.Body =\"This is an example.\"; aUDR.DeviceToken=\"7bd78578c2d702201cb291cdec4ad8e736c893b531deae602451e80617b53ae9\"; aUDR.Title=\"Example Title\"; udrRoute(aUDR); } Message: {\"aps\":{\"alert\":{\"body\":\"This is an example.\",\"title\":\"Example Title\"}}} APNResult Once the APN agent has sent a text message in response to an APNUDR UDR, it returns an APNResult UDR. Open APNResult UDR fields The following fields are included in the APNUDR UDR: Field Description Field Description Code (int) This field indicates the result of the push notification attempt, with the following result codes: 0 - OK 1 - Rejected 2 - Timed out 3 - Error Message (string) This field provides a description for each result code: 0 - Empty 1 - Message from Apple describing reason for rejection 2 - Timeout 3 - Content of any exception that has occurred Notification (APNUDR) This field contains the original APNUDR UDR received by the agent.",
    "title": "APN UDRs - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352173999/APN+UDRs",
    "word_count": 280,
    "char_count": 1802
  }
]