[
  {
    "chunk_id": 1,
    "text": "This page describes how you can view, update, create, and delete picos in the Pico Management screen in Desktop. View Picos To view the existing picos, open the Pico Management screen by clicking on the Manage screen option in Desktop and then clicking on Pico Management . Open Pico Management All picos in the different containers are displayed with the following information: Column Description Column Description Name At the top level in this column, all the containers in the system are displayed. Click on the arrow to the left of the container name to expand/collapse the list of picos within each container. Each pico is displayed with its defined name, e g platform, ec1, ec2, sc1. Type This column displays the pico type; container, platform, ec, or sc. State This column displays the current state of the pico; Not-started, Starting, Restarting, Stopping, or Running Action This column contains an Edit button that you can use to edit the pico configuration. Only picos of ec and sc types can be edited. Update Picos To edit a pico configuration: In the Pico Management screen, click on the Edit button for the pico you want to update. The Edit Pico dialog will open up. Open Edit Pico dialog Update the pico configuration as described in Updating Pico Configurations . You can click on the View Resolved Config button to exit edit mode and view the full pico configuration. Click on the button again to resume editing. When you are finished, click on the Save button. The Update Pico Configuration dialog will open up, asking you if you are sure you want to update. Open Update Pico Configuration dialog Click OK if you are sure. When the updates have been applied, you will get a message that the update was successful. Open Create a New Pico To create a new pico configuration: In the Pico Management screen, click on the New Pico button. The Create New Pico dialog will open up. Open Create New Pico dialog Select for which container you want to create the pico in the Container drop-down list. Enter a name for the pico in the Name field. If the name already exists you will be notified with a red warning text and will have to enter another name to proceed. Select which template you want to use in the Template drop-down list. The editable parameters in the selected template will be displayed in the coding area beneath. See Managing Picos with Topo for more information about the templates. Edit the parameters as described in Creating Pico Configurations . If you want to view the template you can click on the View Template button. Click on the button again to revert to edit mode. Click on the Create Pico button when you are finished. When the pico has been created, you will get a message that the pico was successfully created. Open Deleting Picos Picos can only be deleted when they are not running. To delete a pico: In the Pico Management screen, stop the pico as described in Starting, Stopping and Restarting Picos . Click on the Delete button for the pico. The Delete Pico dialog will open up asking you if you are sure you want to delete the pico. Open Delete Pico dialog Click OK if you are sure. When the pico has been deleted, you will get a message saying that the pico was successfully deleted. Open",
    "title": "View, Update, Create, and Delete Picos - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352151191/View+Update+Create+and+Delete+Picos",
    "word_count": 570,
    "char_count": 3237
  }
]