[
  {
    "chunk_id": 1,
    "text": "Click the User icon on the top right side of the Desktop Online User Interface to open the User Settings menu. Open User Settings menu The menu contains the following options: Option Description Option Description Profile Click the Profile option to open the User profile dialog. Open User profile dialog The following settings are available: Username - Displays your username. Name - Displays your full name as registered in the system. Email - Displays your email address as registered in the system. Enable High Contrast Mode - You can enable the High Contrast mode to make texts across the system easier to read in case of visual impairment problems. Show Environment Name - You can hide or show the environment name. Theme - You can select between Light or Dark mode. You can also choose to follow the mode set by the Operating System by selecting System . About Click on the About option to display information about your installation. Open About dialog Installed packages Click the Installed packages option to display information about all the installed packages in the system. The same information can be obtained by using the the mzsh/mzcli https://infozone.atlassian.net/wiki/x/sWP9F command. Use the Search field to search for a specific package. Open Installed packages dialog Downloads Click the Downloads option to open the Downloads dialog. Open Downloads dialog From this dialog you can download Desktop Launcher and Devkit. Click on the respective file names and they will be downloaded. Change password Click the Change password option to change your password. Open Change password dialog Enter your Current password, enter a New password , and then reenter the new password in the Confirm password field. Click Submit to apply. Log out Click this option to log out of Desktop.",
    "title": "User Settings - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352171210/User+Settings",
    "word_count": 291,
    "char_count": 1796
  }
]