[
  {
    "chunk_id": 1,
    "text": "We are excited to announce the release and general availability of MediationZone 9.4! The key focus areas in this release are related to usability, productivity, and operational clarity. It introduces enhancements that simplify configuration management, improve visibility into system behavior, streamline error analysis, and increase development efficiency. With intuitive tools for tracking and comparing configurations, navigating faster using context menus and keyboard shortcuts, analyzing ECS errors visually, and inspecting data directly within Desktop, you can work more efficiently, reduce manual effort, and gain deeper insights into your system. Some of the key features and enhancements are: Configuration Tracer The Configuration Tracer feature in Desktop is a powerful tool for tracking and managing configuration changes. You can view both active configurations and historical versions, including deleted ones, providing full visibility into configuration history. This will improve troubleshooting, compliance, change management, and operational efficiency. With the possibility to restore deleted configurations, you can quickly recover important designs and maintain system integrity. It also provides detailed metadata, including ownership, access permissions, version history, and references to related configurations, offering a comprehensive audit trail for traceability purposes. Keyboard Shortcuts The usability and efficiency in the Configuration Browser have been improved with the addition of right-click actions and keyboard shortcuts for common tasks. You can quickly perform actions such as cut, copy, paste, delete, rename, encrypt, and open configurations or folders, reducing the amount of manual navigation and repetitive clicks. The context menu dynamically adapts to single or multi-selection, and new configurations are saved to the selected folder by default, ensuring logical organization. Redundant actions have been removed to enhance clarity, and additional keyboard shortcuts support faster, more accessible workflows. Tab Titles and Environment Indication Tab Titles and Environment Indication enhances clarity when you are working across multiple environments by displaying the value of the mz.name parameter directly in tab titles. This reduces the risk of cross-environment mistakes and improves context awareness during daily operations. While the default value remains DR, the parameter can now be customized to reflect environment-specific identifiers, with constraints on length, truncation, and allowed characters to be documented and enforced. Though rarely changed after installation, upcoming validation logic in install scripts and tools like Topo will ensure consistency. Additionally, mz.name continues to support uniqueness in config key names and system exports, maintaining clarity and traceability across configurations. Added Functionality in Desktop Online In this release, we have added the following functionality in Desktop, which was previously only available in Legacy Desktop: Configuration Diff  for easy comparison of configurations with visually highlighted differences, enhancing troubleshooting, auditing, and overall system reliability. DevKit  for creating and using your own DevKit plugins with associated documentation available using the Help button. Agent plugins can be used directly in the workflow editor, and with the notifier plugins, you get a centralized interface for managing notifications, improving efficiency. ECS Statistics  for a clear and comprehensive view of error code distributions, helping you to quickly identify patterns and troubleshoot issues more efficiently. Pie charts display error codes, offering clear visibility into the most frequent and impactful issues; and numerical values within the chart further enhance clarity, making it easier to interpret data at a glance, strengthening error analysis, system monitoring, and operational efficiency. ECS Inspector - for inspecting, editing, and managing UDRs and batches stored in the ECS, helping you ensure data integrity and take corrective actions without restarting upstream processes. You can view detailed record content, assign data to Reprocessing Groups for reprocessing via ECS collection agents, and apply user-defined metadata such as custom error codes or cancellation messages to enhance traceability and diagnostic clarity. Upgrade Support A direct upgrade from MediationZone 8.3 to 9.4, without requiring stepwise upgrades through intermediate versions, is supported in this release, and documentation for this procedure is available. The documentation includes specific instructions for this upgrade path to ensure compatibility and a consistent upgrade process. This exception has been put in place to enable customers to more easily upgrade to the latest version to take the best advantage of newer features and simplify the development and management of the platform. We encourage you to explore all the detailed features and enhancements below to gain a comprehensive understanding of the capabilities in MediationZone 9.4: New Features Usability Dashboard View Environment Indicator Additional Functionality Made Available in Desktop Additional HTTP Security Headers Documentation Generator Integration and Monitoring New Command Line Interface - mzcli Enhancements HTTP/2 Improvements HTTP/2 Client Agent Supports new OAuth2UDR HTTP/2 Server Agent Supports Dynamic Public Key HTTP/2 Server Agent Supports Additional Certificate Validation Usability Improvements Configuration Browser Supports Additional Keyboard Shortcuts Code Editors Supports Additional Keyboard Shortcuts Workflow Template Adds Context Menu New Icons Documentation Improvements Pico Management with Topo Status Codes for REST Server Database Sizing Log Forwarding Properties Other Improvements Running Authorization Server on Either Platform or EC Host Header Validation All of these are explained in more detail in MediationZone 9.4 Release . Information about where the release can be accessed is available here: Release Information . Overall user documentation is available at: https://infozone.atlassian.net/wiki/spaces/MD94 . Enjoy!",
    "title": "User Documentation 9.4 - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94",
    "word_count": 838,
    "char_count": 6188
  }
]