[
  {
    "chunk_id": 1,
    "text": "This section describes environment variables that are used and the directories and files that are created at installation. Depending on the type of installation (Platform or Execution Container), there may be less directories and files than listed here. Environment Variables The following environment variables are set in MZ_HOME/bin/mzsh after installation. Variable Description JAVA_HOME This environment variable specifies where the JDK is installed. Example value: /opt/jdk/jdk-17.0.2 MZ_CONTAINER This environment variable specifies the container name. Example value: container1 MZ_CONTAINER_TYPE This environment variable specifies the container type. It is typically not changed. Example value: platform MZ_PLATFORM This property specifies a URL, which contains the IP address or hostname of the Platform Container and the Web Interface port. When you have entered a hostname and failover occurs, the hostname is retrieved from the DNS enabling reconnection. If you have entered a static IP address as the value of this property reconnection issues may occur if the IP address changes. The port must be unique for each MediationZone system. Example value: http://localhost:9000 MZ_HOME This is the directory where the Platform Container or Execution Container container is installed. Example value: /opt/mz/container1 You can view and set these environment variables by using the mzsh command topo env. For further information, see https://infozone.atlassian.net/wiki/spaces/MD93/pages/204646579/topo?atl_f=content-tree . You may also override these properties in the shell. MZ_HOME Directory Structure MZ_HOME refers to the installation path of the Platform Container, Execution Container. You must set MZ_HOME as an environment variable on your system. For further information about how to set this path, see the Installation Instructions . The directories that are created in MZ_HOME after a default installation of a Platform Container are described below. When you install an Execution Container, a subset of these directories are created. The owner of the files and directories in MZ_HOME is referred to as mzadmin throughout this document. Directory Description MZ_HOME/3pp This directory is used for storing files required by third-party software, e g database drivers. MZ_HOME/backup This directory contains the backup files produced when performing a System Backup task or a System Import , see the Desktop User's Guide for further information about these operations. The directory will be created when the first backup is made. MZ_HOME/bin This directory contains the commandline tool, mzsh. You can use the the command line tool to interact with MediationZone and perform system related tasks such as shutdown, startup, imports and exports of configurations, etc. Some Desktop related tasks, such as starting and stopping workflows, are also possible to perform with the commandline tool. Use the command line tool to start different parts of the system, such as the Platform or an Execution Context. These entities are running in their own Java Virtual Machines and are referred to as Pico processes. Every pico process has its own definition in STR. For further information about STR, see System Topology Registry For further information about the command line tool, see Command Line Tool User's Guide . MZ_HOME/codeserver This directory contains all the mzp packages in your installation, as well as any Jar files generated from your APL and Ultra configurations. Note! The contents of this directory should not be modified. MZ_HOME/common The lib subdirectory contains common libraries that are used by the system. This directory should not be modified. The services subdirectory contains service definitions. This directory should not be modified. The config subdirectory contains the STR data. Note! In an Execution Container, any local changes to the files in this directory are overwritten when the Platform is restarted. MZ_HOME/data This directory contains: Configuration data, e g agents, profiles and workflows, associated with each deployment User and access group data MZ_HOME/desktop This directory contains binaries for the Legacy Desktop and the Desktop Launcher. MZ_HOME/documentation This directory contains the documentation in PDF format. MZ_HOME/etc This directory contains the following files: ESAPI.properties - This file is used by the esapi security 3pp. This file should not be modified. mz.license - This file is the MediationZone installation license file. mz_trap_mib.txt - This file is the MIB definition file that is used by the SNMP trap utility. validation.properties - This file is used by the ESAPI Security 3pp. This file should not be modified. MZ_HOME/ha This directory contains a Jar file, which in turn contains scripts used for high availability installations. For further information, see chapter High Availability Setup . MZ_HOME/lib This directory contains the code that is necessary for the non-pico started servers and that is not loaded from the code server, as well as third party code. The pico-started servers, e g the Desktop and the ECs, executable code will never be fetched from this directory during runtime. The code is instead fetched from the pico cache. The exceptions are the Code Server and pico-start utility, picostart.jar , which will obtain their code from this directory. MZ_HOME/log This directory contains various logs. If the operating system on the machine where the installation is made provides so-called job control, this directory will contain process identification files (with extension * .pid ). With mzsh , these may be used in order to identify all processes related to the system execution. File Description <pico name>.log This file contains logs from the various pico processes. <pico name>.pid Process identification number setup-<version>.log This file contains logs from the installation script setup.sh . MZ_HOME/mzdb If Derby is used, this directory is the default location of the the database instance(s). MZ_HOME/pico-cache This directory is used by pico processes for caching. MZ_HOME/scripts This directory contains user-called scripts and script templates. MZ_HOME/storage This directory is the root directory for storage used by the Platform and services. Under the storage directory, the system creates sub-directories as required, which correspond to the services configured in the system. MZ_HOME/tmp This is a directory that is used for temporary storage by various subsystems. MZ_HOME/upgrade_history When upgrading or downgrading using setup.sh script, the resulting mzp packages of the plist that is made during upgrade/downgrade will be stored in subdirectories to this directory where each version will have its own subdirectory. Packages for old version when running an upgrade will be stored in: $MZ_HOME/upgrade_history/<old version>/plist Packages for new version when running a downgrade will be stored in: $MZ_HOME/upgrade_history/<new version>/plist MZ_HOME/web This directory contains resources for the user documentation. MZ_HOME/webapps This directory contains third-party software that is required to navigate the user documentation. MZ_HOME/webroot This directory contains resources for web applications. MZ_HOME/wi This directory contains resources for the Web Interface.",
    "title": "Software Environment - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352119465/Software+Environment",
    "word_count": 1062,
    "char_count": 7307
  }
]