[
  {
    "chunk_id": 1,
    "text": "This command is used to: list, add, or delete EC groups view pico instances usage: pico <command> [<args>] Add a Group Usage: -add GroupName Delete a Group Usage: -delete GroupName List Groups Usage: -list Regexp View Running Groups & Processes Usage: -view Pico Name Mark ec for shutdown Usage: -mark_for_shutdown <Pico Name> <IP/Host> <true/false> -list usage: pico -list Use pico -list to list available EC groups. Example - pico -list The following commands list all EC groups. mzsh <username>/<password> pico -list Output: ecgroup2 ec ecgroup1 ec -view usage: pico -view <pico name> Use pico -view to view the status of pico instances in the system. Example - pico -view The following displays the status for all pico instances in the system. mzsh <username>/<password> pico -view Output: Pico Start Memory Response Error Marked For Name Time (Used, Commited, Max) Time (ms) Status Shutdown ec1 (ip:port) <time> 1.1, 24.2, 27.6 1 OK ec2 (ip:port) <time> 1.2, 23.3, 28.7 1 OK MZSH:45881 (ip:port) <time> 5.9, 15.5, 47.5 2 OK Platform (ip:port) <time> 8.2, 20.0, 27.6 2 OK The Memory column is a comma-separated list of Used, Committed, and Maximum memory, and Response Time is measured in milliseconds. If Error Status indicates \"Error\", an OutOfMemoryError has occurred and additional information will be included in the output. For example, in case of an OutOfMemoryError on the Platform, the following could be shown: Platform: Mon Jan 23 09:59:47 CET 2012 OutOfMemoryError on platform at platform-e6410. See log/platform.log for more information OutOfMemoryError is further described in Out of Memory Info in System Log If Error Status indicates \"Connection failure\", an RCP error has occurred. The following command displays the status of the pico instance named ec1. mzsh <username>/<password> pico -view ec1 Output: Pico Name: ec1 (10.0.0.8:37197) OS: LINUX OS Version: 2.6.38-11-generic-pae Architecture: I386 Processors: 8 Java Version: 1.8.0_121 Loaded Classes: 2854 -add usage: pico -add <ec group name> Use pico -add to add an EC group to the system. Example - pico -add The following command adds an EC group named ecgroup1. mzsh <username>/<password> pico -add ecgroup1 Output: Group ecgroup1 added -delete usage: pico -delete <ec group name> Use pico -delete to delete an EC group from the system. Example - pico -delete The following command deletes an EC group named ecgroup1. mzsh <username>/<password> pico -delete ecgroup1 Output: Group ecgroup1 deleted -mark_for_shutdown usage: pico -mark_for_shutdown <ec1 localhost true> Use pico -mark_for_shutdown to signal to the Platform that an EC is scheduled to be shut down. As a result, the Platform will not assign workflows to the EC/ECSA. Example - pico -mark_for_shutdown The following command signals that the EC named EC1 should not be assigned workflows mzsh <username>/<password> pico -mark_for_shutdown ec1 localhost true Output: OK Return Codes Listed below are the different return codes for the pico command: Code Description Code Description 0 Will be returned if the command was successful, or if arguments are missing. 1 Will be returned if arguments can not be parsed 2 Will be returned if the communication with the Platform fails. 3 Will be returned if checking of user privileges failed, or if pico already exists when trying to add a new pico. 4 Will be returned if the user does not have permission to add or delete picos. 5 Will be returned if an unexpected error occurs.",
    "title": "pico - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352184939/pico",
    "word_count": 546,
    "char_count": 3463
  }
]