[
  {
    "chunk_id": 1,
    "text": "The Agent Selection dialog contains all the available agents, represented as icons. Different icons are available, depending on which kind of workflow type that you have selected. There are different agents for Batch, Realtime, or Task workflow types. You open the Agent Selection dialog from a workflow configuration. To open the Agent Selection dialog, click Configuration  New Configuration . Select Workflow from the Configurations dialog. When prompted to select workflow type, select either Batch, Realtime Or Task . Click Add Agent to open the Agent Selection dialog. Open Agent Selection dialog - Processing tab Real-time and batch workflow configurations contain three types of agents, collection, processing, and forwarding. These are sorted into different tabs, depending on the type of data an agent expects and delivers. The tabs are labelled Collection , Processing, and Forwarding . Task Workflow configurations have only one agent type and always contain a single agent. Open The different agent types Batch and Real-Time Workflow Agents Collection Agents A collection agent is responsible for the gathering of data from external systems or devices, such as opening a file and reading it byte-by-byte and then passing it into the workflow. A collection agent must produce one or several data types. The workflow configuration validates that the data types between the collection agent and the connected agents are compatible. Note! Real-time collection agents may also receive data from the workflow in order to send responses to the external system or device. Processing Agents A processing agent expects to be fed with data and to deliver data on one or several outgoing routes. Inside a workflow, data propagates between agents as streams, that is, as a flow of bytes or UDRs. A simple processing agent can, for example, be a counter counting the throughput. There are also more complex types, for instance, agents that, depending on the processed result, deliver data on different routes. The processing agent decodes (translates) an incoming byte stream into a UDR object and the encoding agent does the opposite. Forwarding Agents A forwarding agent is responsible for distributing data from the workflow to other systems or devices. An example would be to create a file from a data stream and transfer it to another system using FTP. Different agents act differently on the Begin Batch and End Batch messages. The forwarding agents, for instance, need a set of boundaries in order to close a file or commit a database transaction. A forwarding agent must receive one or several data types. The workflow configuration validates that the data types between the forwarding agent and the connected agents are compatible. For detailed information about specific collection-, processing-, and forwarding agents, see Appendix 2 - Batch and Real-Time Workflow Agents . Task Workflow Agents Task workflow agents are used to execute system housekeeping tasks such as removing files or cleaning up database tables. These agents do not receive any data from other agents nor do they publish data to other agents. For detailed information about specific task agents, see Appendix 3 - Task Workflow Agents .",
    "title": "Agent Selection Dialog - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352105984",
    "word_count": 508,
    "char_count": 3216
  }
]