[
  {
    "chunk_id": 1,
    "text": "Concept A Workflow Package is a configuration of workflows containing a set of configurations that can be bundled together and imported to different staging or integration environments. Once a certain configuration is exported from a current set, it can be assigned a version number thereby creating a version control system. Workflow Packages ar e used to facilitate the transportation of data between different environments, such as development, test, and production environments. The key features of Workflow Packages are the following: Version control : Development, test, and production environments are integrated into the same artifact repository, where they are version-controlled. Rollback : Changes are easy to roll back. Predictable : The same content is guaranteed in all environments. Dependent : Simple dependency handling. Workflow Packages are accessed and managed from the System Exporter ( Manage  System Exporter ). Workflow Packages Management In the System Exporter , set the Export type to Workflow Package . There are two main sections  the Available entries list on the left and the Logs screen on the right. Open Workflow Packages selection dialog At the top to the right, there are buttons used to manage Workflow Packages. Open Workflow Package management buttons Button Description Button Description Export Opens the Workflow Package export pop-up dialog. Refresh Refreshes the Available entries list. Option Not available when the Workflow package is selected. Expand all Expands all available workflows in the entries list. Collapse all Collapses all available workflows in the entries list. To create a Workflow Package select the list of workflows to include and click the Export button. This opens a pop-dialog. Open Workflow package export dialog Setting Description Setting Description Package name Specify the name of the Workflow Package. Package version Designate the Workflow Package version. Only numbers can be entered. Output option You can specify either a Download or a Commit Workflow Package export format. You can cancel the Workflow Package creation by clicking Close at any time or create the Workflow Package by filling in all the necessary information and clicking the Export button. When a successful export has been created a pop-up dialog is shown with the title and download link of the Workflow Package. Follow the download link to retrieve a copy of the exported workflow, and Close it by clicking the button.",
    "title": "Workflow Packages - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352137874",
    "word_count": 380,
    "char_count": 2467
  }
]