[
  {
    "chunk_id": 1,
    "text": "A Couchbase profile is used to read and write bucket data in a Couchbase database and can be accessed by workflows using Aggregation, Distributed Storage, or PCC. The profile should not be used to operate on data that has been inserted or updated by external third-party software. As a client of Couchbase, the profile operates in synchronous mode. When sending a request to Couchbase, the profile expects a server response, indicating success or failure, before proceeding to send the next one in queue. The Couchbase profile is loaded when you start a workflow that depends on it. Changes to the profile become effective when you restart the workflow. Note! Created or updated Couchbase profiles that are used for PCC do not become effective until you restart the ECs. Configuration To create a new Couchbase profile, click the New Configuration button from the Configuration dialog available from Build View , and then select Couchbase Profile from the menu. The contents of the menus in the menu bar may change depending on which configuration type has been opened in the currently displayed tab. The Couchbase profile uses the standard menu items and buttons that are visible for all configurations, and these are described in Common Configuration Buttons . The Edit menu is specific for Couchbase profile configurations. Setting Desciption Setting Desciption External References Select this menu item to Enable External References in an agent profile field. This can be used to configure the use of the following fields, and the respective external reference keys available: Bucket Name Bucket Password Bucket User Bucket User Password Operation Timeout Max Retries Retry Interval Host For further information, see Using External Reference in Agent Profile Fields and External Reference Profile . In a Couchbase profile, there are three tabs: Connectivity , Management , and Advanced . Connectivity Tab The Connectivity tab is displayed by default. Couchbase profile - Connectivity tab The following settings are available in the Connectivity tab: Setting Description Setting Description Bucket Configuration Bucket Name Enter the bucket that you want to access in Couchbase in this field. Bucket User Enter the user who has access rights to the bucket. User Password Enter the password for the user who has access to the bucket. Parameterized When enabled, here you may enter parameterized bucket configuration. Cluster Connectivity Operation Timeout (ms) Enter the number of milliseconds after which you want Couchbase \"CRUD\" operations, that is, create, read, update, and delete, to timeout. Setting a lower value than the default 1000 ms may have a positive impact on throughput performance. However, if the value is set too low, indicated by a large number of operation timeouts errors in the EC logs, a lower throughput can be expected. As mentioned, this value is used for timing out CRUD operations in Couchbase. This means that the system sends a request towards Couchbase and if an answer is not returned in time, the operation fails, and the system is no longer waiting for an answer. Retry Interval Time (ms) Enter the time interval, in milliseconds, that you want to wait before trying to read the cluster configuration again after a failed attempt. In other words, in case a request sent to Couchbase returns an unsuccessful answer, the number specified here is the time that the system waits before retrying the same request. Max Number Of Retries Enter the maximum number of retries. This is the number of retries the system does before treating the Couchbase operation as failed Enable Security Select this checkbox to connect to Couchbase cluster with SSL. If you want to set a parameter, select the Parameterized checkbox and enter the parameter name using ${} syntax, see Profiles for more information on how parameterization works (in this mode the regular Enable Security checkbox is disabled). The parameter needs to be set as true or false . Parameterized When enabled, you may enter a parameterized cluster configuration. Security Profile Cluster Nodes Cluster Nodes In this section, add IP addresses/hostnames of at least one of the nodes in the cluster. This address information is used by the Couchbase profile to connect to the cluster at workflow start, and to retrieve the IP addresses of the other nodes in the cluster. If the first node in the list cannot be accessed, the Couchbase profile will attempt to connect to the next one in order. This is repeated until a successful connection can be established. Hence it is not necessary to add all the nodes, but it is good practice to do so for a small cluster. For example, if there are just three nodes, you should add all of them. Hint! The Operation Timeout , Retry Interval Time , and Max Number Of Retries settings together with the Advanced tab setting mz.cb.lock.timeout.in .secs , work jointly. To understand how, see the following explanation. If you for example use the lookup function with transaction, a LOCK ERROR means that the lookup failed because there was already a transaction lock held on the object that the lookup was trying to get from Couchbase. That is, the lookup was not able to get a lock on the object. What is most important here is how the communication between MediationZone and Couchbase works. In case you use the lookup function it works like this: The lookup function with transaction ID tries to get an object from Couchbase with a lock. MediationZone sends a request to Couchbase to get an object and lock it. If the object exists and is not locked, Couchbase creates a lock and sends the answer back with a successful result code and the data. Alternatively, if the object is locked, Couchbase immediately sends an answer with the result LOCK_ERROR. Couchbase does not wait to answer until the lock is released. This is why the Operation Timeout parameter does not play a crucial role here. The Operation Timeout parameter is only used when Couchbase is stalling and does not send an answer for a long time. Assuming that the object is locked and the system received answer with LOCK_ERROR, it will wait for the amont of time specified in Retry Interval Time and then retry the request towards Couchbase. This process is repeated until Max Number Of Retries is exhausted or the answer contains a successful result code and the object is retrieved from Couchbase. So, if you for example set Retry Interval Time to 100 ms and Max Number of Retries to 10, you get 100 ms * 10 retries = 1000 ms. However, from a MZ perspective, the timeout of 1000 ms is just for a single lookup attempt and not for the whole lookup operation. To clarify, if you get a failed lookupMany with LOCK_ERROR in the system log, it means that the lookup failed because it tried to get an object with a lock but failed after Max Number Of Retries. That is, some other process (or thread) was holding a lock on that particular object for longer than 1000 ms. This is possible if the Advanced tab setting mz.cb.lock.timeout.in .secs is larger than 1000 ms. In other words, you need to decide what is more important - that the operation succeeds or that the operation is fast. Management Tab The Management tab contains Cluster Management and Monitoring settings. Open Couchbase profile - Management tab The following settings are available in the Management tab: Setting Description Setting Description Admin User Name If you want to create a new bucket that does not exist in your Couchbase cluster, enter the user name that you stated when installing Couchbase in this field. Admin Password If you want to create a new bucket that does not exist in your Couchbase cluster, enter the password that you stated when installing Couchbase in this field. Parameterized When enabled, here you may enter parameterized cluster management settings. Bucket Size (MB) Enter the size of the bucket you want to create, in MB. Number of Replicas Enter the number of replicas you want to have. If the bucket you want to access in Couchbase does not exist, the Couchbase profile can be used for creating the bucket in runtime for you, provided that the Admin User Name and Admin Password for your Couchbase cluster have been entered in the Management tab. If the bucket you want to access already exists in your cluster, these two fields do not have to be filled in. Advanced Tab In the Advanced tab, you can configure additional properties. These can typically be left unchanged in the standard Couchbase configuration. It is recommended that you change these properties when using the Couchbase profile in Aggregation. For more information about using the Couchbase profile in Aggregation, see Performance Tuning with Couchbase Storage in Aggregation Agent Configuration - Real-Time . Open Couchbase profile - Advanced tab Important! Client Management Timeout If there is a need to control a timeout of any synchronous operation, a system property mz.cb.management.timeout can be used. It should be set for every execution context used to execute a workflow that may require longer timeout. See the text in the Properties field for further information about the properties that you can set. Logging Couchbase Statistics You can use the property mz.cb.statistics.class if you want to log Couchbase statistics to file. The default value is com.digitalroute.mimexposer.statistics.NoDbStatistics . To enable this property, set the value to com.digitalroute.mimexposer.statistics.MemDbStatistics or com.digitalroute.mimexposer.statistics.FileDbStatistics . If you set the property value to com.digitalroute.mimexposer.statistics.MemDbStatistics , you can use the MIM agent to send statistics to System Insight. To do this, you must configure a workflow with a MIM agent. For further information, see 9.78.6 MIM Agent . If you set the property value to com.digitalroute.mimexposer.statistics.FileDbStatistics , you can use the MIM agent to send statistics to System Insight or you can log to file. If you want to log to file only, you do not require the MIM agent. The log file is stored in $MZ_HOME/log per bucket, for example <bucket name>_couchbase_stats.log, and the file is flushed every 60 seconds by default. If you want to modify how often the file is flushed, set the property mz.cb.statistics.flush.period.in .seconds with the required value in the EC. The Couchbase statistics that you can log include the following: Maximum answer time Average answer time Number of failed CRUDS Maximum lock time Average lock time Number of failed locks Number of timed out locks Support for Scope and Collection Refer to the following properties in the Advanced tab to configure Scope and Collection. Couchbase scope name: The default value is \"_default\". mz.cb.bucket.scopeName _default Couchbase collection name: The default value is \"_default\". mz.cb.bucket.collectionName _default Note! When naming scopes and collections, ensure to follow the standards mentioned in Naming for Scopes and Collections . When using scopes and collections, ensure that proper resources are assigned to the scope/collection within the Couchbase bucket. For example, if there are 5 buckets each with its own resource, and if it is decided to use only 1 bucket using scope and collection and removing the other 4. In this case, resources should be appropriately assigned to scopes/collections based on the previous usage of individual buckets.",
    "title": "Couchbase Profile - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352172795/Couchbase+Profile",
    "word_count": 1849,
    "char_count": 11399
  }
]