[
  {
    "chunk_id": 1,
    "text": "This section describes the Standard Upgrade Procedure from Mediationzone Version 8.3 to 9.4. Ensure to read through all the documentation for the Standard Upgrade Procedure and read through the MediationZone 9.4 Release for Important Information and Known Issues before proceeding with the Upgrade. Ensure that you follow the instructions in the order outlined in this section. The first step  Pre-Upgrade: Preparation for Upgrading from 8.3 to 9.4  can be done at any time. The active upgrade phase starts in the next step ( Disconnecting ECSAs from the Platform when Upgrading from 8.3 to 9.4 ). Note! Before starting the upgrade, please make sure you check your 8-release configuration and CI/CD scripts to make sure they are compatible with the 9-release. Follow instructions in section Preparations for Upgrading from 8.3 to 9.x . There are some issues currently regarding previous configuration versions for upgrades Known Issues | Configuration History Loss After Upgrade from MediationZone 8 Known Issues | Deleted Configuration History Unavailable After Upgrade from MediationZone 8 If you need previous configuration versions in the upgraded instance, please wait for a future fix version for these issues. This section has the following subsections: Pre-Upgrade: Preparation for Upgrading from 8.3 to 9.4 Disconnecting ECSAs from the Platform when Upgrading from 8.3 to 9.4 Shutting Down Workflows and Desktops when Upgrading from 8.3 to 9.4 Backup and Upgrade Preparations Steps for Platform when Upgrading from 8.3 Increasing Memory And Timeout Settings when Upgrading from 8.3 Upgrade Platform Container from 8.3 to 9.4 Backup and Upgrade Preparations Steps for EC Containers when Upgrading from 8.3 Upgrade Execution Container from 8.3 Post-Upgrade Steps when Upgrading from 8.3",
    "title": "Standard Upgrade Procedure for Upgrading from 8.3 - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/472121420",
    "word_count": 272,
    "char_count": 1793
  }
]