[
  {
    "chunk_id": 1,
    "text": "This section contains information that is specific to the database type SAP HANA. Note! The default MediationZone installation with configured clean up tasks in SystemTasks shall work fine with an SAP HANA DB instance of 64GB. If additional MediationZone processing services are configured to use the same SAP HANA DB instance, it is likely that additional resources will be needed to accommodate to the increased load. The services mentioned are Aggregation, Inter-workflow, Duplicate UDR checking and Data Veracity that use the SAP HANA DB storage. Warning ! It is possible that errors and misconfigurations in workflow can occur during the design and implementation. This can lead to inefficient use of resources such as a spike in memory consumption. Addressing these errors before deployment to production is crucial to ensure optimal usage of SAP HANA DB resources. Supported Functions The SAP HANA database can be used with the following functionality: Callable Statements (APL) Database Bulk Lookup Functions (APL) Database Table Related Functions (APL) Database Agents Data Masking Profile Event Notifications Prepared Statements (APL) Shared Table Profile SQL Collection/Forwarding Agents SQL Loader Agent Task Workflows Agents (SQL) Note! When using SAP HANA the property max.cached.prepared.statements has to be set to 0 in the Execution Context in order to be able to use PreparedStatements . In addition to the functions listed above, the SAP HANA database can be used with the following functionality: Audit Profile Note! The SAP HANA database availability is dependent on the scenario and customer landscape. Therefore, any solution designed using the jdbc connection to SAP HANA for real-time applications must be made to handle the same availability as achieved by the implementation of the underlying SAP HANA instance. Properties When selecting the SAP HANA database type, you can configure the following property using the Properties tab in the Database profile: sapdb.connectionpool.maxlimit Preparations A driver, provided by your SAP contact, is required to connect an SAP HANA database. This driver must be stored on the Platform Container host and each Execution Container host that will connect to a SAP HANA database. To access the SAP HANA database, follow the steps below: Copy the driver to the directory MZ_HOME/3pp in the Platform or EC Container. Restart the Platform and ECs for the change to take effect. Advanced Connection Configuration for SAP HANA with TLS/SSL When connecting to an SAP HANA database with TLS/SSL enabled, the connection string will require additional properties for the connection. Open SAP HANA Advanced Connection Setup with a JDBC connection string to a SAP HANA database with TLS/SSL enabled. For list of JDBC connection string properties required to connect your TLS/SSL enabled SAP HANA hosting server, you can refer to the SAP HANA documentation at the SAP Help Portal.",
    "title": "SAP HANA DB - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352172934",
    "word_count": 452,
    "char_count": 2934
  }
]