[
  {
    "chunk_id": 1,
    "text": "The Pico Management interface provides a comprehensive view of the various pico instances currently deployed and allows you to create and manage the pico instances. Open Pico Management The dashboard displays a list of all pico instances in the system. You can search and filter them for easy viewing. Columns and Buttons Description Columns and Buttons Description Name Name of the pico instances. Type The pico instance type of the JVM will be displayed here. These types will be labeled as platform , ec , sc , and ui Status The status of the JVM will be shown here. If the pico instance is up and can be pinged, it will be shown as running . If it cannot be pinged, it will be shown as unreachable . If the pico instance is shut down it will show as not-started . Memory Use The amount of memory being used by the pico instance will be shown here. Response Time The response time of the pico instance will be shown here. Up Time The amount of time that the pico instance has been running will be shown here. EC Groups If the pico instance belongs to any EC Groups, these will be shown here. Actions These are buttons that allow you to make changes to the selected pico. Edit - Allows you to make changes to the properties related to that particular pico instance. See Pico Management | Editing a Pico Instance or more details. Details - Allows to check more details about the pico instance from the Pico Management dashboard. Restart - Restarts the pico instance from the Pico Management dashboard. Stop - Stops the pico instance from the Pico Management dashboard. Start - Starts the pico instance from the Pico Management dashboard. Delete - Removes the pico instance from the Pico Management dashboard. Managing the Pico Instances You can start, stop or restart pico instances in the Pico Management dashboard. Selecting one or more of the pico instances will allow you to perform any of the highlighted actions shown at the top of the pico list. The available actions depend on the type of pico instance. Open Selecting multiple pico instances to start Adding a Pico Instance You can add an EC or SC pico instance using the New Pico button on the Pico Management dashboard. The following are properties found in the Create New Pico dialog: Property Description Property Description Pico Container Choose between all available containers in your installation to list the pico instance under. This is a mandatory field. Name Provide a unique identifier for your pico instance. The name cannot be shared across other pico instances and has to be unique. This is a mandatory field. Template Choose between the standard-ec template or the standard-sc template for your pico instance. You can then make changes to the JSON template in the text field below, such as add on properties in Execution Context Properties for EC's. Open Create New Pico dialog window with the standard-ec option selected. Editing a Pico Instance You can add or modify properties pertaining to the particular pico instance as well as their values. The Edit Pico dialog consists of a JSON template text field where you can add new properties, edit the values and View Resolved Config . The View Resolved Config lets you view the current valid configuration for that particular pico instance. You cannot make changes to the text field while viewing the resolved config. For more details to the properties you can add, refer to: Platform Properties for the Platform pico. Execution Context Properties for Execution Context pico. Open Edit Pico dialog window for an ec container. Details of a Pico Instance The user can learn more about each pico instance by clicking Details in the Actions buttons, where its possible to see information separated by the following tabs: Details - Overview Tab Details - Application Tab Details - Virtual Machine Tab Details - Operating System The information presented in the tabs comes directly from JMX MBeans and is primarily intended for troubleshooting activities.",
    "title": "Pico Management - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352138577/Pico+Management",
    "word_count": 676,
    "char_count": 3976
  }
]