[
  {
    "chunk_id": 1,
    "text": "The Ultra Format configuration introduces format definitions in the system to be used by agents in workflows. Use the Ultra Format Definition Language (UFDL) to describe format definitions. Apart from selecting Decoder, Encoder, and UDR Type definitions, formats can be imported from APL code, as well as directly from other Ultra definitions: import ultra.folder_name.module_name; // From APL code import folder_name.module_name; // From UFDL code To open an Ultra Format configuration, click Build  New Configuration . Select Ultra Format in the Configurations dialog. Open The configuration contains the standard configuration buttons as described in Common Configuration Buttons . Syntax Highlighting In the code area, the different parts of the code are color-coded according to type, for easier identification, and when right-clicking in the code area, a context-sensitive popup menu appears, enabling easy access to the most common actions you may want to perform. The text is color-coded according to the following definitions: Blue - Functions Green - Types Orange - Comments Purple - Keywords Yellow/Green - Values Ultra Format Buttons The buttons available in the Ultra Format configuration are the general ones as described in Common Configuration Buttons . Configuration Diff If you want to compare the current version of an Ultra format configuration that you are displaying with a previous version of the same configuration, you can use Configuration Diff to compare the two versions side by side. To view the Configuration Diff pop-up, click the Configuration Diff menu button of the Ultra Format editor. You can navigate through the differences by scrolling both panes in parallel using the scroll bar to the right of either pane. If you want to scroll through each pane separately, hover over the pane that you want to scroll through, and use the scroll wheel on your mouse. If you want to skip through each difference in the panes, you can use the navigation buttons: Previous , Next , and Refresh , which are described below. Item Description Item Description History To select a different version of the same configuration, use the drop-down box to select the version you want to display. Open You can also display and view encrypted configurations. If you select an encrypted configuration, you are prompted to enter the relevant password to decrypt the configuration. Previous Click this button to skip to the previous difference in the configurations. The previous difference is highlighted in green. Next Click this button to skip to the next difference in the configurations. The next difference is highlighted in green. Refresh Click this button to display the updated version of the configuration. Configurations are not locked when you display them in Configuration Diff. If another user has modified and saved a configuration that you are viewing in this tool, you can click this button to view the latest updated version.",
    "title": "Ultra Format Configuration - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352150600/Ultra+Format+Configuration",
    "word_count": 465,
    "char_count": 2952
  }
]