[
  {
    "chunk_id": 1,
    "text": "The Configuration Tracer tool allows you to restore any deleted configurations, and perform troubleshooting activities efficiently. To access, go to Manage  Tools & Monitoring and click Configuration Tracer . To get started, you will begin at the Configuration Tracer page. Open The Configuration Tracer page The Configuration Tracer page The Configuration Tracer page has two tabs; Active and Historic . The Active tab shows all the current active configurations. The Historic tab shows all the deleted configurations. You can search the page with the search bar at the top. Or refresh the table with the Refresh button. Column Description Column Description Type The configuration type of the configuration. Configurations The name of the configuration. Folder The folder where the configuration is saved in. Encrypted If the configuration is encrypted during creation, it will indicate as true, or false if it is not. Version The number of versions this configuration has. Key The configuration key. Modified Date The date the configuration was last modified. Modified by The last user who modified the configuration. Actions View To view the configuration. This action only appears in the Active tab. Restore To restore the configuration. This action only appears in the Historic tab. Restore a deleted configuration To restore a deleted configuration, click on the Historic tab to see the listed deleted configurations. Open The Historic tab You can restore a single configuration by clicking on the Restore action button at the Actions column of the configuration. Alternatively, if you want to restore multiple configurations, you can check the check box of each configuration, and click the Restore button at the top of the table. Open When clicking the Restore button, the Restore Configuration prompt appears. Open The Restore Configuration prompt Click Restore . If the name of the configuration to be restored is a duplicate an existing active configuration in the same destination folder, the Duplicated Configuration Name prompt will appear. Open The Duplicated Configuration Name prompt If you wish to continue restoring the configuration and keep both configurations, you will need to rename the restoring configuration. Click Keep Both Files . Otherwise, to cancel the restoring operation, click Cancel . After clicking Keep Both Files, the Rename Duplicated Configuration prompt will appear, indicating the duplicated name, and letting you rename the restoring configuration. Open Click Apply once renamed. A message will indicate when the configuration is successfully restored. Open The successful message when the configuration is restored You can view the restored configuration in the Active tab after refreshing the table.",
    "title": "Configuration Tracer - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/562003970/Configuration+Tracer",
    "word_count": 419,
    "char_count": 2746
  }
]