[
  {
    "chunk_id": 1,
    "text": "The Duplicate Batch profile is loaded when you start a workflow that depends on it. Changes to the profile become effective when you restart the workflow. Configuration To create a new Duplicate Batch profile configuration, go to Configuration  New Configuration . Select Duplicate Batch Profile from the Configurations dialog. Duplicate Batch profile configuration Note! If the Detection Method is modified after a Duplicate Batch Detection agent has been executed, the already stored information will not match any records processed with the new profile version. The items in the menu bar may change depending on the configuration type. The Duplicate Batch profile uses the standard menu items, as described in Build View . The Duplicate Batch profile configuration contains the following settings: Setting Description Setting Description Max Cache Age (Days) Enter the number of days you want to keep the batch information in the database. Use CRC Select this checkbox to create a checksum from the batch file data. You can use this checksum when searching for duplicate batch files by comparing the files' checksums. Use Byte Count Select this checkbox to use the number of bytes in the batch files for duplicate detection. Use MIM Value Select this checkbox to use a MIM value for duplicate detection. A MIM name defined in the Named MIMs table is compared with a MIM Resource that can be connected both with batches and workflows. Note! When you use MIM values as a detection method, both empty and non-empty batches will be evaluated. The duplicate batch detection will also be performed regardless of the data on the incoming routes, as well as if there is no data on the incoming routes. This is not the case for the other detection methods. Named MIMs Click the Add button to create a list of user-defined MIM names. When the Duplicate Batch Detection agent is configured, each MIM name is assigned to one MIM Resource for which detection will be applied. Within the same workflow configuration, the profiles configured to Use MIM Value must map to the same MIM names.",
    "title": "Duplicate Batch Profile - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352109830",
    "word_count": 343,
    "char_count": 2078
  }
]