[
  {
    "chunk_id": 1,
    "text": "The ConsumeCycleUDR is the UDR that the Workflow Bridge forwarding agent populates with data and routes to the Workflow Bridge real-time collection agent. The ConsumeCycleUDR must always be acknowledged and sent back from an Analysis agent to the Workflow Bridge real-time collection agent if the ConsumeCycleUDR was initially sent by a Workflow Bridge batch forwarding agent. See the section, Analysis, for the real-time collection Workflow in Workflow Bridge Example Batch to Real-Time Scenario with Action UDR for an example. If the Send reply over bridge option has been configured in the profile, the ConsumeCycleUDR is sent the whole way back to the Workflow Bridge batch forwarding agent. Refer to Workflow Bridge Profile for more information. The ConsumeCycleUDR s can be sent in a bulk from the Workflow Bridge forwarding agent, for a more efficient transfer of the data. This is further described in the section, Bulk Forwarding of Dat a, in Workflow Bridge Agents . The following fields are included in the ConsumeCycleUDR : Setting Description Setting Description Action (wfbActionUDR) This field is used by the user to communicate actions back to the forwarding workflow. It should be populated with a user-defined action UDR, see User Defined Action UDRs . AgentId (string) This field includes the agent id that is created for the Workflow Bridge forwarding agent each time a workflow is started. The id is unique per Workflow Bridge forwarding agent and workflow execution. Broadcast (boolean) This field indicates whether broadcast should be enabled (true) or not (false). If broadcast is enabled, the forwarded UDRs will be sent to all the configured workflow instances in the collecting workflow. Data (any) This field can be populated with anything and contains the UDRs or bytearrays that are sent from the forwarding workflow. LoadId (int) If you have configured the number of collectors to be more than 1 in the Workflow Bridge profile, LoadIds can be used for determining how data should be distributed. Each workflow instance is assigned a specific LoadId, and then you can use this field in the ConsumeCycle UDR to indicate which LoadId, i e which workflow instance, the UDR should be routed to. SessionContext (any) This field might contain data that has been populated in the InitializeCycleUDR or BeginBatchCycleUDR by the Workflow Bridge real-time collection agent. For more information about session context, refer to the section, Session Context , in Workflow Bridge Agents . This field is only readable in this UDR.",
    "title": "ConsumeCycleUDR - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352181562/ConsumeCycleUDR",
    "word_count": 405,
    "char_count": 2547
  }
]