[
  {
    "chunk_id": 1,
    "text": "The UDR File Editor allows you to view and edit the content of UDR files. The UDR file may be of any format as long as it has an associated decoder. Since UDRs often contain a large number of fields, it is possible to create a UDR View to select specific fields to be displayed as columns in the UDR File Editor. See UDR Views for more information. Each UDR can also be opened in a separate dialog where all fields are available. Note! By default the UDR File Editor only supports input files up to size 3MB. If the file size exceeds this limit, the UDR File Editor only reads up to 3MB of the file and then stop, displaying only the read records. If you want to support decoding of files larger than 3 MB, you need to set the Desktop property mz.gui.udreditor.limit for the corresponding Desktop. See Desktop Properties . Setting the property to yes means the 3 MB limit applies. Setting the property to no bypasses the limitation mechanism, which may potentially cause out-of-memory errors in the Desktop. Several UDR File Editors can be used simultaneously, however, avoid editing the same UDR from several different editors, since there is no functionality to handle real-time co-authoring. To open the UDR File Editor , open the Manage screen and click the UDR File Editor button. Open Setting Description Setting Description UDR View If you want to apply a configured UDR view, you can click the Browse... button to select and apply a defined UDR view. See UDR Views for more information. Orig Pos Shows the original position of the UDR. New indicates that the UDR did not exist prior to the last Save. Pos The current position of the UDR. The order applies upon saving. Type The UDR types Field Name All columns following the Type column list the field names of the UDR type according to the UDR view selection. If there is no field with the defined name, No such field is stated. UDR File Editor Buttons The Ultra File Editor contains the following buttons: Item Description Item Description Open Click this button to clear the UDR File Editor . Open Opens the Open UDR File dialog. Click Browse... to select the decoder you want to use for the data file, and then click Upload File... to browse the file system and select the file you want to view. Click OK to close the dialog and display the file in the UDR File Editor . Open Open Click to save your modified UDR file. Open Select the encoder you want to use by clicking the Browse button to the right of the Encoder field and selecting the decoder in the Select encoder dialog. Select the GZIP Compressed checkbox if you want to compress the file. Enter the name of the file in the File Name field and click Download to download your file. Open Click this button to open the Table Export dialog where you can export the data to be able to open it in any text editor. Open All UDRs are displayed as rows, where the fields are separated by any of the following: Comma Semicolon Tab Non-existing fields are marked [null] . The first line always holds the field names. Open Click this button to print either a selection of UDRs or all UDRs. Open Click to open a new dialog in which the selected UDRs can be edited simultaneously. For further information, see Editing a Bulk of UDRs . Open Click to open the UDR Views . Open Click this button to open the user documentation This section has the following subsections: Editing a UDR Editing a Bulk of UDRs",
    "title": "UDR File Editor - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352085864/UDR+File+Editor",
    "word_count": 618,
    "char_count": 3412
  }
]