[
  {
    "chunk_id": 1,
    "text": "The MediationZone system is divided into three different zones: The Control Zone, which includes the Platform and the database, the Execution Zone, which contains the host(s) responsible for executing and supervising workflows, and the Access Zone, which contains the MediationZone Desktop user interface, the Web Interfaces, and the Command Line Tool interface. The minimum MediationZone system installation comprises a single Platform container. The Platform and any other available pico processes such as Execution Contexts, Service Contexts, and Desktops may run in the Platform container. To scale out the system, you may install additional Execution Containers for your ECs, and SCs. Other Platform Containers may exist in a system, for high availability, but only one can be active at a time. Many operations in MediationZone can be performed via the Command Line Tool or the Web Interface. However, some operations can only be performed from the Desktop user interface installed as a local Windows. The Web Interface and Command Line Tool are automatically installed with the Platform Containers and Executions Containers. The MediationZone Platform container host needs to have the Java Development Kit installed before the installation. The Java Runtime Environment is sufficient for Desktops and Execution Containers. Network It is common that the MediationZone hosts are protected by one or more firewalls. For the communication between the various components of the system to work, you may need to update your firewall settings. For further information, about firewall settings, see https://infozone.atlassian.net/wiki/x/HGr8F in the https://infozone.atlassian.net/wiki/x/A2b9F . Deployment on Hyperscalers MediationZone supports being deployed on hyper scalers considered that the supported system requirements are met. Operating System Java For OpenJDK binaries, ensure that it is Java Technology Compatibility Kit (TCK) certified to comply with Java SE standards. Please refer to the link below for details. https://openjdk.org/groups/conformance/JckAccess/jck-access.html Platform Databases Other Third Party Software Web Browsers for Desktop Legacy Desktop and Desktop Launcher",
    "title": "System Requirements - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352071859",
    "word_count": 308,
    "char_count": 2195
  }
]