[
  {
    "chunk_id": 1,
    "text": "This feature is currently available only in Legacy Desktop. The Desktop version of this feature is coming soon. The purpose of the restricted fields configuration is to make it possible to mark certain fields as read-only in the ECS Inspector. For instance, you might want to guard some UDR fields from being edited to avoid losing traceability. The ECS Restricted Fields configuration is viewable (read-only) for all users with access to the ECS Inspector. Only users belonging to the administrator group are allowed to edit the configuration. Restrictions can be set on any UDR type, also within sub-UDRs. The restrictions are applied recursively, so if there are restrictions on a UDR field of a certain type, all sub-fields are blocked from editing as well. The restrictions defined in the ECS Restricted Fields configuration are valid only in the ECS. For example, the UDRs are still possible to modify outside the ECS (unless they have been explicitly defined as read-only in the UDR definition). It is possible to import and export the ECS Restricted Fields configuration if needed. The configuration is located in the System Exporter file tree viewer under System  ECS  Restricted Fields . Note! The access rights described above also apply to importing and exporting. This means that any user can export the ECS Restricted Fields configuration (as long as they have ECS Inspector access), but only members of the administrator group can import the ECS Restricted Fields configuration. To restrict certain UDR type fields from being edited in the ECS Inspector, specify those fields in the ECS Restricted Fields dialog (opened from the ECS Inspector  Restricted Fields button). Note! Only users belonging to the administrator group are allowed to configure restricted fields. However, all users can view the configured restrictions. Open To configure restricted fields: Click the Add button beneath the Restricted UDR Types section. The UDR Internal Format Browser dialog opens. Open Select the UDR Type for which you want to restrict fields from being edited and click Apply . The UDR type is added to the Restricted UDR Types list. Repeat the previous step for all the UDR Types you want to add, and then click OK to close the dialog. Select one of the UDR Types that you have added and click the Add button beneath the Restricted Fields section. The UDR Internal Format Browser dialog opens. Open Select a field you want to restrict from being edited and click Apply . The UDR type is added to the Restricted Fields list. Repeat the previous step for all the fields you want to restrict from being edited, and then click OK to close the dialog. When finished, click Save in the ECS Restricted Fields dialog. The configured fields are now blocked from editing in the ECS Inspector.",
    "title": "Configuring ECS Restricted Fields - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352175641/Configuring+ECS+Restricted+Fields",
    "word_count": 462,
    "char_count": 2791
  }
]