[
  {
    "chunk_id": 1,
    "text": "For information about the MIM and a list of the general MIM parameters, see Administration and Management in Legacy Desktop . Meta Information Model Publishes MIM Parameters Description Source File Count This MIM parameter contains the number of files, available to this instance for collection at startup. The value is constant throughout the execution of the workflow, even if more files arrive during the execution. The new files will not be collected until the next execution. Source File Count is of the long type and is defined as a global MIM context type. Batch Retrieval Timestamp This MIM parameter contains a timestamp, indicating when the batch was read in the beginBatch block. Batch Retrieval Timestamp is of the date type and is defined as a header MIM context type. Base Directory This MIM parameter contains the name of the Base directory from which the agent locates files. This is defined in the agent configuration. Base Directory is of the string type and is defined as a global MIM context type. Source Files This MIM parameter contains a list of all source files that will be included and processed in the upcoming batch, that is the file content will be set to null. Source Files is of the list<CollectedFileUDR> type and is defined as a header MIM context type. Source Files Left This MIM parameter contains the number of source files that are yet to be collected. This is the number that appears in the Execution Manager backlog. Source Files Left is of the long type and is defined as a header MIM context type. Accesses The agent does not access any MIM parameters. Note! For a list of the general MIM parameters, see Administration and Management in Legacy Desktop . Agent Message Events There are no agent message events for this agent. Debug Events There are no debug events for this agent.",
    "title": "Merge Files Collection Meta Information Model and Events - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352143865/Merge+Files+Collection+Meta+Information+Model+and+Events",
    "word_count": 312,
    "char_count": 1821
  }
]