[
  {
    "chunk_id": 1,
    "text": "The creation of the database must be made by the postgres UNIX user, or another UNIX user with the same privileges, on the machine where PostgreSQL is installed. The postgres UNIX user is assumed in this installation. Configure the PostgreSQL database to allow a remote client connection to the database. The working directory is $PGDATA . Edit the pg_hba.conf file to match the settings in install.xml . See Appendix C - PostgreSQL HBA Settings for an example. When the files have been configured, the PostgreSQL database needs to be restarted. Create the PostgreSQL database instance. The working directory is postgres . source ./postgre_create_instance.sh If no error occurs, the database creation is complete and the rest of this section can be ignored. Note! postgre_create_instance.sh is a shell script designed to execute a series of SQL scripts to create the necessary database objects required for MediationZone. The SQL scripts executed by this script include: postgre_user.sql - Contains the SQL statements to create users and role assignment. postgre_create_tb_tab.sql - Contains the SQL statement to create a custom tablespace for tables. postgre_create_tb_idx.sql - Contains the SQL statement to create a custom tablespace for indexes. postgre_create_db.sql - Contains the SQL statements to create database, assign ownership, configure tablespace settings, and manage connection privileges. postgre_schema.sql - Contains the SQL statements to create schema and grants the required privileges to the database owner. postgre_schema_mzuser.sql - Contains the SQL statements to create schema and grants the required privileges to the JDBC user. Hint! When the instance creation script is executed, a log file in the /tmp directory is created that can be used for troubleshooting. The mz.log file contains PostgreSQL responses from the database creation. If the script fails, cleanup the system before the next try: Start PSQL: psql Remove the Database and Users: postgres=# DROP DATABASE mz; postgres=# DROP USER mzowner; postgres=# DROP USER mzadmin; postgres=# q If there is a need to change any installation parameter defined in the file install.xml , the installation must be restarted from the generation step. See Extract Database Definition Files for PostgreSQL for more information.",
    "title": "PostgreSQL Database Creation - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352170697/PostgreSQL+Database+Creation",
    "word_count": 345,
    "char_count": 2300
  }
]