[
  {
    "chunk_id": 1,
    "text": "The SAP CTS+ (Change and Transport System Plus) integration in MediationZone enables streamlined management of MediationZone configurations across different environments. SAP CTS+ uses SAP TMS (Transport Management System) as the engine to move changes. This integration allows for greater control, flexibility, and efficiency when moving changes between development, test, and production systems. You can find more information on SAP CTS+ in the https://help.sap.com/docs/SAP_NETWEAVER_740/4a368c163b08418890a406d413933ba7/48c4300fca5d581ce10000000a42189c.html?version=7.4.18 . Note! Configuration exports in MediationZone are referred to as Changes in the SAP CTS+ Integration Users Guide. Key Features of the SAP CTS+ Integration in MediationZone Simplified Configuration Management : Manage regular system exports and workflow packages seamlessly through the SAP CTS+ interface. Please note that Development Toolkit bundles are excluded from this integration. Flexible Import Options : You can easily import configurations to any system in your landscape using CTS+. The source systems for imports can be customizedeither allowing all systems or limited to specific ones, as defined by the cts.source.systems property. For more information, see https://infozone.atlassian.net/wiki/x/cGn8F . Decoupled Export Process : With loose coupling between export and transport, exports are triggered separately from the CTS+ transport process. Use the System Export tool in Desktop, or the mzsh command line tool, to create export files, which you then upload to CTS+ for transport and deployment. Open The SAP CTS+ integration in MediationZone Subsections This section contains the following subsections: SAP CTS+ Export SAP CTS+ Import",
    "title": "SAP CTS+ Integration User's Guide - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352085168/SAP+CTS+Integration+User+s+Guide",
    "word_count": 230,
    "char_count": 1731
  }
]