[
  {
    "chunk_id": 1,
    "text": "There are four types of workflow configurations: Batch Real-Time Task System Task Batch Workflow A batch workflow processes input from a specific source, usually a file. The workflow creates batches from the data and processes them one by one. In a batch workflow data is collected by a single collecting agent in a transaction-safe manner. A single batch is collected (only once) and is fully processed by the workflow before the next batch is collected. A batch workflow: Processes batches, one at a time. Is started either manually or by a scheduled trigger. Stops either when it finishes processing the input, or when aborted. Note! If the workflow aborts, the current batch can be reprocessed. Real-Time Workflow Real-time workflows are used in systems where instant processing requests need to be addressed as they occur. In real-time workflows most of the collecting agents communicate in a two-way manner; they receive requests and provide replies. A real-time workflow: Can have more than one collecting agent Note! Multithreading operations differ from batch workflows in the following ways: The order of UDR processing cannot be guaranteed. Only global MIMs are used. They can process several UDRs simultaneously. See Multithreading . Once started, the real-time workflows remain active. A real-time workflow is started either manually or by a scheduled trigger and stops either manually or due to an error. Processes reside in memory. Transaction safety must be handled prior to collection and after distribution. Errors are registered in the System Log and the workflow continues to run. Real-time workflow error handling rarely leads to workflow aborts. Note! Real-time workflows may use the Inter Workflow or Kafka agents to forward data to a batch workflow. Task Workflows Task workflows are single-agent workflows that execute user-defined SQL, shell scripts, or unit tests. System Task Workflows MediationZone comes with built-in System Task workflows. System Task workflows and groups let you perform activities such as log and run-time data cleanup. System Task workflows include the following types: Archive Cleaner Configuration Cleaner Data Veracity Maintenance ECS Maintenance Statistics Cleaner System Backup System Log Cleaner User Cleanup This section includes information about: Opening a System Task Workflow Modifying a System Task Workflow Configuration Opening a System Task Workflow You open a System Task workflow or workflow group from the Configuration Browser which you open by clicking the Configuration button. Open Modifying a System Task Workflow Configuration You modify all the System Task workflow configurations at the template level. The workflow properties are all set to Final and cannot be modified. You can modify a System Task configuration, including its scheduling criteria, but you cannot create or remove a System Task configuration. The Archive Cleaner Workflow lets you modify only its scheduling criteria. For further information see Managing a Workflow Group | Scheduling . To Modify a System Task Workflow: Open the System Task Workflow that you want to modify by double-clicking on it or right-clicking and selecting View Configuration . Double-click the agent icon. The agent's configuration dialog opens. Perform the changes and click OK . Save the workflow. Archive Cleaner The Archive Cleaner System Task lets you remove old archived files from the file system. Archive Cleaner operates according to data that it receives from the Archive profiles. Note! You can only modify the scheduling criteria of the Archive Cleaner. See Archive Profile . Since schedules can only be applied to workflow groups, you modify the Archive Cleaner scheduling from the workflow group configuration. Configuration Cleaner With the Configuration Cleaner you can specify the maximum age of an old configuration before it is removed. Note! You cannot remove the most recent configuration with the Configuration Cleaner, only the previous ones. To configure the Configuration Cleaner: Open the Configuration_Cleaner workflow and double-click on the Configuration_Cleaner agent. The Agent Configuration dialog opens. Open The Configuration Cleaner System Task In the Keep column, select one of the following options: Always , Days , or Versions . Column Description Column Description Type The icon represents the configuration type. Name The name of the configuration type. Keep Specify how long to keep old configurations in the system. Always : Always keep configurations. Days : Keep configurations for a specified number of days. Versions : Keep only a certain amount of versions of the configurations. Value Specify the number of days or versions that represent the period during which configurations are kept. Data Veracity Maintenance The Data Veracity Maintenance system task removes outdated Data Veracity data, provided that the state is REPROCESSED or DELETE_APPROVED. For more information see Data Veracity Maintenance System Task . Open The Data Veracity Maintenance Task ECS Maintenance ECS Maintenance lets you remove old ECS data from the file system, provided that the state is REPROCESSED . For more information see ECS Maintenance System Task . Open The ECS Maintenance Task Statistics Cleaner The Statistics Cleaner lets you remove old statistics data that has been collected by the Statistics server and stored in the database. Open The Statistics Cleaner Task Setting Description Setting Description Minute Level Records Specifies the number of days during which a minute-level record should be kept in the database. Hour Level Records Specifies the number of days during which an hour-level record should be kept in the database. Day Level Records Specifies the number of days during which a day-level record should be kept in the database. System Backup System Backup enables you to create a backup of all the configurations in the system. A backup file is saved on the host machine where the Platform application is installed. The System Backup files are stored in $MZ_HOME/backup/yyyy_MM , where yyyy_MM is translated to the current year and month, and $MZ_HOME/backup is the default path . The system saves a backup file and names it according to the following format: backup_<date>.zip . In addition, System Backup lets you specify the maximum age of backup files before they are removed. You can change this location using the following command: <property name=\"mz.backup.path\" value=\"${mz.home}/backup\"/> The System Backup configuration dialog contains two tabs: System Backup : To enable the option. Cleanup : To configure the option. Open The System Backup System Task - the System Backup tab Setting Description Setting Description Enable System Backup Select this checkbox to enable the system backup. This setting is selected by default. Use Encryption Select this checkbox to enable encryption of the backup. Password Enter a password. Open The System Backup System Task - the Cleanup tab Setting Description Setting Description Imported Files Every time the System Importer imports a configuration, the system saves it as a backup on the Platform. Enter the period, in days, during which the imported files should remain on disk. System Backup Files Defines the maximum age of system backup files before they are removed from the host disk. System Log Cleaner The System Log Cleaner deletes the System Log periodically. You specify how long to keep different message types in the System Log Cleaner configuration. Open The System Log Cleaner Task Setting Description Setting Description Error/Disaster Enter the number of days to keep Error and Disaster messages before they are removed from the database. Max value: 999 days Default value: 30 days Warning Enter the number of days to keep Warning messages in the database. Max value: 999 days Default value: 20 days Information Enter the number of days to keep Information messages in the database. Max value: 999 days Default value: 10 days User Cleanup Task The User Cleanup Task automatically deletes inactive users. When either a SSO or LDAP user is logged in, the user is added into the system. However, the user is not removed when it is deleted from the external server. The User Cleanup Task is used to delete users that have not logged in for a configurable number of days. Open User Cleanup Task Setting Description Setting Description Apply to the following user types Checkbox options to determine which User Type to apply the cleanup task on. Multiple options may be selected. Local users - apply the clean up on local system users SSO users - apply the clean up on SSO users LDAP users - apply the clean up on LDAP users Retention Period The default value is 0 (zero). This setting specifies the number of days to wait before a user is deleted after their last login session. A value of 0 (zero) disables the cleanup function. Default Successor If a certain user is deleted from the platform, a successor needs to be designated. This user will take ownership of all previously owned configurations.",
    "title": "Workflow Types - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352072816",
    "word_count": 1421,
    "char_count": 9043
  }
]