[
  {
    "chunk_id": 1,
    "text": "You open the FTP collection agent configuration dialog from a workflow configuration. To open the FTP collection agent configuration, click Configuration  New Configuration . Select Workflow from the Configurations dialog. When prompted to Select workflow type , select Batch . Click Add agent and select FTP from the Collection tab of the Agent Selection dialog. The Filename Sequence and Sort Order tabs are described in Workflow Template . Connection Tab The Connection tab is used to configure the remote server connection. Open The FTP Collection Agent Configuration - Connection tab Setting Description Setting Description Connection Information Host Enter the hostname or IP address of the remote host. If a connection cannot be established to this host, the Additional Hosts specified in the Advanced tab, are tried. Username Enter the username for the remote host account. Password Enter the associated password. Transfer Type Select the data transfer type to be used during file retrieval. Binary - agent uses binary transfer type. Default setting. ASCII - agent uses ASCII transfer type. Collection Retries Enable Select this check box to enable repetitive connection attempts. When this option is selected, the agent will attempt to connect to the host as many times as is stated in the Max Retries field. If the connection fails, a new attempt will be made after the number of seconds entered in the Retry Interval (s) field. Retry Interval(s) Enter the time interval in seconds, between retries. If a connection problem occurs, the actual time interval before the first attempt to reconnect will be the time set in the Timeout field in the Advanced tab plus the time set in the Retry Interval(s) field. For the remaining attempts, the actual time interval will be the number of seconds entered. Max Intervals Enter the maximum number of trial intervals. Restart Retries Settings En able Select this check box to enable the agent to send a RESTART command if the connection is lost during a file transfer. The RESTART command contains the necessary interrupt information and will continue from that spot. Before selecting this option, ensure that the target FTP server supports the RESTART command. When this option is selected, the agent will attempt to re-establish the connection, and resume the file transfer from the point in the file stated in the RESTART command, as many times as is entered in the Max Restarts field. When a connection has been re-established, a RESTART command will be sent after the number of seconds entered in the Retry Restarts Interval(s) field. Note! The RESTART Retries settings will not work if you have selected to decompress the files in the Source tab! Note! RESTART is not always supported for transfer type ASCII. For further information about the RESTART command, see http://www.w3.org/Protocols/rfc959/ . Retry Restarts Interval(s) Enter the time interval, in seconds, you want to wait before initiating a restart. This time interval will be applied for all restart retries. If a connection issue occurs, the actual time interval before the first attempt to send a RESTART command will be the time set in the Timeout field in the Advanced tab plus the time set in the Retry Interval(s) field. For the remaining attempts, the actual time interval will be the specified number of seconds. Max Restarts Enter the maximum number of restarts per file you want to allow. If more than one attempt to send the RESTART command has been made, the number of used retries will be reset as soon as a file transfer is completed successfully. Source Tab The Source tab contains configuration options related to the remote host, source directories, and source files. The following text describes the configuration options available when no custom strategy has been chosen. Open The FTP collection agent configuration - Source tab Setting Description Setting Description Collection Strategy If there is more than one collection strategy available, a Collection Strategy drop-down menu list will be made visible. For further information about collection strategies, see Appendix 4 - Collection Strategies . File Information Directory Enter the absolute path to the source directory where the source files reside. If the FTP server is of UNIX type, the path name must be specified as relative to the home directory of the account. Include Subfolders Select this check box if you have subfolders in the collection source directory. Note! Subfolders that are in the form of a link are not supported. If you select Enable Sort Order in the Sort Order tab, the sort order selected will also apply to subfolders. Filename Enter the name of the source files on the remote host. Regular expressions according to Java syntax apply. For further information, see http://docs.oracle.com/javase/8/docs/api/java/util/regex/Pattern.html . Example To match all file names beginning with TTFILE , type: TTFILE.* Note! When collecting files from VAX file systems, the names of the source files must include both the path and filename when entering the regular expression. Compression Select the compression type. This option determines if the agent will decompress the files before passing them to the workflow. No Compression - the agent will not decompress the files. Gzip - the agent will decompress the files using Gzip. Before Collection Move to Temporary Directory If this option is enabled, the source files will be moved to a subdirectory called DR_TMP_DIR in the source directory, before collection. This option supports safe collection when source files repeatedly use the same name. Append Suffix to Filename Enter the suffix that you want to be added to the file name prior to collection. Important! Before you execute your workflow, make sure that none of the file names in the collection directory include this suffix. Inactive Source Warning (h) If enabled, when the configured number of hours have passed without any file being available for collection, a warning message (event) will appear in the System Log and Event Area: The source has been idle for more than <n> hours, the last inserted file is <file>. After Collection Move to If enabled, the source files will be moved from the source directory (or from the directory DR_TMP_DIR if using Move to Temporary Directory ) to the directory specified in the Destination field, after collection. Note! The Directory has to be located in the same file system as the collected files. The absolute path names must be defined. If a file with the same filename, but with different content, already exists in the target directory, the workflow will abort. If a file with the same file name, and the same content, already exists in the target directory, this file will be overwritten and the workflow continue running. Rename Options Rename If this option is enabled, the source files will be renamed after the collection, and remain (or moved back from the directory DR_TMP_DIR if using Move to Temporary Directory ) in the source directory. Note! When the File System Type for VAX/VMS is selected, there are special considerations. If a file is renamed after collection on a VAX/VMS system, the filename might become too long. In that case, the following rules apply: A VAX/VMS filename consists of <file name>.<extension>;<version>, where the maximum number of characters for each part is: <file name>: 39 characters <extension>: 39 characters <version>: 5 characters If the new filename turns out to be longer than 39 characters, the agent will move part of the filename to the extension part. If the total sum of the filename and extension part exceeds 78 characters, the last characters are truncated from the extension. An example: A_VERY_LONG_FILENAME_WITH_MORE_THAN_39_ CHARACTERS.DAT;5 will be converted to: A_VERY_LONG_FILENAME_WITH_MORE_THAN_39_. CHARACTERSDAT;5 Note! Creating a new file on the FTP server with the same file name as the original file, but with other content, will cause the workflow to abort. Creating a new file with the same file name AND the same content as the original file will overwrite the file. Remove If enabled, the source files will be removed from the directory (or from the directory DR_TMP_DIR , if using the Move to Temporary Directory option, after collection. Ignore If enabled, the source files will remain in the source directory after the collection. This field is not available if the Move to Temporary Directory option is enabled. Destination Enter the full pathname to the directory on the remote host into which the source files will be moved after the collection. This field is only available if Move to is enabled. Prefix and Suffix Prefix and/or suffix that will be appended to the beginning and the end of the name of the source files, respectively, after the collection. These fields are only available if Move to or Rename is enabled. Warning! If Rename is enabled, the source files will be renamed in the current (source or DR_TMP_DIR ) directory. Be sure not to assign a Prefix or Suffix , giving files new names still matching the Filename regular expression. That will cause the files to be collected over and over again. Search and Replace Select either the Move or Rename option. Search : Enter the part of the filename that you want to replace. Replace: Enter the replacement text. Search and Replace operate on your entries in a way that is similar to the Unix sed utility. The identified filenames are modified and forwarded to the target agent in the workflow. This functionality enables you to perform advanced filename modifications, as well: Use regular expression in the Search entry to specify the part of the filename that you want to extract. Note! A regular expression that fails to match the original file name will abort the workflow. Enter Replace with characters and meta characters that define the pattern and content of the replacement text Search and Replace Examples To rename the file file1.new to file1.old , use: Search: .new Replace: .old To rename the file JAN2011_file to file_DONE , use: Search: ([A-Z]*[0-9]*)_([a-z]*) Replace: $2_DONE Note that the search value divides the file name into two parts by using parentheses. The replace value applies to the second part by using the place holder $2 . Keep (days) Enter the number of days to keep moved or renamed source files on the remote host after collection. In order to delete the source files, the workflow has to be executed (scheduled or manually) again, after the configured number of days. Note! A date tag is added to the filename, determining when the file may be removed. This field is only available if the Move to or Rename option is enabled. UDR Type Section Route FileReferenceUDR Select this check box if you want to forward the data to an SQL Loader agent. For more information, see SQL Loader Agent . Advanced Tab The Advanced tab contains advanced FTP service configuration options. For example, if the FTP server does not return the file listed in a well-defined format, you can use Disable File Detail Parsing . For further information, see the available options. Open The FTP collection agent configuration - Advanced tab Setting Description Setting Description Command Port Enter the port number of the remote FTP server. Timeout (s) Enter The maximum time, in seconds, to wait for a server response. A value of 0 will result in an indefinite wait. Passive Mode (PASV) This option must be enabled if FTP passive mode is used for the data connection. In passive mode, the channel for data transfer between the client and server is initiated by the client instead of the server. This is used when firewalls block standard FTP connections. Disable File Detail Parsing Disables parsing of file detail information received from the FTP server. This enhances the compatibility with unusual FTP servers but disables some functionality. If file detail parsing is disabled, file modification timestamps will not be available to the collector. The collector does not have the ability to distinguish between directories and simple files, sub directories in the input directory must for that reason not match the filename's regular expression. The agent assumes that a file named DR_TMP_DIR is a directory because a directory named DR_TMP_DIR is used when Move to Temporary Directory under the Source tab is activated. Therefore, it is not allowed to name a regular file in the collection directory DR_TMP_DIR. Note! When collecting files from a VAX file system, this option has to be enabled. Additional Hosts Here you can enter additional host names or IP addresses that can access the source directory for file collection. These hosts are tried, in sequence from top to bottom. Use the Add , Edit , Remove , Up , and Down buttons to configure the order of the hosts in the list.",
    "title": "FTP Collection Agent Configuration - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352110651",
    "word_count": 2093,
    "char_count": 12815
  }
]