[
  {
    "chunk_id": 1,
    "text": "The Desktop provides a convenient user interface, displaying configurations, tools, and inspectors, with different options available for the different views. Open Desktop window The Desktop window is organized into two main sections: To the left you have the Standard Desktop Buttons , which allows you to expand lists of configurations, tools, and other options, see Standard Desktop Buttons and Options below for more information. The main view displays the selected tools and opened configurations in a tabbed arrangement. Page navigation: 1 Standard Desktop Buttons and Options 2 Tabs 3 Browser View 4 Subfolders 5 Right-Click Menu 6 Properties 7 Documentation 8 Search Standard Desktop Buttons and Options The Desktop user interface includes the following standard features: Feature Description Feature Description Desktop Buttons Open Browser - Click this button to open the Browser. Here you can see all available configurations and their properties. Open Configuration - Click this button to open a list of available configuration types to create a new configuration. Open Inspection - Click this button to open a list of available inspectors, see Inspection for more information. Open Tools - Click this button to open a list of available tools, see Tools & Monitoring for more information. Open Open Tabs - Click this button to open a list of all open tabs, which may be useful if you have many tabs open. Open Change Password - Click this button to open the Change Password dialog where you can change your user password. Open Documentation - Click this button to open the user documentation. Open Status - Click this button to open a list of status messages along with version information. Open Exit - Click this button to exit the Legacy Desktop. Tab Right-Click Menu There are different closing options available when right-clicking a tab. Open The tab right-click menu Close - Select this option to close the selected tab. Close Other - Select this option to close all other tabs in the Desktop window. Close All - Select this option to close all tabs in the Desktop window. Tab Button Panel The button panel is visible at the top of a tab. It is dynamic and changes according to the type of Configuration, Inspector, or Tool that is opened in the currently displayed tab. For a description of the specific buttons, see Configuration View , Inspection , and Tools & Monitoring . The following figure shows the button panel visible for a workflow configuration. Open The tab button panel for a workflow configuration Tabs Configurations and tools are opened in separate tabs, in the right part of the Desktop window. However, dialogs that are opened from right-click menu options, e.g. the MIM Browser or UDR Browser, are opened in a dialog box and not in another tab. Click the Open Tabs button to display a list with all the currently opened tabs. Open Open Tabs List dialog When exiting the Desktop, all tabs are closed, and they are not restored the next time you log in unless you have set the property mz.gui.restart.tabs to true . See Legacy Desktop Properties for more information. To reorder the tabs, click a tab and drag it to a different position along the top of the window. To move a tab to a separate Desktop window, click and drag it outside the current window. This can be useful when running and analyzing several workflows in the Workflow Monitor, to be able to view the monitors side by side. If there is only one tab open in the Desktop and the tab is moved to a separate window, the original Desktop window will be closed. A Tool, Inspector, or Configuration can only be open in one tab at a time. It is possible to move tabs between several Desktop windows. Browser View The Browser displays a list of all configurations and makes it possible to easily navigate between them. In the Browser you also filter what configurations are shown, by selecting entries of a specific type. You also have the option to display configurations with folders and subfolders. The Browser supports a set of operations that can be performed on the configurations by using the right-click menu. Each configuration has Properties where permissions are set and where you can view history, references, and other basic information. Button Description Button Description Open To open the Browser , click the Browser button in the upper left part of the interface. Open The Browser View In the Browser there are two pre-existing folders: Default - This folder is where all configurations are stored if no other folder is specified. SystemTask - This folder contains workflows for performing different background routines. For further information, refer to System Task Workflows in Workflow Types . Note! The Default and SystemTask folders cannot be renamed or deleted. Subfolders It is possible to arrange your configurations in a structure with subfolders. Open Subfolder structure To enable this functionality you need to set the property platform mz.subfolder.enabled to true , and restart the Platform and any Legacy Desktop clients. When enabled, you can create a subfolder by using an underscore in the folder name when creating a new folder. Open Creating a subfolder If you want to use another character to define subfolders than underscore, you can use the property mz.subfolder.separator to define another separator. See Platform Properties for more information. Note! Subfolders are only available in Legacy Desktop. Right-Click Menu In this section, the different options available in the right-click menu of the Browser View are described. Note that some of the options have keyboard shortcuts - these are listed in grey color according to the used operating system. Right-click a configuration and select one of the following options: Option Description Option Description Column View Enables you to switch between Compact or Details viewing modes. When the Details mode is selected, additional information is shown about each item: the granted permissions, Owner, Modified By, and the Modification Date. Refresh Select this option to refresh the selected folder, subfolder, or configuration. Expand Select this option to expand the selected folder or subfolder to display all the subfolders and configurations that it contains. Collapse Select this option to collapse the selected folder or subfolder to not display all the subfolders or configurations. New Configuration Select this option to create a new profile based on the menu list. New Folder... Select this option to create a new folder. Open Configuration(s)... Available when at least one configuration is selected. Select this option to open the selected configuration(s). Export Configuration(s) Available when at least one configuration is selected. Select this option to export the selected configurations. The System Exporter dialog opens with the configuration(s) pre-selected. Note! When exporting from the Configuration Navigator, configuration dependencies are not automatically selected. This can be achieved by selecting the Select Dependencies checkbox in the System Exporter dialog. For further information see System Exporter . Download... Downloads the selected configuration. Cut Select this option to put one or more configurations on the clipboard to move the configuration to another location. Select the menu option Paste in the folder where the configurations should be stored. This option is not applicable if the configuration is locked. For further information see Locks in Administration and Management in Legacy Desktop . Copy Select this option to put one or more configurations on the clipboard to copy the configurations to another location. Select the menu option Paste in the folder where the copied configurations should be stored. Paste Select this option to store configurations that have been cut or copied to the clipboard in the selected folder. Delete... Select this option to delete the selected configuration(s). If the configuration is referenced by another configuration, a warning message is displayed, informing you that you cannot remove the configuration. You can force the deletion of a folder and all the configurations that it contains. A message is displayed asking if you are sure that you want to continue, in order to avoid deletion by mistake. Note that there is no restore option for this function. All the configurations are permanently removed. Rename... Select this option to change the name of the selected configuration. Take particular care when renaming a configuration. If, for example, an APL script is renamed, workflows that are using this script will become invalid. This is important to know when you rename folders that contain many ultra format configurations or APL configurations. Renaming a folder with ultra formats or APL configurations will make all referring configurations invalid. Encrypt... Select this option to encrypt the selected configurations. Decrypt... Select this option to decrypt the selected configurations. Validate... Select this option to validate the configuration. A validation message is shown to the user. Show Properties Select this option to launch the Properties dialog for the selected configuration. For further information, see the Properties section below. Documentation Select this option to launch the Documentation dialog for the selected configuration. For further information, see the Documentation section below. Properties To open the Properties dialog, right-click a configuration and select Show Properties . Open The Properties dialog box This dialog contains four different tabs: Basic , which contains basic information about the configuration, Permission , where you set permissions for different users, References , where you can see which other configurations that are referenced by the selected configuration, or that refers to the selected configuration, and History which displays the revision history for the configuration. The Basic tab is displayed by default. The Basic Tab The Basic tab is the default tab in the Properties dialog and contains the following information: Configuration Information Description Configuration Information Description Name Displays the name of the configuration. Type Displays the configuration type. Key Displays the internal key used by MediationZone to identify the configuration. Folder Displays the name of the folder in which the configuration is located. Version Displays the version number of the configuration, see the History tab for further information about the different versions. Permissions Displays the permissions granted to the current user of the configuration. Permissions are shown as R (Read), W (Write), and X (eXecute). If the configuration is encrypted, an E is shown. Owner Displays the username of the user that created the configuration. The owner can: Read, modify (write), and execute the configuration. Modify the permissions of user groups to read, modify, and execute the configuration. Modified by Displays the username of the user that made the last modifications to the configuration. Modified Displays the date when the configuration was last modified. If you want to use the information somewhere else you can highlight the information and press CTRL-C to copy the information to the clipboard. The Permissions Tab The Permissions tab contains settings for what different user groups are allowed to do with the configuration: Open The Permissions tab As access permissions are assigned to user groups, and not individual users, it is important to make sure that the users are included in the correct user groups to allow access to different configurations. R W X E Permission Description R W X E Permission Description R - - - Allowed only to view the Configuration, given that the user is granted access to the application. - W - - Allowed to edit and delete the Configuration. - - X - Allowed only to execute the Configuration. R W - - Allowed to view, edit, and delete the Configuration, given that the user is granted access to the application. - W X - Allowed to edit, delete, and execute the Configuration. R - X - Allowed to view and execute the Configuration, given that the user is granted access to the application. R W X - Full access. - - - E Encrypted. The References Tab The References tab contains information about which other configurations the current configuration refers to, and which other configurations the current configuration is referenced by: Open The References tab The References tab contains two sub-tabs: Used By , which displays all the configurations that use the current configuration, and Uses , which displays all the configurations that the current configuration uses. To edit any of the configurations, double-click the configuration to open it for editing. The History Tab The History tab contains version information for the configuration: Open The History tab In the version table, the following columns are included: Column Description Column Description Version Displays the version number. Modified Date Displays the date and time when the version was saved. Modified By Displays the user name of the user that saved the version. Comment Displays any comments for the version. If you want to clear the Configuration history, click the Clear Configuration History button. The version number is not affected by this. Documentation To open the Documentation dialog, right-click a configuration and select Documentation . Open The Documentation dialog In this dialog, you can provide information on the selected configuration, for example, a description and the purpose of the configuration. You can use markdown syntax if preferred. The text entered is then included in the automated documentation that you can generate using the Documentation Generator tool. When you have completed the text, click OK to save. For further information, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/352182526 . Search Click the Search button to be able to make free text searches. Two options are shown at the top of the list. Setting Description Setting Description Filter Select to filter for entries that match the entered string. Search Select to find individual entries that match the entered string. Click Find Next to go to each individual entry in turn. Open Search option in the Browser",
    "title": "Legacy Desktop User Interface - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352116130/Legacy+Desktop+User+Interface",
    "word_count": 2257,
    "char_count": 14314
  }
]