[
  {
    "chunk_id": 1,
    "text": "Overview The Configurations Browser is used to access the different configurations available in MediationZone. Each individual configuration has its own set of properties and can differ visually from others. The standard menu buttons are shared between each of them, but depending on the complexity and available fields some configurations can be presented to the users in a different way. Common Configurations Common configurations refer to functions that are not dependent on specific profiles or agents. They usually serve to configure a specific process that modifies the way configurations are executed. For all configurations, except Workflow, a dialog will open up where you create your configuration. For Workflows, the Workflow Editor will open up. The following table shows a list of all common configurations: Configuration Description Configuration Description External References Profile The External Reference profile enables you to use configuration values that originate from property files or exported environment variables from the Platform's startup shell. KPI Profile The KPI profile contains a KPI Management service model and is used by the KPI Cluster, KPI Cluster Out, and KPI agents. Reference Data Profile In a Reference Data profile configuration, you can select the tables that should be available for query and editing via the Reference Data Management Web UI, or RESTful interface. Unit Test The Unit Test configuration enables the creation of tests used in continuous deployment scenarios. Workflow The Workflow configuration enables the creation and management of three different types of workflows: batch, real-time, and task. See the Working with Workflows section to learn more. W orkflow Bridge Profile The Workflow Bridge profile enables you to configure the bridge that the forwarding and collection agents use for communication. The profile ties the workflows together. Profile Configuration Types Profiles contain configuration options relevant to the associated agent. They usually require credentials configurations and are used to collect and enrich the data that is processed by the system. Configuration Description Configuration Description 5G Profile The 5G Profile enables 5G communication with HTTP/2 agents. Aggregation Profile Aggregation consolidates related UDRs that originate from either a single source or from several sources, into a single UDR. Related UDRs, are grouped into \"sessions\" according to the value of their respective fields, and a set of configurable conditions. Amazon Profile The Amazon Profile is a generic profile used for setting up Amazon S3 credentials and properties that can be used by various other profiles or agents. Analysis APL Code Editor The APL Code Editor is used to create generic APL code that can be imported and used by several agents and workflows. APL Collection Strategy The APL Collection Strategies are used to set up rules for handling the collection of files from the Disk, FTP, SFTP, and SCP collection agents. Archive Profile The Archive Profile contains storage, naming scheme, and lifetime for targeted files. Audit Profile The Audit Profile offers the possibility to output information to user-defined database tables. Azure Profile The Azure Profile is used for setting up the access credentials and properties to be used to connect to an Azure environment. Categorized Grouping Profile The Categorized Grouping Profile is loaded when you start a workflow that depends on it. Conditional Trace Templates Conditional Trace is a trouble-shooting function that allows you to set a trace filter on agents and/or UDRs in real-time workflows route(s) and/or Analysis agent(s) for either a specific field value or a range of field values. Couchbase Profile The Couchbase profile is used to read and write bucket data in a Couchbase database and can be accessed by workflows using Aggregation, Distributed Storage, or PCC. Data Masking Profile The Data Masking profile selects the masking method you want to use, which UDR types and fields you want to mask/unmask, and any masking method-specific settings. Data Veracity Profile The Data Veracity Profile is used to select the particular database to which Data Veracity will be connected. Diameter Application Profile The D iamete r Application Profile captures a set of AVP and command code definitions that are recognized by the Diameter Stack agent during runtime. Diameter Routing Profile The Diameter Routing Profile enables you to define the Peer Table and the Realm Routing Table properties for the Diameter Stack agent. Duplicate Batch Profile Duplicate Batch Detection agent provides duplication control on incoming batches. Duplicate UDR Profile Duplicate UDR Detection agent provides duplication control on incoming UDRs. Elasticsearch Profile The Elasticsearch profile is used to read and write data in an Elasticsearch Service in AWS and can be accessed by batch workflows using Aggregation agents. Encryption Profile TheEncryption Profile you make encryption configurations to be used by the Encryptor agent. Event Notifications The Event Notification configuration offers the possibility to route information from events generated in the system to various targets. External Reference Profile The External Reference profile enables you to use configuration values that originate from property files or exported environment variables from the Platform's startup shell, File System Profile The File System Profile is used for making file system-specific configurations, currently used by the Amazon S3 collection and forwarding agents. GCP Profile The GCP Profile is used for setting up the access credentials and properties to be used to connect to a Google Cloud Platform service. GCP PubSub Profile The GCP PubSub Profile is used for setting up the Google PubSub Subscription and Topic for a Google Cloud Project. Inter Workflow Profile The Inter Workflow profile enables you to configure the storage server that the Inter Workflow forwarding and collection agents use for communication. JMS Profile The JMS profile contains settings that you use to connect and acquire both a Connection Factory object and a Destination object from a JNDI service. Kafka Profile The Kafka profile enables you to configure which topic and which embedded service key to use. Open API Profile If you want to use Open API 3.0 with HTTP/2 agents, you require an Open API profile configuration. You select the profile that you configure in the HTTP/2 Server agent configuration. The Prometheus Filter Use this filter to configure the Prometheus metrics that are going to be exposed for scraping. The purpose of the Prometheus Filter is to prevent the flooding of metrics in the storage of the Prometheus host. Python Interpreter Profile With the Python Interpreter profiles, you can configure which executable to use, and also which working directory you want to have. Python Module With the Python Module configurations, you can write shared Python code that can be imported by multiple Python agents. Redis Profile A Redis profile is used to read and write data in a Redis database and can be accessed by real-time workflows using Aggregation agents. REST Server Profile The REST Server Profile is used to define the endpoint URI for any particular REST server agent. SAP RFC Profile The SAP RFC profile dynamically generates UDRs based on selected SAP RFC functions that are part of an SAP system. Security Profile The Security profile is a generic profile that you can use to make encryption configurations that can be used by several agents and profiles. Shared Table Profile This section describes the Shared Table profile. This profile enables workflow instances to share tables for lookups. SNMP Collection Profile The SNMP Collection profile allows you to import the MIB files you want to use to build your target UDRs. SNMP OID Profile With the SNMP OID profile, you can select to configure which OIDs, UDR types, and fields to poll, outside of the SNMP Request agent itself, which enables several agents to use the same configuration. Suspend Execution This section includes information about the configuration option Suspend Execution. System Insight Profile The System Insight Profile allows you to create, edit or remove profiles and filters that you want to use to display or store statistics using the system insight service. Workflow Bridge Profile The Workflow Bridge profile enables you to configure the bridge that the forwarding and collection agents use for communication. Workflow Group The workflow group configuration enables you to manage workflow groups.",
    "title": "Configuration Types - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352072656/Configuration+Types",
    "word_count": 1327,
    "char_count": 8623
  }
]