[
  {
    "chunk_id": 1,
    "text": "Error UDRs can be helpful in case of troubleshooting, testing, or monitoring. Each Error UDR contains information about the errors in a UDR, and in case you have configured Error UDR, you can see the following information regarding the error: reason source destination the raw request response There can be different reasons for an erroneous message, like: UDRs are too old (timed out) Unable to decode the UDR, or, The shared secret is not the same Field Description Field Description errorCode (int) The error code. The reason is specified in the errorCode and errorMessge . errorMessage (string) Detailed description of the error. remoteIP (ipaddress) Source or destination IP address of the NAS depending on type of the Radius agent and the message. remotePort (int) Source or destination port used for communication with the NAS depending on the type of Radius agent and the message. requestMessage (bytearray) Byteary with raw request or null. This field contains a request UDR. Depending on the settings on the NAS, it can be any of the following packet types: ACCESS_REQUEST ACCOUNTING_REQUEST DISCONNECT_REQUEST CHANGE_OF_AUTHORIZATION_REQUEST In terms of authentication, CHAP is supported. PAP, MSCHAP and EAP are not fully supported. To use these protocols, you must configure the APL code as required. See the example below, APL code to configure authentication using CHAP. For details on these standards, see RFC 2865 ( http://www.ietf.org/rfc/rfc2865.txt ), RFC 2866 ( http://www.ietf.org/rfc/rfc2866.txt ) and RFC 5176 ( http://www.ietf.org/rfc/rfc5176.txt ). An Ultra Format Definition must be designed to handle decoding of this field. responseMessage (bytearray) Byteary with raw response or null. The field containing a response UDR. Depending on the settings on the NAS, it can be any of the following packet types: ACCESS_ACCEPT ACCESS_REJECT ACCOUNTING_RESPONSE DISCONNECT_ACK DISCONNECT_NAK CHANGE_OF_AUTHORIZATION_ACK CHANGE_OF_AUTHORIZATION_NAK In terms of authentication, CHAP is supported. PAP, MSCHAP and EAP are not fully supported. To use these protocols, you must configure the APL code as required. See the example below, APL code to configure authentication using CHAP. For details on these standards, see RFC 2865 ( http://www.ietf.org/rfc/rfc2865.txt ), RFC 2866 ( http://www.ietf.org/rfc/rfc2866.txt ) and RFC 5176 ( http://www.ietf.org/rfc/rfc5176.txt ). An Ultra Format Definition must be designed to handle decoding of this field.",
    "title": "The Error Format - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352178909/The+Error+Format",
    "word_count": 361,
    "char_count": 2469
  }
]