[
  {
    "chunk_id": 1,
    "text": "The Desktop Interface enables interaction with MediationZone deployments. http://localhost:9001/desktop/ After a successful login, the Desktop start page is displayed . Open The Dashboard shows various graphs, charts and tables representing the live view of the system's health. Refer to the Dashboard View page for more information on what you can do with these graphs. From here you can also access the main sections: The top menu panel lists the main options available to the users, subdivided into the Configuration View and Manage View screens. Clicking on the MediationZone logotype takes you back to the dashboard. On the top right, there is the User Settings List . You can access the dropdown menu by clicking on the icon. Top Menu Bar The Desktop user interface has a top menu bar consisting of the following options: Menu Item Description Menu Item Description Screen Selection Open The Screen Selection is located at the top left in Desktop. You can select to open the Configuration screen or the Manage screen and MediationZone icon takes you back to the start screen. Each selection is displayed in a full-screen vi ew. Environment Indicator Open The environment indicator provides a way for users to distinguish between different environments. The environment indicator displays the value set to mz.name property that can be configured during installation or after installation using the topo command. See Configure Environment Name for more information. The environment indicator is hidden by default. It can be set to show or hide for the user using the User menu located on the top right on the Desktop. See Profile under User Settings for more information. The environment indicator will only display up to 13 characters of the value that is set in the mz.name property. The actual length of the value as well as the value itself will remain the same in the property and it will not be truncated. Search Open Allows you to search the Desktop for any configuration or content. For more information on using search terms to better aid your querying, refer to Search . Help A button that sends you to the main page for the User Documentation. User Open The User menu is located on the top right in Desktop and contains various options for your account or deployment. See User Settings for more information. Accessibility Support Across all views, there is screen reader support that enables Accessibility access. In addition, the overall display theme can be selected for easier viewing. For more information, see Desktop Accessibility Options . The Desktop interface is redesigned to be easily accessible using web browsers. This all-new experience has many advantages over the Legacy Desktop as it is more intuitive to use. However not all functionality from the Legacy Desktop is available yet, for some advanced features and functionality you still have to use the Legacy variant. F or more information, see the Legacy Desktop . This section has the following subsections: Dashboard View Configuration View Manage View",
    "title": "Desktop User Interface - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352072417/Desktop+User+Interface",
    "word_count": 494,
    "char_count": 3038
  }
]