[
  {
    "chunk_id": 1,
    "text": "Usage usage: restart [ -q ] [ -f ] <running server process> ... This command is used to stop and start pico instances. Note! This command is valid only for the MZ_HOME owner. If you have specified more than one pico instance, these will be shut down in the reverse order of the arguments. Once the pico instances have stopped, the pico instances will be started in the same order as the arguments. Example - Restarting Pico Instances The following command will close down the pico instance named ec1 and then the Platform. When both processes have stopped, the platform will start the Platform followed by ec1. mzsh <username>/<password> restart platform ec1 The command will fail if the processes are specified in the reverse order since it would attempt to start ec1 before the Platform. Note! The command will behave differently depending on if the user is logged in or not. If a user is not logged in when the shutdown command is executed, the immediate, forced shutdown will be used regardless of if the -f option is used or not. For further details, see the descriptions for the shutdown and startup commands in shutdown and startup . Options The command accepts the following options: Option Description Option Description [-q] Quiet, generates less or no information messages. [-f] Forced restart of the pico instance(s). If the pico instance is an EC, it will be shut down without waiting for workflows to stop first. This option has no impact on the Platform. Return Codes Listed below are the different return codes for the restart command: Code Description Code Description 0 Will be returned if no arguments are given to the command, or if there are no matching server processes to restart. 1-> The sum of the return codes from shutdown and startup.",
    "title": "restart - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352085554",
    "word_count": 301,
    "char_count": 1762
  }
]