[
  {
    "chunk_id": 1,
    "text": "To enable one-way SSL On HTTP, follow the steps in this page. You need to prepare a keystore with a certificate and private key before enabling one-way SSL on HTTP. Refer to Configuring a Keystore to create your own Keystore with a trusted certificate and private key. You can also use a keystore that containing a self-signed certificate. The mzsh keytool enable-tls command is no longer available in Mediationzone 9. Steps: Use mzsh topo set to set the value of the HTTP TLS Properties listed below in the Platform container. mz.httpd.security mz.httpd.security.keystore mz.httpd.security.keystore.password mz.httpd.security.key.password Change the URL schema in the Platform container. $ mzsh topo env --update-mz-platform https://<ip/hostname>:<port> Example command: mzsh topo env --update-mz-platform \"https://platform.mz:9000\" This command will update the URL to platform in $MZ_HOME/bin/mzsh # Http url to platform, e.g http://localhost:9000 if [ -z \"${MZ_PLATFORM+x}\" ]; then MZ_PLATFORM=\"https://platform.mz:9000\" export MZ_PLATFORM fi Change the URL schema in the EC container. $ mzsh topo env --update-mz-platform https://<ip/hostname>:<port> Example command: mzsh topo env --update-mz-platform \"https://platform.mz:9000\" This command will update the URL to platform in $MZ_HOME/bin/mzsh # Http url to platform, e.g http://localhost:9000 if [ -z \"${MZ_PLATFORM+x}\" ]; then MZ_PLATFORM=\"https://platform.mz:9000\" export MZ_PLATFORM fi Restart platform, desktop ui. $ restart platform ui Re-login legacy desktop and desktop ui with HTTPS. Access MediationZone Operations API with HTTPS. Make sure that the file $MZ_HOME/bin/mzsh in remote Execution Container and remote Desktop UI Container is updated to use HTTPS too. If desktop UI is located in another remote container, then do the HTTP TLS Properties configuration mentioned in Step 1 in desktop UI container.",
    "title": "Enable One-way SSL On HTTP - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352119832/Enable+One-way+SSL+On+HTTP",
    "word_count": 257,
    "char_count": 1874
  }
]