[
  {
    "chunk_id": 1,
    "text": "MediationZone constantly collects information from the different sub-systems and hosts within the system. Among other things, this information is used for load balancing. Using System Statistics, you can view, export, and import statistical information. Host Statistics The system collects statistics from the different machines hosting a Platform or Execution Context, such as the load of the CPU or the number of context switches. This is called host statistics. MediationZone uses the vmstat command to collect the information. This binary must be installed to have statistics collected and to perform load-balancing work for workflows. The following list holds all values collected from each host. On newer operating systems, some of these may not be available for collection due to changes in the kernel of the operation system. CPU User Time - This value shows how much time was spent in non-kernel specific code. This value is displayed in percentage. 100% means that all processing power is spent. See CPU System Time as well. CPU System Time - This value shows how much time was spent in kernel-specific code, such as scheduling of different processes or network transfer. This value is displayed in percentage. 100% means that all processing power is spent. Context Switches - The number of context switches per second. A context switch occurs when one process hands over information to another process. The more context switches, the less effective and scalable the system will be. Swapped To Disk - The amount of data that was swapped out. A large value indicates that the system does not have enough RAM to manage the memory requirements of the different processes. Swapped In From Disk - The amount of data that was read from swap. Processes Waiting For Run - Shows how many processes that are waiting to run. A high number indicates that the machine is not fast enough to manage the load. Processes Swapped Out - Processes that have persisted in swap due to insufficient available memory, or due to aggressive management of the memory layer. Processes In Sleep - The number of processes that are presently not doing anything. Pico Instance Every minute, the system collects memory information from the different Java processes defining the Platform and the Execution Context. This information shows how much memory is used and how much memory is available for the running process. Used Memory - Shows the amount of memory currently allocated by the running process. As Java is a language using garbage collection, this number may very well get close to the maximum memory limit without being a problem for the running process. However, if the amount of used memory is close to the maximum limit for a long time, the process needs more memory. This value is displayed in bytes. See the -Xmx and -Xms properties defined in the XML file defining the process. Maximum Memory - Shows the amount of memory that the process can use. This value is displayed in bytes. Process CPU Time - Shows the percentage of CPU time that has been used. Open File Descriptors - This is a Unix measurement that enables you to create a statistical diagram over the number of open files during the last minute, hour, or day. Garbage Collection Count - Shows the number of times the garbage collector has run since the last time statistics was collected. Garbage Collection Time - Shows the amount of time the garbage collector has run since the last time statistics was collected. This value is displayed in milliseconds. Thread Count - Shows the number of allocated threads. Workflow Statistics The system collects statistical data that is sampled every 5 seconds as long as a workflow is being executed. This information includes: Throughput - Displays workflow throughput. As long as a workflow is being executed, the system continuously samples the number of processed UDRs, or raw data, per second. Queue Throughput - Displays queue throughput per second for real-time queues. Statistics for real-time queues are only available when routing UDRs, not raw data. Note! To enable its convenient delegation to external systems, or to generate an alarm if the throughput falls too low, throughput is also defined as a MIM value for the workflow. For further information, see Throughput Calculation in Workflow Properties . Simultaneous - Displays the number of simultaneously running workflows. Queue Size - The size of the queue space that is being used at the time of the sample for each individual queue. Viewing the System Statistics To open the System Statistics, go to Manage and then select System Statistics under the Tools and Monitoring section. Upon first entry, you will see the landing page: Open System Statistics Landing Page You will be provided a choice of searching local statistics by clicking the Filter Local Statistics button or importing statistics with the Import External Statistics button. There are three different types of statistics: host, pico instance, and workflow. To display statistics in System Statistics, you have to use the Filter Local Statistics button, see the section below, Searching the System Statistics, or, for Import statistics, see System Statistics | Importing Statistics . Searching the System Statistics To search, click the Filter Local Statistics button to open the Filter dialog. In the Filter dialog, search criteria may be defined in order to single out the Statistics of interest. Open Filter dialog Setting Description Setting Description Period Select this option to display the statistics from the chosen time interval. Select one of the predefined time intervals; Last Hour , Today, Yesterday , This Week , Previous Week , Last 7 Days , This Month , Previous Month , or select the option User Defined and enter the start and end dates and times of your choice in the From and To fields. Note! If several criteria are enabled, an absolute match is displayed. For instance, if Host and Workflow are specified as well as Period , only the time for which there are both workflow measures and host measures is displayed. Scale Specifies the time scale to be used. There are three different time resolutions on which statistics are collected. The default value is Hour. Time resolution Description Minute This is the most precise value but requires the most from the server when locating the statistics. It is saved every minute. Hour These values are calculated every hour and are a sum of the minute values for that hour. Day Day values are calculated by the corresponding statistics task and is a sum of the minute values for that day. Host Choose from a list of available hosts by selecting items from the drop-down list or simply click on the Select All button. Users may also type out the name of the intended host to filter by. Picos Choose from a list of available picos by selecting items from the drop-down list or simply click on the Select All button. Users may also type out the name of the intended pico to filter by. Workflows Choose from a list of available workflows by items from the drop-down list or simply click on the Select All button. Users may also type out the name of the intended workflow to filter by. Options in System Statistics Host / Pico / Workflow Views After selecting the hosts, picos and / or workflows, users may click on the Apply button to perform the search. The search cannot be performed when no options are selected from all three types of instances. Note! The default formula that the filter results will be displayed in is Average . Users may select either Minimum or Maximum later after filter result have been displayed. When the new formula is selected, all the values of the charts will be updated accordingly. Another feature within the filter dialog is the ability to select the Picos either by All available picos or by Picos that are running. Open Picos with the [R] label. Picos that are running are denoted with the label [R] before the pico name in the Picos dropdown list. Open System Statistics Simply click on the chart of choice to add to the instance view and deselect to remove it. For each type of statistics you have selected to view, you will see a Statistics type view drop-down displaying the statistical charts selected for the statistics measurement type. To add or remove other measurement types, click the Show / Hide Charts menu button found above each statistics view section of either hosts, pico or workflows statistic. The types of available charts in the drop menu to select from are mentioned above in the System Statistics | Host Statistics section for hosts, System Statistics | Pico Instance section for pico instances, and System Statistics | Workflow Statistics section for workflows. Take for example the show/hide charts list for pico as shown below Open Statistics type charts for pico instances For each statistics type you can see: View Description View Description Host View Each host has its statistics displayed in a separate color. A default measurement type chart is displayed upon first filter application Pico Instance View Each pico instance has its statistics displayed in a separate color. A default measurement type chart is displayed upon first filter application Workflow View Each workflow has its statistics displayed in a separate color, and if you have selected to view queue statistics, each queue has its own color. A default measurement type chart is displayed upon first filter application If you select to view Queue Throughput statistics and you have more than one route with the same name in a workflow, they are displayed separately by default, and are named in the format route name (source agent name), e.g. r_1 (collection1). If you want to group these queues together, e.g. due to legacy settings, select the Ignore Route Owner checkbox, and the source agent is no longer displayed per route. Note! When the Ignore Route Owner checkbox is selected, and there is more than one route with the same name, if the statistics are displayed in hour or day resolution, the average of all routes with the same name is shown. If the statistics are displayed on minute resolution, the statistics for one of the queues with the same name is shown, and there is no rule for which queue is shown. Exporting Statistics Exporting statistics may be useful for several purposes, for example if you want to share the statistical information with someone who does not have access to your system. To export the statistics: Click on the Export button. The Export dialog opens. Open Export Statistics dialog The export dialog resembles the filter dialog. You may choose which hosts / picos / workflows to be part of your export file according your desire time range as per your selection of the time period. After selecting your desired configurations, click on the Export button to save the zip file. It should be in your default download folder as per your browser setting. Hint! The export functionality can also be used to save statistics on a regular basis. Such as every month or every year, to use for comparison with the current statistics. Importing Statistics The Import functionality is used to import statistics that have previously been exported from a MediationZone system. When using the Import functionality you do not have to perform a search in order to display the statistics. Note! An import of statistics does not affect the data in the database, it just displays a snapshot of the statistics at the time it was exported. To import the statistics: In System Statistics, click Import . The Open dialog opens. Browse to the directory where the *.zip file you want to import is located. Select the file and click Open . The statistical information is now displayed in System Statistics. The same search criteria that were set in the Search System Statistics dialog when the statistics were exported is displayed. The date information at the top of the dialog displays the time interval for the imported statistics, and the text \"Imported Statistics\" also appears in red beside the date information. Disabling Collection of Statistics You can disable the collection of statistics on the Platform by setting the following Platform properties to false in platform.conf : mz.statistics.collect.all - All statistics mz.statistics.collect.pico - Pico statistics mz.statistics.collect.workflow - Workflow Statistics The default value of the properties above is true . When you set the property mz.statistics.collect.all to false , this overrides the settings of mz.statistics.collect.pico and mz.statistics.collect.workflow",
    "title": "System Statistics - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352107316/System+Statistics",
    "word_count": 2079,
    "char_count": 12576
  }
]