[
  {
    "chunk_id": 1,
    "text": "The UDR structure is wrapped in a UDR called SampleUDR . Apart from the generated structure, the SampleUDR also holds an instance of a SampleMetaData UDR, holding metadata about the performed request. There is also a special kind of SampleUDR called FlatSampleUDR used for unresolved requests. SampleUDR The type of input generated for responses that are mapped to the generated UDR structure. Setting Description Setting Description metadata (SampleMetaData) Meta information associated with the request. FlatSampleUDR A special kind of SampleUDR used in responses to unresolved requests. That is, requests triggered by an SnmpRequestUDR with the unresolved field set to true. The fields are the same as for a SampleUDR , but the data field is now a flat structure. Setting Description Setting Description data (FlatSampleData) A flat, unresolved OID -> Value mapping metadata (SampleMetaData) Meta information associated with the request. SampleData Contains data of a received SNMP response. For resolved requests, this is the generated UDR structure, compiled from the MIB files. The fields selected for polling in the SNMP Request agent are populated, unless the corresponding request times out or fails. FlatSampleData Contains SNMP response data for unresolved requests. Setting Description Setting Description isScalar (boolean) This is a flag that indicates if the value is a scalar field value or a map structure. oid (string) This is the OID string. For scalar data, it is the full OID pointing to the scalar value. For tree data, it is the root of the flattened tree. oidFieldMap (map<string.any>) A map that contains the OIDs and values for them. value (any) The scalar value or a map of scalar values. If isScalar is false, it means the data in the field value is a map representing a flattened tree structure. Each key - value pair in the map represents a node in the tree where key is an OID string and value is the scalar value. SampleMetaData Contains meta information for a request or response. Setting Description Setting Description timestamp (long) The timestamp when the response was completely received or timed out by the collection agent. The timestamp is specific to the network element. agent (string) The name of the collection agent that received the response. context (any) The context of the meta data. pollingIntervalStartedTimestamp (long) The time when the polling interval started. pollingStartedTimestamp (long) The time when the polling started. The timestamp is specific to the network element. remotehost (string) The address of the remote, polled host. remoteport (int) The port of the remote, polled host. community (string) The community string used in the request. samplestate (int) This is the state of the sample. 0 = Complete, 1 = Incomplete (no or partial result).",
    "title": "SampleUDR and FlatSampleUDR - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352180085",
    "word_count": 443,
    "char_count": 2812
  }
]