[
  {
    "chunk_id": 1,
    "text": "This section describes the different high availability properties that you can use in the STR. For further information about high availability, see High Availability Setup . All Pico Types These properties are applicable to all pico types. Property Description mz.ha.enabled Default value: false This property enables the HA Monitoring Server on a pico instance. mz.ha.log_file Default value: \"\" This property determines the directory where the HA Monitor Server will store log files. The log file contains the property assignments, that is, counter limits as well as debug and statistics information. The default setting is an empty value, meaning that the HA logging is disabled. mz.ha.host Default value: 127.0.0.1 This property determines the address of the interface that the HA Monitor Server will bind to. The HA Client typically runs on the same host as the HA Monitor server that it connects to. mz.ha.port Default value: \"\" This property determines the port that the server will bind to. This parameter must be set if an HA monitor server is used. Execution Contexts These properties are applicable to ECs. If multiple properties are specified, the ping returns FAILED if any of the properties do not comply with their respective threshold. Property Description mz.ha.interval Default value: 40 This property defines the time interval, in seconds, for the counters specified below, i.e. mz.ha.min_number_of_transactions, mz.ha.max_aborts. mz.ha.min_activations, mz.ha.min_activations_for_aborts, and mz.ha.min_consumes. The time interval must be at least 40 seconds. If a lower number is stated, the used value will be 40 seconds. mz.ha.min_activations Default value: -1 This property defines the minimum number of workflow activations required before the number of aborts are counted. The default value \"-1\" means that the counter is disabled. mz.ha.min_activations_for_aborts Default value: -1 This property must be used in combination with the mz.ha.max_aborts property to get a notion of the maximum number of aborts allowed within the mz.ha.interval. The default value \"-1\" means that the counter is disabled. mz.ha.min_consumes Default value: -1 This property defines the minimum number of consumed UDRs required within the mz.ha.interval. This property is mainly used for realtime workflows. The default value \"-1\" means that the counter is disabled. mz.ha.min_number_of_transactions Default value: -1 Defines the minimum number of closed transactions required within the mz.ha.interval. Used for batch workflows on an EC, since realtime workflows do not generate transactions. The default value \"-1\" means that the counter is disabled. mz.ha.max_aborts Default value: -1 This property defines the maximum number of aborts allowed within the mz.ha.interval. The default value \"-1\" means that the counter is disabled.",
    "title": "High Availability Properties - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352086372",
    "word_count": 416,
    "char_count": 2833
  }
]