[
  {
    "chunk_id": 1,
    "text": "APL Collection Strategy configurations are used on top of pre-defined collection strategies to customize how files are collected from the local file system. Prerequisites The reader of this document should be familiar with: Analysis Programming Language. For further information, see the APL Reference Guide . Configuration To open the configuration, go to Build  New Configuration and then select APL Collection Strategy from the menu. Open The APL Collection Strategy Configuration Setting Description Setting Description Base Collection Strategy From the drop-down list , select a pre-defined collection strategy. The Default Collection Strategy is the standard collection strategy that is used by default by the Disk and FTP agents. The available strategies are: Default Collection Strategy Control File Duplicate Filter Multi Directory TMO Full Collection Strategy Note! The Base Collection Strategy is the collection strategy that your APL Extension will be based on. When saving your new collection strategy, make sure to use a descriptive name since it will be added to the list of available strategies in the agent's configuration. The code that you see in the dialog is a default 'skeleton' set of function blocks that are already defined in the Base Collection Strategy . By adding APL code within these function blocks, you customize the way by which the collection is going to be handled by the workflow. initialize deinitialize prepareBaseDirList accept filterFiles preFileCollection postFileCollection begin commit rollback For more information about APL functions blocks and functions, see the APL Reference Guide . The FileInfo UDR Type The FileInfo UDR type includes the properties of the file to collect or a directory where files are stored. The FileInfo UDR type can be viewed in the UDR Internal Format Browser. To open the browser right-click in the editing area of an APL Editor and select UDR Assistance... . The browser opens. Open UDR Internal Format Browser - FileInfo UDR Type FileInfo UDR Fields The following fields are included in the FileInfo UDR: Field Description Field Description isDirectory(boolean) Set to True if FileInfo represents a directory. isFile(boolean) Set to True if FileInfo represents a file. name(string) The name of the file or directory. size(long) The size of the file or directory. timestamp(long) The timestamp for when the file or directory was last modified. Config Diff If you want to compare the current version of an APL collection strategy configuration that you are displaying with a previous version of the same configuration, you can use Configuration Diff to compare the two versions side by side. To view the Configuration Diff pop-up, click the Configuration Diff menu button of the APL Collection Strategy. You can navigate through the differences by scrolling both panes in parallel using the scroll bar to the right of either pane. If you want to scroll through each pane separately, hover over the pane that you want to scroll through, and use the scroll wheel on your mouse. If you want to skip through each difference in the panes, you can use the navigation buttons: Previous , Next and Refresh , which are described below. Item Description Item Description History To select a different version of the same configuration, use the drop-down box to select the version you want to display. Open You can also display and view encrypted configurations. If you select an encrypted configuration, you are prompted to enter the relevant password to decrypt the configuration. Previous Click this button to skip to the previous difference in the configurations. The previous difference is highlighted in green. Next Click this button to skip to the next difference in the configurations. The next difference is highlighted in green. Refresh Click this button to display the updated version of the configuration. Configurations are not locked when you display them in Configuration Diff. If another user has modified and saved a configuration that you are viewing in this tool, you can click this button to view the latest updated version.",
    "title": "APL Collection Strategy - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352115929/APL+Collection+Strategy",
    "word_count": 649,
    "char_count": 4107
  }
]