[
  {
    "chunk_id": 1,
    "text": "Config urati ons that are created in the platform share a button bar that allows interactions and operations to be accessed. These common configuration buttons are applicable to all configuration types except Workflows. Some configuration types may have buttons and those are described in detail in each separate section of the documentation. For more information, see the documentation for each configuration type. Button Description Open Edit Click this button to edit the configuration. Note! Each configuration will only allow 1 user to edit it at any one time. While editing the configuration, it will be locked to the user's session. To release the lock, you must navigate away from the configuration to another page. It is advised not to close the browser tab without navigating away from the configuration first as this will cause the lock to stay in place until timeout. Open New Click this button to create a new configuration of the same type. Open Open Click this button to open another configuration. Open Save Click this button to save changes to an existing configuration. Open Save As Click this button to open the Save As dialog where you can select in which folder you want to save the configuration and enter the name you want to save it as. Open Permissions Click this button to define permissions for the configuration. Open Validate Click this button to check if the configuration is valid. Open References Click this button to see which other configurations the configuration uses, or is used by. Open History Click this button to view the version history of the configuration. Open Dialog See the different tabs b elow for examples of the Open , Save As , Permissions , References , and History dialogs when using the previous buttons in the table above. This window is displayed when the users click the Open button in the configurations screen. It allows previously saved configurations to be loaded in the current instance.  the name permissions and owner are displayed in individual rows. Open You can use the Filter Name field to easily find a given instance. Save as dialog This window is displayed when the users click the Save As button in the configurations screen. It allows the current configuration to be saved to a designated folder. Open Save As dialog box You assign a Name and an optional version comment in the fields, as well as encrypt your workflow. Open Save As dialog box - Passphrase settings Permission Dialog This window is displayed when the users click the Permissions button in the configurations screen. It is used to set individual permissions based on the users' role  the owner itself, and the associated access groups in both read, write and execute permissions. Open Open The Browser options allow the users to select the designated user from a dialog box called User Selection . References Dialog This window is displayed when the users click the References button in the configurations screen. Open It displays three tabs that show important information in relation to all references that are part of the current configuration. The Used By tab lists all references that are currently used in the configuration, and the Users list the active users that have access to these references. The Access shows the access group and the listed users under them. History Dialog This window is displayed when the users click the History button in the configurations screen. Open It shows the available Version digit, the Modified date, Modified by , and the Comment which lists an optional comment for the listed version.",
    "title": "Common Configuration Buttons - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352170980",
    "word_count": 595,
    "char_count": 3569
  }
]