[
  {
    "chunk_id": 1,
    "text": "When configuring notifications with Notification Type Log File, you have the option to use External References for configuring Directory, Filename and Size, see Log File in Event Notifications Configuration . Whenever a notification with notification type log file, that uses external references, is generated, the System External Reference event is triggered. Filtering In the Event Setup tab, the values for all the event fields are set by default to All in the Match Value(s) column, which will generate event notifications every time data a System External Reference event occurs. Double-click on the field to open the Match Values dialog where you can click on the Add button to add which values you want to filter on. If there are specific values available, these will appear in a drop-down list. Alternatively, you can enter a hard coded string or a regular expression. The following fields are available for filtering of System External Reference events in the Event Setup tab: Fields inherited from the Base event The following fields are inherited from the Base event, and described in more detail in Base Event : category - If you have configured any Event Categories, you can select to only generate notifications for System External Reference events with the selected categories. See Event Category for further information about Event Categories. contents - The contents field contains a hard coded string with event specific information. If you want to use this field for filtering you can enter a part of the contents as a hard coded string. eventName - This field can be used to specify which event types you want to generate notifications for. This may be useful if you have configured notifications for several different events with notification type log file, that uses external references, and you only want notifications to be generated for a specific event type. origin - If you only want to generate notifications for events that are issued from certain Execution Contexts, you can specify the IP addresses of these Execution Contexts in this field. receiveTimeStamp - This field contains the date and time for when the event was inserted into the Platform database. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2012-06.*\" for catching all events from 1st of June, 2012, to 30th of June, 2012. severity - With this field you can determine to only generate notifications for events with a certain severity; Information, Warning, Error or Disaster. timeStamp This field contains the date and time for when the Execution Context generated the event. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2012-06-15 09:.*\" for catching all events from 9:00 to 9:59 on the 15th of June, 2012. Note! The values of these fields may also be included in the notifications according to your configurations in the Notifier Setup tab.",
    "title": "System External Reference Event - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352073511/System+External+Reference+Event",
    "word_count": 489,
    "char_count": 2968
  }
]