[
  {
    "chunk_id": 1,
    "text": "The creation of the database must be made by the SAP HANA UNIX user, on the machine where SAP HANA is installed. The SAP HANA UNIX user is assumed to perform the installation steps below. Create the SAP HANA database instance. The working directory is saphana . $ ./saphana_create_instance.sh [<SAP HANA admin user>] [<SAP HANA admin password>] If no error occurs, the database creation is now complete and the rest of this section can be ignored. Note! saphana_create_instance.sh is a shell script designed to execute a series of SQL scripts to create the necessary database objects required for MediationZone. The SQL scripts executed by this script include: saphana_create_db.sql - Contains SQL statement to create database. saphana_users.sql - Contains SQL statement to create JDBC user. Hint! After the instance creation script is executed, there will be a log file in the /tmp directory that can be used for troubleshooting. The mz_db.log file contains SAP HANA responses from the database creation. If the script fails, clean up the system before the next try: Stop DB (this is needed to drop it): hdbsql -i 90 -d SystemDB -u SYSTEM -p QAmzadm1n \"ALTER SYSTEM STOP DATABASE MZ\" Drop DB: hdbsql -i 90 -d SystemDB -u SYSTEM -p QAmzadm1n \"DROP DATABASE MZ\" If you require to change any installation parameter defined in the install.xml , the installation must be restarted from the generation step. See SAP HANA Preparations for more information. Hint! The SAP HANA audit policy only works for the user  SYSTEM  due to the parameter  FOR SYSTEM . To use a different user, change  SYSTEM  to the desired username. See https://help.sap.com/docs/SAP_HANA_PLATFORM/b3ee5778bc2e4a089d3299b82ec762a7/ddcb6ed2bb5710148183db80e4aca49b.html?version=2.0.05&locale=en-US for more information.",
    "title": "SAP HANA Database Creation - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352136765/SAP+HANA+Database+Creation",
    "word_count": 271,
    "char_count": 1785
  }
]