[
  {
    "chunk_id": 1,
    "text": "Usage usage: disconnect [-q] [-verbose] <running server process> This command allows an EC and its workflows to run in disconnected mode during a platform upgrade, helping to prevent downtime. Note! Since a batch workflow cannot run without contact with the Platform, this command should only be executed on ECs running real-time workflows. If an EC running a batch workflow is disconnected, the workflow will abort. After disconnect, the EC will continue executing real-time workflows without interference from the platform, and there is no risk that new software will be downloaded to the EC during the Platform upgrade. After the upgrade has been performed, each EC has to be restarted in order to re-connect to the Platform, refer to restart for more information. The command accepts the following options: Option Description Option Description [-q] Quiet mode. Use this option to eliminate the display of any report during execution. [-verbose] Verbose mode. This option will print extended error information. Running the disconnect command from the platform without any options will disconnect all running ECs across all connected machines, eliminating the need to log in to each machine individually. MZ>> disconnect Hint! To get the latest status information for all local EC, execute the status command as described in status . Return Codes Listed below are the different return codes for the disconnect command: 1-3: Errors only effecting one or more EC. 10-11: Fatal error, no EC was disconnected. Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if an EC process is not running. 2 Will be returned if an EC cannot be reached due to a communication problem. 3 Will be returned if an EC does not exist. 10 Will be returned if the Platform cannot be reached due to communication problems. 11 Will be returned in case configuration files in MZ_HOME/etc contain errors that prevent the command from running.",
    "title": "disconnect - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352150423/disconnect",
    "word_count": 317,
    "char_count": 1968
  }
]