[
  {
    "chunk_id": 1,
    "text": "With the Development Toolkit you can build the following plugins for the MediationZone Platform: Agent Plugins - for creating customized agents APL Plugins - for creating customized APL functions Event Plugins - for creating customized events Notifier Plugins - for creating customized notifiers UDR Plugins - for creating customized UDRs Ultra Plugins - for creating customized decoders Workflow Service Plugins - for creating customized workflow services DTK Contents The Development Toolkit contains: DTK classes in devkit.jar Javadoc for DTK classes Example source code DTK user's guide Packages The following packages are available for com.digitalroute.devkit : Package Description Package Description apl Provides support for creating APL plugin functions. drudr Used to create, manipulate, and view UDR descriptions within the system. drui Provides user interface component classes. event Provides the definition of an event and the event and target used in Event Notification configurations. exception Provides exception classes. ultra Contains Ultra field plugin support classes. wf Contains all workflow-related functionalities, for example, agent development, services, and MIM usage. wf.udr Contains classes for the specific FNTUDR and MultiForwardingUDR. storable Provides interfaces defining a MediationZone storable. storable.upgrade Provides for configuration upgrade. misc Contains miscellaneous classes, for example, environment interfaces used by the plugins to call MediationZone. doc Contains classes with support for adding online user documentation. Filesystem Structure When DTK is installed according to the instructions in Installation and Setup , the following files and folders are available in the <devkit_dir> folder: Item Description Item Description examples Contains source code for the reference implementations shipped with DTK. The examples can be used as a base for developing custom-made plugins. javadoc Contains the DTK Javadoc including documentation of all DTK classes and interfaces. javadoc-examples Contains the plugin examples available in DTK Javadoc. lib Contains DTK library file(s) needed for building plugins.",
    "title": "Development Toolkit Overview - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352083837/Development+Toolkit+Overview",
    "word_count": 296,
    "char_count": 2160
  }
]