[
  {
    "chunk_id": 1,
    "text": "The provisioning functions include: 1 pccGetData 2 pccListData 3 pccCreateData 4 pccUpdateData 5 pccDeleteData 6 pccLastErrorCode 7 pccLastErrorMessage 8 pccSetProvisioningArea 9 pccGetProvisioningArea 10 pccCopyAreaData 11 pccClearArea These functions can be used to interact with the PCC provisioning interface. pccGetData Retrieves a specific UDR from the provisioning interface based on the stated UDR type and key. drudr pccGetData ( string typename, string key) Parameters Parameter Description Parameter Description typename The fully qualified typename of the requested UDR. key The primary key value of the requested UDR, which is unique Returns: The matching UDR or null if no matching UDR was found, or if an error occurred during lookup. Example drudr rule = pccGetData(\"PCRF.Rules.Provisioning.PCC_Rule\",555); will retrieve a UDR of the type PCRF.Rules.Provisioning.PCC_Rule with the key 555 . pccListData Retrieves a list with all the UDRs from the provisioning interface with the stated UDR type. list<drudr> pccListData ( string typename ) Parameters Parameter Description Parameter Description typename The fully qualified typename of the requested UDRs. Returns: A list containing all the UDRs of the requested type. Example list<drudr> pccRulesList = pccListData (\"PCRF.Rules.Provisioning.PCC_Rule\"); will return a list named pccRulesList with all the UDRs that have the type PCRF.Rules.Provisioning.PCC_Rule . pccCreateData This function inserts a new UDR through the provisioning interface. drudr pccCreateData ( drudr udr ) Parameters Parameter Description Parameter Description udr The new UDR that is going to be inserted. Returns: The created UDR or null if there was an error. Example drudr created = pccCreateData(input); will insert a new UDR named created through the provisioning interface. pccUpdateData This function updates a UDR through the provisioning interface. drudr pccUpdateData ( drudr udr ) Parameters Parameter Description Parameter Description udr The UDR that is going to be updated. Returns: The updated UDR or null if there was an error. Example drudr pccUpdateData(created); will update the UDR named created through the provisioning interface. pccDeleteData This function deletes a UDR in the provisioning interface. drudr pccDeleteData ( drudr udr ) Parameters Parameter Description Parameter Description udr The UDR that is going to be deleted. Returns: The deleted UDR or null if there was an error. Example drudr pccDeleteData(created); will delete the UDR named created through the provisioning interface. pccLastErrorCode If any of the create, delete or update operations should fail, the error code can be retrieved with this method. int pccLastErrorCode() Error code Explanation Error code Explanation 200 Will be returned if the last operation was successful. 400 Will be returned if you are trying to create or update an object that is missing required references. The object will not be created or updated. 401 Will be returned if the delete operation failed because the object contains references from other objects. 402 This error code is only applicable for the pccCreateData function, and will be returned if the object already exists. 403 Will be returned if any of the functions pccGetData, pccUpdateData, or pccDeleteData are referring to a missing object. 500 Will be returned if there was an error trying to read/write to storage. Example If the last error code was 500. int pccLastErrorCode(); will return 500. pccLastErrorMessage If any of the create, delete or update operations should fail, a more detailed description of the error can be retrieved with this method. string pccLastErrorMessage() Parameter Description Parameter Description Returns: A description of the last error. Example If the last error code was 500. string pccLastErrorMessage(); will return a description of error code 500. pccSetProvisioningArea Sets a provisioning working area for the workflow. There are two areas available, TEST and PROD. void pccSetProvisioningArea ( string area ) Parameters Parameter Description Parameter Description area The name of the area to work against. All delete, update, get and create operations will use this area. Must be either TEST or PROD. Example pccSetProvisioningArea(\"TEST\"); will set area TEST as working area for the workflow. pccGetProvisioningArea Retrieves information about the currently active area for the workflow. string pccGetProvisioningArea() Parameters Parameter Description Parameter Description Returns: The name of the currently active provisioning area. Example If the currently active area for the workflow is TEST, string pccGetProvisioningArea(); will return \"TEST\". pccCopyAreaData Copies the specified configurations in one area to another. Warning! This function will also clear the target area from all previous configurations before the new configurations are inserted. void pccCopyAreaData ( string source, string destination, string product ) Parameters Parameter Description Parameter Description source The name of the source area. destination The name of the destination area. product The name of the product to copy. Example pccCopyAreaData(\"TEST\",\"PROD\",\"PCRF.Rules\"); will copy all the provisioned PCRF Rules data from the TEST area to the PROD area. Note! When working with PCC Rules, the product parameter should be set to PCRF.Rules. pccClearArea Deletes the specified product in the stated area. void pccClearArea ( string area, string product ) Parameters Parameter Description Parameter Description area The name of the area to clear. product The name of the product you want to delete. Example pccClearArea(\"TEST\",\"PCRF.Rules\"); will clear the area TEST from old PCRF Rules configurations. Note! When working with PCC Rules, the product parameter should be set to PCRF.Rules.",
    "title": "APL - PCC Rules Provisioning Plugin - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352084619/APL+-+PCC+Rules+Provisioning+Plugin",
    "word_count": 840,
    "char_count": 5807
  }
]