[
  {
    "chunk_id": 1,
    "text": "Duplicate UDR maintains storage consistency by putting in place a locking mechanism on the Duplicate UDR storage. Access to the Duplicate UDR storage via Desktop will only be allowed by obtaining a Duplicate UDR storage lock. The Duplicate UDR storage lock corresponds with each: Duplicate UDR profile by default when the Enable Separate Storage Per Workflow setting is disabled Duplicate UDR profile and workflow combination when the Enable Separate Storage Per Workflow setting is enabled. Lock Scenarios and Resolution Certain scenarios may lead to storage locks, impacting access via Duplicate UDR Inspector and Duplicate UDR workflows execution. Here is a highlight of scenarios to assist in managing the locks effectively and to prevent impediment to storage access. Profile Delete and Modifications The following are scenarios which would render the information stored in cache useless for future workflow runs: Deleting a Duplicate UDR profile Changing the UDR settings in the General tab of a Duplicate UDR profile Changing the SQL Storage specific Database Profile setting Changing the File Storage specific Directory setting Changing the following Storage settings common to both File Storage and SQL Storage Based On System Arrival Time Based on Latest Time Stamp in Cache Enable Separate Storage Per Workflow When these scenarios occur, users will be prompted with a confirmation to delete all data corresponding to the previous profile configuration. Upon confirmation, a lock will be obtained for the Duplicate UDR profile before proceeding to delete all data in the storage cache. This operation necessitates a lock that will prevent all other operations from accessing the storage until the data deletion process is completed. Duplicate UDR Workflow Execution Running a workflow with Duplicate UDR will lock the Duplicate UDR storage and prevent all other storage write operations until the workflow run is complete. You will not be able to run another workflow with this locked Duplicate UDR storage. While the workflow is being executed, storage read operations such as doing a Search with Duplicate UDR Inspector is still allowed. Note! If the Enable Separate Storage Per Workflow setting is enabled, multiple different workflows can obtain locks for the same Duplicate UDR profile and will be able to execute in parallel. Deleting Operation via Duplicate UDR Inspector Deleting Storage Data via Duplicate UDR Inspector requires obtaining a lock which would prevent all other storage write operations until the delete operation is complete. Like executing a workflow with Duplicate UDR, other storage read operation will be allowed while the delete operation is ongoing. Note! This is applicable only to the Legacy Desktop. Ensure that the Read Only check box is selected unless you need to delete batches from the cache. If not selected, the profile will be locked and workflows using the profile will not be able to write to the cache.",
    "title": "Duplicate UDR Locking Mechanism - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352109990/Duplicate+UDR+Locking+Mechanism",
    "word_count": 462,
    "char_count": 2957
  }
]