[
  {
    "chunk_id": 1,
    "text": "The Platform, ECs and SCs can host services that workflows, running in ECs, can share. The system default values for standard services are specified in standard.conf . Standard Service Description Standard Service Description storage-dispatcher This service runs on the Platform and is required for database handling. aeron-media This service may run on an EC or an SC and is required for aeron message transport. By default, no SC is specified and the service will be started on the EC where it is invoked. Services that are frequently configured to meet the requirements of specific use cases are referred to as custom services. You can configure these services in the file custom.conf . You can also use this file to override the values of properties in standard.conf . If you set the property install.str.config-script to scripts/str-templates/basic.sh in install.xml during the installation, the following custom services will be available in custom.conf : Custom Service Description Custom Service Description kafka Required by Kafka agents and KPI Management zookeeper Required by Kafka agents and KPI Management Each service has a unique set of properties. For instance, the method of specifying the required SCs are different for the services kafka and zookeeper . Example - Specifying required SCs The kafka service directly references a number of SCs, which are assigned a unique broker id. { kafka { kafka1 { template: \"1/standard/basic\" config: { zookeeper-instance: \"zookeeper1\" deployment-info: [{ sc:\"sc1\",brokerid:1},{ sc:\"sc2\",brokerid:2},{ sc:\"sc3\",brokerid:3}] } } } } Similar to the kafka service, the zookeeper service directly references the required SCs. { zookeeper { zookeeper1 { template: \"1/standard/basic\" config: { sc-list: [zk1, zk2, zk3] } } } } For further information about properties that are available for each respective service, see the relevant sections in the user documentation. This chapter includes the following sections:",
    "title": "Managing Service Configurations (Removed from User Doc for XE-15203) - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352151269/Managing+Service+Configurations+Removed+from+User+Doc+for+XE-15203",
    "word_count": 295,
    "char_count": 1965
  }
]