[
  {
    "chunk_id": 1,
    "text": "This section describes the server functions that are used to to manage requests (UDRs) from the HTTPD collector agent. The following functions for HTTP Server described here are: 1 httpGetRequestCookie 2 httpGetRequestCookieNames 3 httpSetResponseCookie httpGetRequestCookie This function searches for a cookie name in the httpdUDR and returns the contents. string httpGetRequestCookie ( any httpdUDR , string cookieName ) Parameter Description Parameter Description httpdUDR The request cookieName A cookie is made up of a key:value data object, where cookieName is the key. Note! The value can be \"null\". Returns The contents (value) of the cookie. httpGetRequestCookieNames This function retrieves a list of cookie names (keys) from the request (UDR). list <string> httpGetRequestCookieNames ( any httpdUDR ) Parameter Description Parameter Description httpdUDR The request Returns A list of cookie names httpSetResponseCookie This function sets the response cookie (UDR) fields. void httpSetResponseCookie ( any httpdUDR, string name, string value, boolean discard, string domain, long maxAge, string path, boolean secure ) Parameter Description Parameter Description httpdUDR The response name The name of the cookie (the key in the key:value cookie object) value The contents of the cookie (the value in the key:value cookie object) discard Set to \"true\" to discard the cookie at browser close, or \"false\", to keep it. domain The domain to which the cookie should be sent maxAge The life-length of the cookie in seconds path The path within the domain that triggers the cookie secure Set to \"true\" for sending the cookie only to secure sites, or \"false\", for sending the cookie to any site within the domain. Returns Nothing",
    "title": "HTTP Server Functions - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352085379/HTTP+Server+Functions",
    "word_count": 260,
    "char_count": 1730
  }
]