[
  {
    "chunk_id": 1,
    "text": "Supported data types for Reference Data Management includes a list of Java SQL types retrieved via the JDBC drivers of the supported databases. Reference Data Management currently supports Oracle, PostgreSQL, MariaDB, and SAP HANA. You will need to refer to the respective database JDBC driver documentations for detailed information on the database data type to Java SQL type mapping. For unsupported data types, the following is a list of Reference Data Management features that will be impacted(where unsupported fields will be omitted from SQL statements): Query Expressions Edit Insert Export As a quick guide, the following is a generalized table which maps the supported Java SQL types to some of the commonly used and tested PostgreSQL , Oracle , MariaDB , and SAP HANA data types. Note! This data type is only applicable to JSON Viewer. Category Java SQL Types PostgreSQL Data Types Oracle Data Types MariaDB Data Types SAP HANA Data Types Category Java SQL Types PostgreSQL Data Types Oracle Data Types MariaDB Data Types SAP HANA Data Types STRING java.sql.Types.CHAR java.sql.Types.NCHAR java.sql.Types.VARCHAR java.sql.Types.NVARCHAR character (char) character varying (varchar) CHAR VARCHAR VARCHAR2 CHAR LONGTEXT JSON MEDIUMTEXT TEXT VARCHAR Note! LONGTEXT and JSON data types are only applicable to JSON Viewer. VARCHAR NVARCHAR ALPHANUM SHORTTEXT NUMBER java.sql.Types.SMALLINT java.sql.Types.REAL java.sql.Types.FLOAT java.sql.Types.DOUBLE java.sql.Types.INTEGER java.sql.Types.DECIMAL java.sql.Types.BIGINT java.sql.Types.TINYINT java.sql.Types.NUMERIC numeric (decimal) integer (int, int4) bigint (int8) double precision (float8) NUMBER FLOAT BIGINT DECIMAL DOUBLE FLOAT INT MEDIUMINT SMALLINT TINYINT TINYINT SMALLINT INTEGER BIGINT DECIMAL REAL DOUBLE DATE/TIME java.sql.Types.TIMESTAMP java.sql.Types.DATE java.sql.Types.TIME timestamp date time TIMESTAMP DATE DATE TIME TIMESTAMP DATE TIME TIMESTAMP BOOLEAN java.sql.Types.BOOLEAN boolean (bool) BOOLEAN BOOLEAN LARGE OBJECTS java.sql.Types.CLOB java.sql.Types.OTHER json jsonb Note! These data types are only applicable to JSON Viewer. CLOB Note! This data type is only applicable to JSON Viewer. CLOB Note! This data type is only applicable to JSON Viewer.",
    "title": "Data Types for Reference Data Management - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352184426/Data+Types+for+Reference+Data+Management",
    "word_count": 301,
    "char_count": 2232
  }
]