[
  {
    "chunk_id": 1,
    "text": "Usage usage: wfcommand <pattern matching expression for workflow name> <'Workflow' | workflow service | agent> <instructions> ... Debug The debug command cannot be sent to a specific agent, it is only functional on a workflow level. To turn debug on for a workflow: wfcommand <workflow> Workflow debug on To turn the debug for a workflow off: wfcommand <workflow> Workflow debug off Aggregation and Diameter agents The Aggregation and Diameter agents allow the user to interact with the flow of data via the wfcommand. For further information, see Aggregation (5.0) and Diameter(5.0) . GTP agent The GTP agent allows the user to view the MIM counters with wfcommand printcounters . For further information, see https://infozone.atlassian.net/wiki/x/jkb9F . The request counters and the timestamp, which are published as MIM values are also possible to view from the command line tool. Syntax to run the wfcommand function in mzcli: mzcli wfcommand <Workflow Name> <Agent Name> printcounters Parameters Parameter Description Workflow Name Name of the workflow that contains the GTP agent. Agent Name Name of the GTP agent in the workflow. Example - Executing the wfcommand $ mzcli mzadmin/dr wfcommand \"Default.myWorkflow\" \"GTP_1\" printcounters Default.myWorkflow (3): Data Record Count: 138 Cancel Data Count: 2 Message Error Count: 0 Possible Duplicate Count: 5 Release Data Count: 1 Out of Sequence Count: 0 Duplicate Message Count: 0 Redirect Count: 0 Last Request Timestamp: Thu Mar 07 14:38:12 CET 2013 Supervision By stating the Supervision service you can select to trigger and clear supervision actions with the wfcommand command. If you want to use the wfcommand to trigger the Supervision service, you can append the following instructions: manual which has the following syntax: Usage: manual [-action actionName actionParameters] Simply entering manual will deactivate the Supervision Service configurations and switch to manual mode, which means that no conditions will be evaluated and no actions will be executed. When using the -action option, the syntax will be as follows: Usage: manual -action overload ( <ratio> | -trigger | -clear ) [strategy] Options Option Description Option Description ratio If you want to trigger overload and reject a specific ratio of incoming requests, e g reject every fifth request, you can enter the ratio number here. 2 equals every second request, 5 equals every fifth request, etc. -trigger Use this option if you want to trigger overload for everything. An event will then be sent out for monitoring purposes. This will disable the automatic Supervision configuration. -clear Use this option if you want to clear overload for everything. Any Diameter/Radius overload protection strategies will be cleared and no requests will be rejected. The automatic Supervision configuration will then be disabled. Note! Using this option will not enable the automatic Supervision configuration. [strategy] Use this option to state a specific Diameter/Radius strategy, for example, Diameter_AbortSessionRequest, Diameter_CCEventRequest, etc. automatic is used to revert to automatic Supervision configuration. When switching from automatic to manual mode, all active overload protection will remain active. However, in the opposite direction, when switching from manual to automatic mode, all active overload protection will be reset and the appropriate overload protection will be set by the automatic rules. Each time you switch between manual and automatic mode, an entry will be logged in the System Log for monitoring purposes. Example - Trigger Overload Protection To trigger overload protection for a workflow: wfcommand <workflow> \"Supervision\" manual -action overload -trigger An event will then be sent out for monitoring purposes. To clear overload protection for a workflow: $ wfcommand <workflow> \"Supervision\" manual -action overload -clear To reject every fifth Diameter AbortSessionRequest in a workflow: $ wfcommand <workflow> \"Supervision\" manual -action overload 5 Diameter_AbortSessionRequest To switch back to automatic mode: $ wfcommand <workflow> \"Supervision\" automatic See https://infozone.atlassian.net/wiki/x/AgHzHQ for more information. Return Codes Listed below are the different return codes for the wfcommand : Code Description Code Description 1 Will be returned if command-line arguments are missing. 2 Will be returned if no matching workflows can be found, or if the workflow is not running. 3 Will be returned if the target agent cannot be found, or if the agent is not accepting/supporting the command.",
    "title": "mzcli - wfcommand - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/527073950/mzcli+-+wfcommand",
    "word_count": 680,
    "char_count": 4579
  }
]