[
  {
    "chunk_id": 1,
    "text": "Set the installer properties described below in the install.xml file. The properties are described in the order they appear in the install.xml file. Property Description Property Description mz.container Default value: \" \" Example value: platform1 This property specifies an identifier for the installed container. Each container in the system must have a unique identifier. Typical values for mz.container is the hostname, or a descriptive value for the purpose of the container. The permitted characters for the container identifier are 'a-z','0-9' and '-'. Note! It is mandatory to specify this property. mz.home Default value: /opt/mz This property specifies the target directory for the installed container and is automatically set to the environment variable you specified for MZ_HOME when Setting Environment Variables for Platform . install.types Default value: platform,ui,ec This property specifies which components of the system will be installed. platform is the core Platform. ui is the web-based user interface, and ec is the Execution Context. For a Platform Container installation, you must include platform . Note! If you plan to install Execution Contexts (ECs) separately in an Execution Container installation, remove ec from the default value. install.admin.password Default value: dr This property specifies the password for the administrative user mzadmin . install.silent.enabled Default value: false This property enables or disables silent installation. When set to true , the installation proceeds without prompting for user input. If set to false , user interaction will be required. Note! If the keystore location, password, or admin password is invalid or do not meet the required criteria, the installation will be aborted. install.keystore.location Default value: \"\" This property specifies the path to an existing keystore file. If not provided, a self-signed keystore will be automatically generated in $MZ_HOME/keys using the configured keystore password ( install.keystore.password ). install.keystore.password Default value: \"\" This property specifies the password for the keystore. When silent installation is enabled, a valid keystore password is required , regardless of whether a self-signed keystore is generated or an existing keystore is used. install.keystore.alias Default value: \"\" This property specifies the alias for the keystore entry. It is optional for self-signed keystore generation. However, if install.silent.enabled is set to true and install.keystore.location is specified, an alias must be provided. install.security Default value: true This property specifies if the password of the mzadmin user must be changed during the installation and if enhanced security user control will be used. A valid certificate in a keystore is required for the installation. If it is not already prepared, the installation process will create a new one when prompted. See Network Security for more information on network security. install.str.remote.enabled Default value: true This property enables remote execution. For example you can use the mzsh command system to start and stop pico instances on remote container hosts. By default, this will perform the following steps: Add the Platform's public key to ~/.ssh/authorized_keys Add SSH connection information for this host to the STR, including: ssh-address: The hostname of this host (for example, $(hostname)) ssh-port: 22: Default SSH port hostkeys: Discovered SSH public keys for this host in known file locations Note! This allows the holder of the platform key to log in to this host via SSH. If this is not desired, or if the default values are not suitable, set this value to false . It is still possible to enable remote execution after the installation by using the mzsh command topo setupremote.",
    "title": "Installer Properties for Platform - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352105211/Installer+Properties+for+Platform",
    "word_count": 565,
    "char_count": 3803
  }
]