[
  {
    "chunk_id": 1,
    "text": "Automatic Statistics includes the System Log, the System Statistics and the ECS Statistics. The System Statistics monitors system resources and record throughput for each workflow. The ECS Statistics gives information on records sent to and collected from the central error repository. All automatically recorded information can be viewed in comprehensive GUI views. MediationZone constantly collects information from the different sub-systems and hosts in the system. This information is among other things used for load balancing. By using the System Statistics tool, it is possible to view collected statistics. There are various kinds of statistics that are described more in detail in subsequent chapters. Host Statistics MediationZone collects statistics from the different machines hosting a Platform or Execution Context. For example, the load of the CPU or the number of context switches. This is called host statistics. MediationZone uses an external binary called vmstat to collect the information. This binary must be installed to have statistics collected and to perform load-balancing work for workflows. All values that are collected from a host can be selected from a list. On newer operating systems some of these may not be available for collection due to changes in the kernel of the operations system. In this example, CPU User Time (%) has been selected for a certain host and is displayed in a graph: Open Example of host statistics viewed from the System Statistics tool Workflow Statistics When a workflow is running, MediationZone continuously collects information on how much data is being processed. This (throughput) is measured per second. In most cases this number will be UDRs per second but e there are no UDRs routed in the workflow it will instead be raw data per second. The throughput is sampled every five seconds. Throughput is also defined as a MIM value for the workflow in case it would be convenient to delegate this to external systems, or to generate alarms if the throughput falls to low. The System Statistics window also shows a calculated number of simultaneously running workflows. Open Example of workflow statistics viewed from the System Statistics tool Pico Instance Statistics Every minute MediationZone collects memory information from the different Java processes defining the Platform and the Execution Context. This information shows how much memory is used and how much memory that can be used for the running process. The following is an example from the standard GUI view: Open Example of system statistics in Pico Viewer Error Correction Statistics An overview of different errors that exist in the environment can be viewed from the ECS Statistics tool Open Overview of errors in the system Offline Analysis of System Statistics The System Statistics sub-system has an import & export capability for the statistical data. This feature enables the users to export data from a production system and to import it into a test/development system for offline root-cause analysis. System Access/System Event From the System Log, which is also available from the Web Interface, an audit trail of a certain user can be displayed. Criteria such as user, date, Entity (workflow), and action updated, logged etc can be displayed. Further different formats of the report can be customized if direct access to the database is granted, or if data is exported to an external system. Open Example of collected statistics viewed in the System Log",
    "title": "Automatic Statistics - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352152269/Automatic+Statistics",
    "word_count": 553,
    "char_count": 3491
  }
]