[
  {
    "chunk_id": 1,
    "text": "Input/Output Data The input/output data is the type of data an agent expects and delivers. The agent emits and receives UDRs of the type RequestCycleUDR . When you have configured an error route, the agent also emits UDRs of the type DiameterErrorUDR . MIM For information about the MIM and a list of the general MIM parameters, see Administration and Management in Legacy Desktop . Publishes MIM Value Description MIM Value Description Bytes Received This MIM parameter contains the number of received bytes from each peer in the selected Diameter Routing profile. Bytes Received is of the map<string>, long> type and is defined as a global MIM context type. The string values in the map contain the host-names of the peers. Bytes Transmitted This MIM parameter contains the number of transmitted bytes to each peer in the selected Diameter Routing profile. Bytes Transmitted is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the host-names of the peers. CEA Count This MIM parameter contains the number of sent and received CEA (Capabilities-Exchange-Answer) commands for each peer in the selected Diameter Routing profile. CEA Count is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the hostnames of the peers. CER Count This MIM parameter contains the number of sent and received CER (Capabilities-Exchange-Request) commands for each peer in the selected Diameter Routing profile. CER Count is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the hostnames of the peers. Communication Failure Network Layer This MIM parameter contains the number of connection problems detected on network level. Communication Failure Network Layer is of the long type and is defined as a global MIM context type. Communication Failure Protocol Layer This MIM parameter contains the number of connection problems detected on protocol level. Communication Failure Protocol Layer is of the long type and is defined as a global MIM context type. Diameter Too Busy Count This MIM parameter contains the number of sent Diameter Too Busy responses. The MIM value is reset each time the MIM is read. Diameter Too Busy Count is of the long type and is defined as a global MIM context type. Diameter Too Busy Total Count This MIM parameter contains the number of Diameter Too Busy responses sent, since Workflow start. Diameter Too Busy Total Count is of the long type and is defined as a global MIM context type. DPA Count This MIM parameter contains the number of sent and received DPA (Disconnect-Peer-Answer) commands for each peer in the selected Diameter Routing profile. DPA Count is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the hostnames of the peers. DPR Count This MIM parameter contains the number of sent and received DPR (Disconnect-Peer-Request) commands for each peer in the selected Diameter Routing profile. DPR Count is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the hostnames of the peers. DWA Count This MIM parameter contains the number of sent and received DWA (Device-Watchdog-Answer) commands for each peer in the selected Diameter Routing profile. DWA Count is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the hostnames of the peers. DWR Count This MIM parameter contains the number of sent and received DWR (Device-Watchdog-Request) commands for each peer in the selected Diameter Routing profile. DWR Count is of the map<string, long> type and is defined as a global MIM context type. The string values in the map contain the hostnames of the peers. Incoming Messages This MIM parameter contains the number of received messages. Incoming Messages is of the long type and is defined as a global MIM context type. Origin State Id This MIM parameter contains a value that is incremented in the initialize workflow execution state. It is used for populating the AVP Origin-State-Id. Origin State Id is of the int type and is defined as a global MIM context type. To amend this counter, see Diameter Functions in the APL Reference Guide . Outgoing Messages This MIM parameter contains the number of sent messages. Outgoing Messages is of the long type and is defined as a global MIM context type. Peer Status This MIM parameter contains the status of a Peer. The first string is the hostname and the second string is the status for that peer. Status can be any of the following: OKAY, SUSPECT, DOWN, REOPEN, or INITIAL. These are the watchdog states as de fi ned in RFC3539. The value of Peer Status is always INITIAL in the initialize work fl ow execution state. Peer Status is of the >map<string,string> type and is defined as a global MIM context type. Peer Round Trip Latency Avg This MIM parameter contains the average round trip latency to peer, calculated (in milliseconds) over the last 1000 received records. Workflow Round Trip Latency Avg is of the long type and is defined as a global MIM context type. Peer Round Trip Latency Max This MIM parameter contains the maximum round trip latency to peer since Workflow start. Workflow Round Trip Latency Max is of the long type and is defined as a global MIM context type. Peer Round Trip Latency Min This MIM parameter contains the minimum round trip latency to peer since Workflow start. Workflow Round Trip Latency Min is of the long type and is defined as a global MIM context type. Peer Status This MIM parameter contains the state of a peer connection. The first string is the hostname and the second string is the state. The state can be any of the following: OKAY, SUSPECT, DOWN, REOPEN, or INITIAL. These are described in RFC 3539. The value of Peer Status is always INITIAL in the initialize workflow execution state. Peer Status is of the map<string,string> type and is defined as a global MIM context type. Realm Routing Table This MIM parameter contains the realm routing table of the Diameter Stack agent. Realm Routing Table is of the map<string,map<string, list<string>>> type and is defined as a global MIM context type. The string values in the outer map contain the realm names (primary key). The string values of the inner map contain the applications (secondary key). The lists in the map contain the hostnames of the peers in the realm. Note! This MIM value only contains realms that have static peers, i e not dynamically discovered via DNS lookups. For an example of how to use this MIM value, see the section, To Read the Realm Routing Table in APL, in Diameter Routing Profile . Records in decoder queue This MIM parameter contains the current number of records in the queue for decoding. Records in decoder queue is of the long type and is defined as a global MIM context type. Rejected Messages This MIM parameter contains the number of rejected messages. Rejected Messages is of the long type and is defined as a global MIM context type. Workflow Round Trip Latency Avg This MIM parameter contains the average workflow processing latency, calculated (in milliseconds) over the last 1000 processed records. Workflow Round Trip Latency Avg is of the long type and is defined as a global MIM context type. Workflow Round Trip Latency Max This MIM parameter contains the minimum workflow processing latency, since Workflow start. Workflow Round Trip Latency Max is of the long type and is defined as a global MIM context type. Workflow Round Trip Latency Min This MIM parameter contains the maximum workflow processing latency, since Workflow start. Workflow Round Trip Latency Min is of the long type and is defined as a global MIM context type. Accesses The agent does not access any MIM parameters.",
    "title": "Diameter Stack Agent Input/Output Data and MIM - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352141581",
    "word_count": 1334,
    "char_count": 7882
  }
]