[
  {
    "chunk_id": 1,
    "text": "Data Masking Fields allows users create a data masking rule to prevent the data of certain fields from being seen by other users when they search for the Data Veracity UDRs on the web interface. Fields that have been masked will display data in asterisk form rather than the original data itself. Unsupported Data Type for Search Searching, filtering, repairing and masking of UDRs with list and map data types are currently not supported by Data Veracity. The Data Masking Fields web interface is where data masking rules could be viewed or removed. Open Data Veracity - Data Masking Fields Data Masking Fields Sort Order Sorting by UDR column is based on Javas default sorting behavior for Strings(for example, sorting of alphabetical characters in Java is case sensitive). The example below shows the three fields, myStringField, subUDR.sub_date1 and subUDR.sub_long1 that have been masked for the UDR. Open Masked Fields in Search Query Results Note! Only users with write access to Data Veracity will be able to manage the Data Masking Fields rules and be able to view the masked data. Adding New Data Masking Rules In the Data Veracity  Data Masking Fields page, click the New button on the right. You will be prompted to select the UDR Typ e and Masked Fields . Open Data Veracity - Masked Fields Fields Description Fields Description UDR Type Allows you to choose from a list of UDRs that are configured in your Data Veracity profile. From the example below, we have multiple UDR Types, namely MainUDR, anotherUDR, MySubUDR and SecondNested. Open Data Veracity - Selecting UDR Types Masked Fields Upon selecting a UDR Type , the Masked Fields will be populated with all the UDR fields that are in the UDR type . You can choose to add a single field, multiple fields or even all the fields available in the UDR by clicking from the dropdown list. You will also be able to select the fields within any nested UDRs that are available in the chosen UDR Type . Note! When selecting fields for one UDR Type , the masking will only apply to the field within that selected UDR Type . When performing a Data Veracity Search using MainUDR , you will find the fields to be properly masked. However, if you search using the subUDR , the fields will not be masked. To mask the fields in subUDR, you are required to create a Data Mask entry by selecting the subUDR as the UDR Type. Primitive List / Map are not supported for masking, ie list of String. Once you have added all required fields for data masking, click on the Save button. An entry will appear on the Mask Field(s) dashboard. Note! Only one Data Masking rule can be created per UDR type at any one time. Editing a Data Masking Rule Data masking rules can be edited when there are new fields to be added into the Masked Fields list. To edit a data masking rule, you can select one entry and then click on the Edit button. You will be prompted with the pop-up where you can add more masked fields or remove already masked fields from the entry. Open Data Veracity - Editing Masked Fields Click Save , to update the selected entry. Deleting a Data Masking Rule Data masking rules can only be deleted from the Data Masking Fields web interface. Deleting a Data masking rule here will remove masking rule from Data Veracity. To delete a rule, you can select one or many rules at once and then click on the Delete button on the top right corner of the table. Open Data Veracity - Data Masking Rule Deletion Upon deletion, you will be prompted with a message asking if you would want to delete the selected rules. If you click Delete , the selected rules will be deleted. Open Data Veracity - Data Masking Rule Deletion confirmation dialog",
    "title": "Data Masking Fields - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352109497/Data+Masking+Fields",
    "word_count": 656,
    "char_count": 3690
  }
]