[
  {
    "chunk_id": 1,
    "text": "This section will refer to the Reference Data Management dashboard found on the Desktop and all relevant materials and functions associated with the dashboard. The Reference Data Management dashboard will allow you to do the following: Query the results from a table based on the Reference Data Management profiles in the system Filter certain results by using expressions in your query Insert new rows in your table Edit existing fields in your query results Import data from a CSV file Export the entire table or queried result into a CSV file You can access the dashboard from the Manage View. Go to Manage  Data Management and then select Reference Data Management . Note! Temporary files are created on the Platform host when the user executes queries via Reference Data Management. These temporary files, stored in $MZ_HOME/tmp/rowset , are removed automatically when the user session expires. Users sessions expire automatically after six (6) hours. For Oracle Database Users! For Oracle database, the CLOB datatype is not supported by the Reference Data Management. You will be unable to view the contents of a CLOB datatype. When you click on the Reference Data Management button a page will appear that looks like this. Open Initial Reference Data Management Dashboard page Click on Get Started to begin querying. See Reference Data Management Dashboard | Query Result View for more information. Furthermore, you can use these links to navigate to the information you need when working with the dashboard: Querying A Table In Reference Data Management Manipulating The Data In Reference Data Management Importing Or Exporting Data In Reference Data Management Query Result View Once you have gotten a query result, the status bar above the toolbar will display query configuration information. The status bar summary will contain selected Reference Data Profile and Table, and if Last Update feature is enabled, the most recent Last Update user and datetime. Click on the status bar to reveal the list of query expressions applied for the query result. Subject to user permission settings that is configured via the Reference Data Profile and Access Controller, appropriate table toolbar buttons will be enabled above the query result view. This bar allows you to select from the operations that you will want to use Reference Data Management for, such as Query , searching for specific data in the columns, Insert Row , Refresh , Export , Import and Delete . At the bottom of the view, you get the Previous Data Set and Next Data Set buttons at the footer bar to switch between data sets. The footer also displays data set information and the total of rows for the entire query result. The data set buttons and information are only available if the query result total rows exceeds the Data Set Size (configurable in the Query dialog). Open Sample query result in the query result view Status Bar Status Description Status Description Current Profile Reference Data Profile selected in the Query dialog. Current Table Table selected in the Query dialog. Last Update User If Last Update feature is enabled for this table in the Reference Data Profile, the name of the most recent user to perform an operation on a record is displayed. Last Update Datetime If Last Update feature is enabled for this table in the Reference Data Profile, the most recent datetime an operation is performed on a record is displayed. Query Expressions Click on the status bar to reveal the list of query expressions configured in Query dialog if any. Table Toolbar Options Option Description Option Description Query Opens the Query dialog, allowing you to tweak with the expressions or query configurations. See Querying A Table In Reference Data Management for more information. Search Bar Filter the current data set to display rows that have any column values that is matching the search bar input. The matched row count is displayed on the right within the search bar. Insert Row Opens the Insert Row dialog for you to add more rows of data into your table. See Manipulating The Data In Reference Data Management | Inserting rows for more information. Note! This is only applicable to Standard Search Type . Refresh Triggers a query from the Database with the current query configurations and refreshes the query result view with the retrieved updates if any. Note! This is only applicable to Join Table Search Type . Export Exports the query result view or the entire table into a file. See Importing Or Exporting Data In Reference Data Management | Exporting Data for more information. Note! This is only applicable to both Search and Join Table Search Type . Import Imports bulk data from a file into the table. See Importing Or Exporting Data In Reference Data Management | Importing Data for more information. Note! This is only applicable to Standard Search Type . Delete Marks all rows in the data set for deletion. See Manipulating The Data In Reference Data Management | Removing rows for more information. Note! This is only applicable to Standard Search Type . Footer Bar Option Description Option Description Previous Data Set Switches to the previous data set of the query result. Next Data Set Switches to the next data set of the query result. Data Set Information Shows the current data set number, the data set count and the value of Data Set Size configured in Query dialog. Total Row Count Shows the number of rows that are in the query result. Note! When switching between data sets, any uncommitted changes will be discarded.",
    "title": "Reference Data Management Dashboard - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352118166/Reference+Data+Management+Dashboard",
    "word_count": 922,
    "char_count": 5539
  }
]