[
  {
    "chunk_id": 1,
    "text": "The Approve Delete allows users with write access to Data Veracity and Data Veracity Approve Delete applications to approve or reject the deletion of Data Veracity records with the PRE_DELETE state. For more information on User Privileges Management, please refer to User Privileges Management . Open Data Veracity - Approve Delete Viewing PRE_DELETE Data Veracity Records To view PRE_DELETE records, follow the steps below: You must first select a Data Veracity profile. Click the Filter button to open the Filter dialog. Click Browse to select the Data Veracity profile. The UDRs will be grouped according to their UDR types and Data Veracity Profiles while the batch files will be grouped according to the Data Veracity Profiles they are assigned to. Click on Review at the Actions column for a UDR or batch group that you wish to review. At the review page, all records marked for PRE_DELETE will be listed in the table. Example Query Results of PRE_DELETE UDRs Review Sort Order Sorting is done from the Data Veracity Database via SQL query statement and so the sorting behavior will depend on the behavior of the Data Veracity Database(for example, sorting of alphabetical characters in Oracle and SAP HANA is case sensitive, whereas in PostgreSQL it is case insensitive). You may select display fields you would like to view in the table. Meta data fields are selected by default. The table will be updated as fields are removed or added. Display Field selection dialog box View UDR is only applicable and visible when record type is UDR. Click on View UDR at the Actions column to inspect a UDR and view the field and values present in the UDR. Example - Viewing a UDR Approving PRE_DELETE Data Veracity Records When the Data Veracity records have been viewed, inspected and the decision is made to delete the records, you can then approve the deletion of the records. To approve the records for deletion, you can: click on Approve at the Actions column to approve a single record for deletion. select the records you will want to approve for deletion then click on Approve button in the result table menu bar. click on Approve button in the result table menu bar when all of the records are deselected if you wish to approve for deletion all the records in the result table. Click OK when prompted to confirm the approval. This will change the state on the selected records to DELETE_APPROVED. Example - Approving UDRs for Deletion Rejecting PRE_DELETE Data Veracity Records You can also reject the deletion of a Data Veracity record, especially if there are still any issues with the record. Rejecting the deletion of records will cause the state of the records to be changed back to NEW, ready to be reprocessed by the Data Veracity Collection Agent once more. To reject the records for deletion, you can: click on Reject at the Actions column to reject a single record for deletion. select the records you will want to reject for deletion then click on Reject button in the result table menu bar. click on Reject button in the result table menu bar when all of the records are deselected if you wish to reject for deletion all the records in the result table. Click OK when prompted to confirm the rejection. This will change the state on the selected UDRs to NEW, ready to be reprocessed by the Data Veracity Collection agent again. Example - Rejecting UDRs for Deletion Export Data Veracity Records Data Veracity allows you to export all Data Veracity records in the table into a zipped file. Click the Export button in the result table menu bar. In the Export search result dialog, enter the following: Filename - The export filename should contains alphanumeric- or dash (-) characters. Do not add a file extension or a path. Delimiter - You can enter a character or string that should represent the separator token, e.g. a comma or a semi-colon. Open Export search result dialog Select the check box Include Header to add the column names to first row in the file. Click the OK button. A dialog box containing a link to download the zipped file will be displayed. All the columns of the table that is specified in Display Field will be included in the file.",
    "title": "Approve Delete - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352141241/Approve+Delete",
    "word_count": 721,
    "char_count": 4174
  }
]