[
  {
    "chunk_id": 1,
    "text": "To create a KPI profile and service model using the Model Builder, click on the New Configuration button in the Configuration view and select KPI Profile . Open KPI Management profile configuration Follow these instructions to define your service model: Dimension Click on the arrow sign before Dimension to expand this section. Open Dimension definitions Click on Add to open the Add Dimension screen. Open Add Dimension dialog Click on the Add button to open the Add UDR Data screen. Open Add UDR Data dialog Enter the name of the UDR type to be processed in the UDR Type Name field and the name of the mapping field within the UDR in the UDR Mapping Fields , and click OK . Repeat the previous two steps for all the UDR types and mapping fields you want to have in your Dimension. When you are finished, click OK to close the Add Dimension screen and save your dimensions. Create all the dimensions you want to have in the same way. Trees Click on the arrow sign before Tree to expand this section. Open Service model tree Click on the Add Root button to create the root element(s) you want to have. Click on the Add Leaf button to create the tree structure(s) you want to have. Repeat for all the trees you want to define Metrics Click on the arrow sign before Metric to expand this section. Open Metric definitions Click on the Add button to open the Add Metric screen. Open Add Metric dialog Enter a name for the metric in the Metric Name field, and select a function in the Function drop-down list. Click on the Add button to open the Add Expression screen. Open Add Expression dialog Select the UDR type in the Dimension type name enter your expression in the Expression field, and click OK . See 2.3.3 metric for information on how to write an expression. Repeat the previous two steps for all the expressions you want to add, and then click OK to save and close the Add Metric screen. Repeat this procedure for all the metrics you want to add. Thresholds - Options If you want to create thresholds, click on the arrow sign before Threshold to expand this section, otherwise, skip to the KPI section. Open Threshold definitions Click on the Add button to open the Add Threshold screen. Open Add Threshold dialog Enter a name for the threshold in the Name field, and select the Order Descending checkbox if you want the thresholds to be evaluated in descending order. Click on the Add button to open the Add Threshold Level Data screen. Open Add Threshold Level Data Enter a name for the level in the Level Name field, a description in the Alarm Description field, and the value in the Value field, and click OK . Repeat the previous two steps to add all the levels for your threshold, click OK to save your Threshold, and close the Add Threshold screen. Repeat steps 2-5 for all thresholds you want to add. KPIs Click on the arrow sign before KPI to expand this section. Open KPI definitions Click on the Add button to open the Add KPI dialog. Open Add KPI Enter a name for the KPI in the Name field, select the node path, i.e. the path through your defined trees, in the Node Path drop-down-list, and select the Immediate Alarm checkbox if you want an alarm to be generated at the first occurrence. Select the Use KPI expression checkbox if you want to enter a KPI expression that is not already defined by a metric. The field below will then change name to KPI Expression and you can enter your expression. See 2.3.3 metric for information on how to write an expression. Leave the Use KPI expression checkbox unselected if you want to use a defined metric and select the metric you want to use in the Metric field. Select an optional threshold in the Threshold drop-down list, enter a time interval in seconds in the Window Size field, and click OK to save your KPI. Repeat the procedure for all the KPIs that you want to add. If you have selected the Aggregated Output option in the profile, the window size has to be the same for all KPIs, and you will enter this at the top of the profile next to the Aggregated Output check box. Finish Click on the Validate button in the profile to check that your configuration is valid. Click on the Save button, select a folder, and enter a name to save your profile. The KPI profile is now ready for deployment Hint! If you want to enter the service model in JSON format, click on the Model view and either enter your JSON format directly or paste it in if you have it saved elsewhere. The format should be entered as described in Object Types . For a complete example, see Service Model Definition .",
    "title": "Creating a Profile and Service Model Using the Model Builder - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352117212/Creating+a+Profile+and+Service+Model+Using+the+Model+Builder",
    "word_count": 831,
    "char_count": 4553
  }
]