[
  {
    "chunk_id": 1,
    "text": "When a Workflow Bridge Agent (Forwarder or Collector) attempts to send a UDR over the bridge but fails, an ErrorCycleUDR is automatically generated. Instead of being sent across the bridge, the ErrorCycle UDR is routed back within the originating workflow for error handling. You can design your workflow to attempt to send the ErrorCycle UDR when an error occurs in the collection workflow. In a forwarding workflow: The Workflow Bridge Forwarding Agent creates the ErrorCycleUDR when it cannot deliver a UDR. The ErrorCycleUDR is not sent to the collection agent but is instead received by the downstream agent in the same producer workflow (after the Forwarding Agent). The Forwarding Agent can receive an ErrorCycle UDR from the collection workflow, but you must design the collector workflow to do so. In a collection workflow: The Workflow Bridge Collection Agent creates the ErrorCycleUDR when it cannot deliver a UDR. The ErrorCyclenUDR is not automatically sent to the Forwarding Agent but is instead received by the downstream agent in the same collection workflow (after the collection agent). The collection workflow can be designed to route an ErrorCycle UDR back to the Workflow Bridge Collection Agent, attempting to resend it over the bridge to the Forwarding Agent The ErrorCycleUDR contains: Setting Description Setting Description OriginalUDR (WorkflowBridgeUDR) Contains the original UDR that failed to be sent. AgentId Identifies the agent involved in the failure. To process the ErrorCycle UDR, you need to configure an Analysis Agent after the Workflow Bridge Forwarding Agent. There are two common ways to handle it: Retry Logic : Extract the OriginalUDR and attempt to resend it. Error Logging & Alerts : Log the error or trigger an event. Example - Workflow Structure with Error Cycle UDR Producer Workflow (Forwarding Workflow) Collector  Decoder  Analysis1  WorkflowBridge Forwarder  Analysis2 Analysis1 : Prepares data before sending it via Workflow Bridge. WFB (Forwarding Agent) : Attempts to send UDRs to the Collection Agent. Analysis2 : Receives ErrorCycleUDRs and handles failures. Consumer Workflow (Collection Workflow) WorkflowBridge Collector <---> Analysis",
    "title": "ErrorCycleUDR - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352147088/ErrorCycleUDR",
    "word_count": 333,
    "char_count": 2196
  }
]