[
  {
    "chunk_id": 1,
    "text": "The SNMP Collection profile allows you to import the MIB files you want to use to build your target UDRs. It also allows you to specify the set of default SNMP parameters that will be used by the SNMP Request agent and the SNMP Trap agent. Note that one profile is usually for one family of network equipment. In case you have several network equipment families you must create one profile for each. Configuration The SNMP Collection profile contains the following tabs: 1 MIB Workspace Tab 2 Default SNMP Parameters Tab 3 Advanced Tab MIB Workspace Tab In the MIB Workspace tab, you load the MIB files to be used by SNMP collection agents in the MIB Workspace section. You can verify that the target network element responds to SNMP requests directly from the MIB Workspace. Use the SNMP Query Results section to send out SNMP requests including SNMP GET, GET-NEXT, GET-BULK, GET-WALK, and SET. Open Setting Description Setting Description MIB Workspace Load Select the MIB files you want to load and use to build the target UDR. These types of files are often defined with the extension .mib by the vendors, but there is no naming convention and it can be anything. Note! For any MIB files with dependencies, you are required to upload these files manually through the Load button feature. This is not the case if you are using the legacy desktop as all MIB files are loaded automatically by default. Unload Select the MIB file you want to unload and click this button. Unload All Click this button to unload all MIB modules. Expand All Click this button to expand all MIB tree branches. MIB Object Properties This panel shows the properties of the selected MIB file. SNMP Query Results OID Object Identifier of the currently selected MIB Object. This OID is used to send out SNMP requests to remote network element for testing purposes. VALUE The Value field is used to specify the value of the SNMP SET operation, which you can edit. The value must follow the syntax and semantics of the selected MIB Object. This field is also used to populate the result of the SNMP Get command, which is grayed out and cannot be edited. SNMP GET Performs SNMP GET operations on the selected MIB object. SNMP GET-NEXT Performs SNMP GET-NEXT operations on the selected MIB object. SNMP GET-BULK Performs SNMP GET-BULK operations on the selected MIB object. SNMP WALK Walks the selected MIB tree branch and retrieves all values. SNMP SET Performs SNMP SET operations on the selected MIB object. Specify the value to be set in the Value field. STOP Stops the current SNMP operation. CLEAR Clears the SNMP results area. Default SNMP Parameters Tab The SNMP Request agent uses the CSV files as information source to poll network elements. The parameter from the default set is used when the corresponding parameter is unspecified in the input CSV file. This is valid for all parameters except two in the profile: Polling interval Trap port Open Setting Description Setting Description General Host Define the host used to perform SNMP queries for testing purposes directly from the MIB workspace tab. This value is optional since the hosts should be defined in the CSV file of the SNMP Request agent. Polling Interval (ms) The default polling interval for SNMP is 300 seconds. This value is used if no other value is defined in the CSV file of the SNMP Request agent. The value must always be set here, it can not be set in the input CSV file. Polling Distribution Period (ms) This field is used to configure how long the distribution period should be in milliseconds (ms). By default this field is set to zero (\"0\"), meaning that no distribution period is configured, and polling will be distributed evenly over the polling interval. If you configure the distribution period, the polling will be distributed within this period only during the polling interval, meaning the distribution period has to be equal to, or shorter than, the polling interval. The distribution period will start at the beginning of the polling interval. Port Default port for SNMP is 161. If no other value is defined in the CSV file of the SNMP Request agent this value is used. Trap Port Default trap port for SNMP trap is 162. This value is used by the SNMP Trap agent to listen for incoming SNMP notifications (TRAPs and INFORMs). This value must always be set here. SNMP Version SNMPv1 Use read and write communities to access the network element via SNMPv1. Note! If there is no other value defined in the CSV file of the SNMP Request agent, this value or the SNMPv2c and SNMPv3 value is used based on the selected option. SNMPv2c Use read and write communities to access the network element via SNMPv2c. For more information about the SNMPv2c, see SNMP_Wiki . Read Community The SNMP community string is like a user ID or password that allows access to a target network element. The read community is used for GET, GET-NEXT, and GET-BULK requests. Write Community The SNMP community string is like a user ID or password that allows access to a target network element. The Write community is used for SET requests. SNMPv3 Use the same parameters and authentication as defined in the network element. For more information about the SNMPv3, see SNMP_Wiki . Note! The parameters \"Retry\" and \"Timeout\" are not used as expected. This is due to an error in the underlying library used. \"Retry\" is used during the discovery call, as well as the actual call, when it should only be used during the actual call. \"Timeout\" is not only used during actual timeouts, but between any \"Retry\" attempts. User Name The principal on whose behalf access is requested. This must be a human-readable string representing the user in a format that is Security Model independent. Context Name The collection of management information accessible by an SNMP entity. Context Engine ID An SNMP engine provides services for sending and receiving messages, authenticating and encrypting messages, and controlling access to managed objects. There is a one-to-one association between an SNMP engine and the SNMP entity which contains it. Within an administrative domain, an EngineID is the unique and unambiguous identifier of an SNMP engine. Context Name - the name of an SNMP Context. Auth Protocol The authentication protocol that is used to authenticate the user. Four protocols are defined: SHA-2 224, SHA-2 256, SHA-2 384, and SHA-2 512. Auth Password The password required for authentication service. Priv Protocol The privacy protocol that is used to protect the message from disclosure. Two such protocols are defined: DES-CBC Symmetric Encryption Protocol and CFB-AES-128. Priv Password The password required for privacy (encryption) service. Request Handling Timeout (ms) The timeout is the time interval that the SNMP Request agent waits for a response message from the target network element. The timeout value is given in milliseconds. Note! This timeout must be set so that the following is true: \"Polling Interval > Timeout * (Number of Retries +1)\". This is checked when validating the SNMP profile. However, take care when using the CSV_TIMEOUT and CSV_RETRIES in the Network Element file. UDR Timeout (ms) UDR Timeout in milliseconds. If the time exceeds the timeout, the UDR will be sent on the next route. Note! This UDR timeout must be set so that the following is true: \"UDR timeout > Timeout * (Number of Retries +1)\". This is checked when validating the SNMP profile. Number of Retries Retries are the number of times a SNMP request is sent when a timeout occurs. If the retry value is zero (0), the request is not re-transmitted during timeout. Max Outstanding Per Element The maximum number of simultaneous outstanding requests per element allowed. When this limit is reached, no new requests are sent to the element until responses for the outstanding requests are received. The default value is set to zero (0), which means that no limit is set and any number of simultaneous outstanding requests is allowed. Advanced Tab The following fields are available in the SNMP Profile Advanced tab. Open Setting Description Setting Description General Max PDU Size The maximum size of request PDUs that this target is able to receive. The response PDU has to fit in a single UDP packet. The maximum limit is 65535 bytes. Get-Bulk Parameters Non Repeaters Number of variables in the variable list for which a simple GETNEXT operation has to be done. Max Repetitions Number of continuous GETNEXT operations. Scalar Value Retrieval Max Variables Per PDU The maximum number of variable bindings per request. Table Retrieval Max Columns Per PDU Maximum number of columns to retrieve per SNMP GETNEXT or GETBULK request. Max Rows Per PDU Maximum number of rows to retrieve per SNMP GETBULK request. Send Table Requests in Separate PDUs By default all column OIDs from a single table are now sent in one GETBULK request in accordance with the Max Variables Per PDU. Use this if All column OIDs from a single table are to be sent in separate GETBULK requests.",
    "title": "SNMP Collection Profile - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352081305",
    "word_count": 1521,
    "char_count": 9006
  }
]