[
  {
    "chunk_id": 1,
    "text": "The Groups tab in the Access Controller Desktop Online dashboard will allow you to create new access groups, update existing access groups and remove an access group. These actions will require a user to have Write permission for Access Controller. Users with the Execute permission can only view the access groups. Groups Table A list of access groups will be displayed in the Groups Table when clicking into the Groups tab. Administrator is a predefined access group. By default, this group has full access to all the activities and functions in the system and it cannot be deleted. You are only permitted to change the Access Controller permissions for the Administrator group. Open Groups table with 3 defined groups. Add Group To add a new group to the system: Click New Group button . Fill in the details according to the description below and click Save button. Setting Description Setting Description Name Enter the name of the group. Valid characters are: A-Z, a-z, 0-9, '-', '.' and '_' Description Descriptive information about the group. Allow Access Through SCIM Check to enable access through SCIM API. Refer SCIM Application This column is a list of all the applications in the system. Execute Check to enable the members of the access group to start an instance of the relevant application or view the data. Clear to prohibit the access group members from using it. Write Check to enable the members of the access group to edit and save a configuration within the relevant application. Note! When access group A is granted Write access to an application, if any of the configuration related to the application has their permission set to access group B, members of access group A that are not members of access group B will not have any permission to work on the configuration. For more information on how to set access groups in your configuration, refer to the Permission Tab under Build View . Checking Write for Data Management and Tools & Monitoring features will allow members of the access group to manipulate the data contained within. Clear to prohibit the user from doing so. Application Category A drop down menu that allows the user to filter on application type. Options are ALL, CONFIGURATION, INSPECTOR, TOOL, WEB, WEB_API. Select All Enables Write (if applicable) and Execute for all permissions in the chosen category. Deselect All Disables Write and Execute for all permissions in the chosen category. For information about how to modify configuration permissions, see Build View . Note! For LDAP users to be able to login, you will have to create an Access Group with the same name as the LDAP Group name that is tied to the LDAP user. Open Access Controller - Add New Access Group screen Edit Group To add edit a group in the system: Click Edit button on the selected Group . Make changes and click Save button. Info! Group Name cannot be changed. Open Access Controller - Edit Access Group screen Delete Group To add edit a group in the system: Click Delete button on the selected Group . Click Delete button on the confirmation message. Note! The Administrator Group is not allowed to be deleted. Open Access Controller - Delete Access Group confirmation message",
    "title": "Groups Tab - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352138413/Groups+Tab",
    "word_count": 543,
    "char_count": 3200
  }
]