[
  {
    "chunk_id": 1,
    "text": "The NumberField UDR is used to create a input field that only accept numbers. To create a number field that only accept numbers of 0.5 between 0.0 and 100.0. NumberField num = udrCreate(NumberField); num.label = \"Only x.5 or x.0 number is accepted\"; num.step = 0.5d; num.min = 0.0d; num.max = 100.0d; The following fields are included in the NumberField UDR : Field Description attributes (map<string,string>) This field may contain extra attributes to be added. cssClasses (list<string>) This field may contain a list of extra values added to class attribute. This is typically used to style the component. Please read more on Bootstrap . disabled (boolean) This field may contain a boolean if the component should be disabled or enabled. id (string) This field may contain the id of the component label (string) This field may contain the label for the number field. labelCssClasses (list<string>) This field may contain a list of extra values added to class attribute of the label. This is typically used to style the component. Please read more on Bootstrap . max (double) This field may contain a max value. Need to use data type double , set trailing d. min (double) This field may contain a min value. Need to use data type double , set trailing d. name (string) This field may contain the name of the component. If the component is present in a Form UDR , the name will be submitted with the form as the key in the Params Map in Request UDR . placeholder (string) This field may contain a placeholder can be used as a help text. readonly (boolean) This field may contain a boolean if the field is readonly. required (boolean) This field may contain a boolean if the component is required. Typically used inside a Form UDR. step (double) This field may contain a value to specifies the legal number intervals Need to use data type double , set trailing d. value (double) This field may contain a value. Need to use data type double , set trailing d.",
    "title": "NumberField UDR - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352146480/NumberField+UDR",
    "word_count": 341,
    "char_count": 1956
  }
]