[
  {
    "chunk_id": 1,
    "text": "When you are using an Oracle database, set the following properties in install.xml : Property Description Property Description install.ora.owner Default value: mzowner This property specifies the Oracle username of the database owner. The user owns all the data definitions in the Oracle instance to be created. Note! The installation fails if the same username is configured for both the database owner, install.ora.owner , and the mz.jdbc.user . If it is necessary to have the same username for both users, then the oracle_user.sql file must be manually updated before creation of the database. install.ora.password Default value: mz This property specifies the password of the database owner, defined with the install.ora.owner variable described above. install.ora.host Default value: localhost This property specifies IP address or hostname for the database instance. install.ora.size Default value: small This property specifies the size of the Oracle database instance. Possible values are small, medium, or large. small is aimed for test and demo installations. medium is aimed for small and medium sized corporates. large is aimed for large operators. Table Space Small (MB) Medium (MB) Large (MB) System 250 250 500 Rollback 125 400 1000 Database Tables 200 600 1200 Database Table Indexes 100 250 500 Temporary Data 80 200 400 Log 60 120 400 Sysaux 100 200 300 Total: 915 2020 4300 install.ora.port Default value: 1521 This property specifies the Oracle database port. install.ora.home Default value: /opt/oracle Example value: /opt/oracle/product/12.1.0 This property specifies the Oracle home directory. This value must be identical to the value assigned to the environment variable ORACLE_HOME previously described. install.ora.sid Default value: MZ This property specifies the Oracle SID for the instance to be created. The value must be identical to value assigned to the environment variable ORACLE_SID previously described. install.ora.data Default value: ${install.ora.home}/oradata This property specifies a directory path to be used in other Oracle directory definitions. The variable is used for convenience, when the same directory path is repeated for any of the following definitions. install.ora.data.tab Default value: ${install.ora.data} Example value: ${install.ora.data}/tables This property specifies the directory where the Oracle table space data files are to be created. install.ora.data.idx Default value: ${install.ora.data} Example value: ${install.ora.data}/indexes This property specifies the directory where the Oracle index data files are to be created. install.ora.data.temp Default value: ${install.ora.data} Example value: ${install.ora.data}/temp This property specifies the directory where the Oracle temporary table space data files are to be created. install.ora.data.log Default value: ${install.ora.data} Example value: ${install.ora.data}/logfiles This property specifies the directory where the Oracle log files are to be created. install.ora.data.roll Default value: ${install.ora.data} Example value: ${install.ora.data}/rollback This property specifies the directory where the Oracle rollback data files are to be created. install.ora.data.ctrl Default value: ${install.ora.data} Example value: ${install.ora.data}/control This property specifies the directory where the Oracle control data files are to be created. install.ora.tb.space.tab Default value: ts_mz_tab This property specifies the name of the tablespace to use to create the table in. install.ora.tb.space.idx Default value: ts_mz_idx This property specifies the name of the tablespace to use for the index. If new directories are specified for the Oracle data, these directories must be created by the Oracle user.",
    "title": "Properties for Oracle - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352136676",
    "word_count": 512,
    "char_count": 3733
  }
]