[
  {
    "chunk_id": 1,
    "text": "Configuring an Alarm Detection Create an Alarm Detection configuration by clicking the New Configuration button in the upper left part of the Desktop window, and then selecting Alarm Detection from the menu. Open Alarm Detection configuration dialog Select the Workflow Alarm Value Names option to define a variable you can use in the APL code, see the APL Reference Guide . Field/Option Description Field/Option Description Alarm Detection Enabled Select this checkbox to turn on alarm detection. Description Enter a statement that describes the Alarm Detection that you are defining. Severity Select the importance priority of the alarm from the drop-down list. The available severities are: Indeterminate Warning Minor Major Critical Adding an Alarm Condition At the bottom of the Alarm Detection configuration, click the Add button. The Add Alarm Condition dialog box opens. Open Alarm Condition configuration dialog Select a condition in the Alarm Condition drop-down list. Alarm Conditions The Alarm conditions enable you to define specific situations or events for which you want the system to produce an alarm. You configure a condition to produce an alarm whenever a certain behavior occurs, within specific limits. Note! An alarm is generated only if all conditions in the Alarm Detection are met. The Alarm condition limits are reset: Every time you restart the platform Every time you save the alarm configuration When you resolve the alarm The Alarm Conditions that you can choose from are: 1 Host Statistic Value 2 Pico Instance Statistic Value 3 System Event 4 Workflow Alarm Value 5 Workflow Execution Time 6 Workflow Group Execution Time 7 Workflow Throughput Host Statistic Value The Host Statistic Value condition enables you to set up an Alarm Detection for the various statistic values by the host. Open Setting Host Statistic Value conditions Item Description Item Description Event Properties Host Select a host for applying the alarm condition. Statistic Value The statistical criteria on the host include: Processes Waiting For Run (#) Processes in Sleep (#) Processes Swapped Out (#) Swapped In From Disk (blocks/s) Swapped To Disk (blocks/s) Context Switches (/s) CPU User Time (%) CPU System Time (%) Limits Specify the condition for the alarm to be triggered. The options are Exceeds or Falls Below the selected statistic value. Enable the During Last checkbox to further focus on the X duration of Minutes/ Hour. Pico Instance Statistic Value The Pico Instance Statistic Value condition enables you to set up an Alarm Detection for the various statistic values by Pico instances. Open Adding Pico Instance Statistic Value Item Description Item Description Event Properties Pico Instance Select a Pico instance for configuring the alarm, it can be Platform, EC Statistic Value The statistical criteria on the Pico instance include: Used Memory (Kb) Garbage Collection Count (#) Garbage Collection Time (ms) Thread Count (#) Open files count (#) CPU usage time (%) Limits Specify the condition for the alarm to be triggered. The options are Exceeds or Falls Below the selected statistic value. Enable the \"During Last\" checkbox to further focus on the X duration of Minutes/ Hour. System Event The System Event condition enables you to setup an Alarm Detection for the various Event types. Open Setting up System Event condition Item Description Item Description Event Properties Type Select an event-related reason for an alarm to be invoked. For a detailed description of every event type, see Event Types . Filter Use this table to define a filter of criteria for the alarm messages that you are interested in. To define an entry, double-click on the row. The Edit Match Value dialog box opens. Click the Add button to add a value. Limits Specify the condition for the alarm to be triggered. The options are based on the number and frequency of occurrence of the event: Occurred Once , Occurred More Than , Occurred Less Than . In During Last , specify the time frame during which the Limits value should be compared. If a match is detected, an alarm is invoked. Caution! The parameters in the following example do not apply to any specific system and are only presented here to enhance understanding of the alarm condition. Example - Configuring a System Event condition Configure an Alarm Detection that applies the System Event condition. Open Configuring an Alarm Detection On the Edit Alarm Condition dialog box, from the Event Type drop-down list, select Workflow State Event . On the Filter table double-click workflowName ; the Edit Match Value dialog box opens. Click Add to browse and look for the specific workflow. Enter a limit of occurred more than 3 times during the last 24 hours. Open Editing an Alarm Condition The alarm will be triggered by every 4th occurrence of a \"Workflow State Event\" during the last 24 hours. Workflow Alarm Value The Workflow Alarm Value condition is a customizable alarm condition. It enables you to have the Alarm Detection watch over a variable that you create and assign through the APL code. To apply the Workflow Alarm Condition use the following guidelines: Create a variable. Assign the variable with a value. Setup the Workflow Alarm Value condition. To create a variable name: From the Edit menu in the Alarm Detection configuration menu, select Workflow Alarm Value Names . The Workflow Alarm Value dialog box opens. Click the Add button and enter a variable name, e g CountBillingFiles. Click OK and then close the Workflow Alarm Value dialog box. To define the Value field: In the APL code, include the command d ispatchAlarmValue . For example: consume { dispatchAlarmValue (\"CountBillingFiles\",1); udrRoute(input); } To configure the Workflow Alarm Value Condition: At the bottom of the Alarm Detection configuration, click Add ; the Add Alarm Condition dialog box opens. From the Alarm Condition drop-down list select Workflow Alarm Value . From the Value drop-down list, select the name of the variable that you created. Click Browse... to select the Workflow that the Alarm Detection should guard. Configure the Limits according to the description of The Workflow Alarm Value and click OK . Open The Workflow Alarm Value configuration Item Description Item Description Workflow Properties Value Select an alarm value from the drop-down list. Workflow Click Browse... to enter the workflow instance(s) that you want to apply the alarm to. Limits Summation : Select this check box to add up the dispatchAlarmValue variable (countBillingFiles in the figure above, The Workflow Alarm Value configuration) whenever it is invoked. Alarm Detector compares this total value with the alarm limit (exceeds or falls below), and generates an alarm message accordingly. Note: Selecting Summation means that the During Last entry refers to the time period during which a sum is added up. Once the set period has ended, that sum is compared with the limit value. For All Workflows : Select this check box to add up the values (see Summation above) of all the workflows that the alarm supervises. Alarm Detector compares this total value with the alarm limit (exceeds or falls below), and generates an alarm message accordingly. Note: This check box can only be selected when Workflow is set to Any. Workflow Execution Time The Workflow Execution Time condition enables you to generate an alarm whenever the execution time of a particular, or all workflows, exceed or fall below the time limit that you specify. Open Workflow Execution Time configuration Item Description Item Description Workflow The default workflow value is Any . Use this value when you want to apply the condition to all the Workflows. Otherwise, click Browse to select a Workflow that you apply the condition to. Caution! The parameters in the following example do not apply to any specific system and are only presented here to enhance understanding of the alarm condition. Example - Configuring a Workflow Execution Time condition A telecom provider wants the system to identify a workflow that has recently run out of input, and to generate an alarm that warns about a processing time that is too short. Configure an Alarm Detection to use the Workflow Execution Time condition. Open Using Workflow Execution Time condition in the Alarm Detection Click Browse ...; the Workflow Instance Selection dialog box opens. At the bottom of the dialog box click Any or select the workflow specific for this alarm. Set a limit to generate an alarm if the workflow execution time Falls below 2 seconds. Open Setting a limit to an Alarm Condition An alarm is generated whenever an active workflow seems to process data too fast (in less than 2 seconds). Workflow Group Execution Time The Workflow Group Execution Time alarm condition enables you to generate an alarm whenever the execution time of a workflow group exceeds or falls below the time limit that you specify. Open Workflow Group Execution Time configuration dialog Item Description Item Description Workflow Group Click Browse... to enter the address of the workflow group to which you want to apply the alarm. Caution! The parameters in the following example do not apply to any specific system and are only presented here to enhance understanding of the alarm condition. Example - Configuring a Workflow Group Execution Time condition You want the system to generate an alarm if a billing workflow group has been active longer than 3 hours. Configure an Alarm Detection that uses the Workflow Group Execution Time condition. Open Using Workflow Group Execution Time condition in an Alarm Detection On the Edit Alarm Condition dialog box click Browse... to enter the workflow group you want the alarm detection to supervise. Open Editing the Alarm Condition Enter a limit of Exceeds 3 hours. The alarm will be triggered if the workflow group has been active longer than 3 hours. Workflow Throughput The Workflow Throughput alarm condition enables you to create an alarm if the volume-per-time processing rate of a particular workflow exceeds, or falls below, the throughput limit that you specify. Open Workflow Throughput configuration dialog Item Description Item Description Workflow Select a workflow with the throughput value, and the processing speed, that you want to supervise. For further information about the throughput value calculation, see Throughput Calculation in 3.1.8 Workflow Properties . An alarm is generated if the throughput value is not within the condition limits. Limits Specify the condition for the alarm to be triggered. The options are Exceeds or Falls Below the selected statistic value. Enable \"During Last\" checkbox to further focus on the X duration of Minutes/ Hour. Caution! The parameters in the following example do not apply to any specific system and are only presented here to enhance understanding of the alarm condition. Example - Configuring a Workflow Throughput condition You want the system to warn you on detection of decreased processing rate. Configure an Alarm Detection to use the workflow throughput condition. Open Using Workflow Throughput conditions On the Edit Alarm Condition dialog box click Browse... to select the workflow with the processing rate that you want to supervise. Enter a limit of Falls Below 50000 (batches, UDRs, Bytearray). Open Configuring Limits when adding an Alarm Condition The alarm will be triggered by every occurrence of a workflow slowing down its processing rate to a throughput that is lower than 50000 units per second.",
    "title": "Alarm Detection Configuration - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352073761/Alarm+Detection+Configuration",
    "word_count": 1856,
    "char_count": 11511
  }
]