[
  {
    "chunk_id": 1,
    "text": "Profiles containing storage, naming scheme and lifetime for targeted files are configured in the Archive profile. You can configure several workflows to use the same profile, however only one of the workflows may be active at a time. The Archive profile is loaded when you start a workflow that depends on it. Changes to the profile become effective when you restart the workflow. Configuration To create a new Archive profile configuration, click the New Configuration button in the upper left part of the Desktop window, and then select Archive Profile from the me n u. Open Archive profile configuration dialog The contents of the menus in the menu bar may change depending on which configuration type that has been opened. The Archive profile uses the standard menu items and buttons that are visible for all configurations, and these are described in https://infozone.atlassian.net/wiki/x/RjD9F . The External References button is specific for Archive profile configurations. Button Description Button Description External References Select to Enable External References in an agent profile field. Refer to Enabling External References in an Agent Profile Field in External Reference Profile for further information. See also, Archive Profile | [inlineExtension] Enabling External Referencing below. The full path of each filename to store in the archive is completely dynamic via the Archive File Naming Algorithm. The name is determined by three parameters: AAA/BBB/CCC Where: Name placeholder Description Name placeholder Description AAA Represents one of the base directories specified in the Base Directory list in the Archive profile. If several base directories exist, this value will change according to the frequency selected from the Switch Policy list. The system automatically appends a directory delimiter after this name. BBB This part is constructed from the Directory Template . If the template contains one or several Directory delimiters this part will enclose one or several directory levels itself. For instance, if the template contains Month, Directory delimiter, Day this will yield new directories every day, named 03/01 , 03/02 ... 03/31 , 04/01 , 04/02 ... 04/30 and so on. In this example, files are stored in a directory structure containing all months, which in turn contains directories for all days (which in turn will contain all files from that day). The system automatically appends a directory delimiter after this name. CCC This is the name the file will get. It is defined on each archiving agent using configurations from the Filename Template tab in the Archiving agent configuration dialog. The Archive profile configuration contains the following settings: Setting Description Setting Description Switch Policy If several base directories are configured, the switch policy determines for how long the Archive services will populate each base directory before starting to populate the next one (daily, weekly, or monthly). After the last base directory has been populated, the archiving wraps to the first directory again. Base Directory One or several base directories that can be used for archiving of files. For considerable amounts of data to be archived, several base directories located on different disk partitions might be needed. Directory Template List of tokens that, in run-time, builds subdirectory names appended to one of the base directories. The tokens could be either special tokens or user defined values. Subdirectories on any level, can be constructed by using the special token Directory delimiter. See the section below, Directory Template. Remove Entries (days) If enabled, files older than the entered value will be deleted from the archive. Depending on the agent using the profile, the removal will occur differently. Note! The days that user can define will just be between 1 to 365 days only. Any days more than that will not be supported. For the Local Archiving agent the cleanup of outdated files is mastered by the workflow. It removes the file from its archive directory in the initialize block. Note! The files are removed recursively. For this reason, it is not recommended to use a base directory that is located within another Archive profiles base directory. Note! If you use the Local Archiving agent with the Inter Workflow collection agent, you can only enable a cleanup of outdated files by selecting the Deactivate on Idle check box in the Inter Workflow agent configuration dialog. For the Archiving agent the cleanup of outdated files is performed by the Archive Cleaner task. It removes the references, as well as the files themselves from its archive directory. Consequently, the data storage is also dependent on the setup of the task scheduling criteria. Keep Files Files will not be deleted. If Keep Files and Remove Entries (days) are combined, only references in the database are removed while the files remain on disk. ( not valid for the Local Archiving agent). Directory Template Open Add Directory Template dialog Setting Description Setting Description Special token Tokens to be used as part of the directory name. Year - Inserts four digits representing the year the file was archived. Month - Inserts two digits representing the month the file was archived. Day - Inserts two digits representing the day of the month the file was archived. Hour - Inserts two digits representing the hour (24) of the day the file was archived. Agent directory name - Inserts the MIM value(s) defined in the Agent Directory Name list in the Archiving agent configuration dialog. Day index - Inserts a day index between zero and the value entered in Remove Entries (days) field. This number is increased by one every day until Remove Entries (days) - 1 is reached. It then wraps back to zero. Day index may not be used in the template if Remove Entries (days) is disabled. Directory delimiter - Inserts the standard directory delimiter for the operating system it distributes files to. This way, a sub-directory is created. Text If enabled, the token is entered from the text field. When disabled, the token is instead selected from the Special token list. Enabling External Referencing Click the External References button to enable external referencing of profile fields. For detailed instructions, see External Reference Profile . When you apply external referencing to profile fields, the following profile parameters are affected: Setting Description Setting Description Base Directory The directory paths that you add to this list are included in the properties file that contains the External References. Example - Directory path myBaseDirectoryKey = /mypath/no1, /mypath/no2 Remove Entries (days) The value with which you set this entry is included in the properties file and interpreted as follows: myRemoveEntriesKey = 1 #! Remove after 1 day myRemoveEntriesKey = 365 #! Remove after 365 days myRemoveEntriesKey = -1 #! Do not remove. #! This value is equal to clearing the #! check-box. Keep Files In the properties file a checked entry is interpreted as true or yes , and a cleared entry as false or no .",
    "title": "Archive Profile - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352108768",
    "word_count": 1130,
    "char_count": 7103
  }
]