[
  {
    "chunk_id": 1,
    "text": "The Configuration Diff tool allows you to compare two configurations or versions of the same configuration type side by side. It highlights differences between the selected configurations. To access, go to Manage  Tools & Monitoring and click Configuration Diff . To get started, click Select Configurations in the Configuration Diff page. Open Configuration Diff Selecting the Configuration Type You can choose the following configuration types to view and compare: APL Code APL Collection Strategy Python Module Ultra Format Unit Test Open Configuration Diff - Select Configurations dialog Field Description Field Description Configuration Type APL Code Select this option to compare APL configurations. Selecting this option will display the APL Code and Target APL Code fields. APL Code Browse the source APL code that you want to compare against the target APL code. This serves as the reference for identifying differences. This field is mandatory. Target APL Code Browse the target APL code that you want to compare with the source APL code. This is the version to evaluate for any changes. This field is optional. If no target APL code is selected, the source APL code will compare with itself. APL Collection Strategy Select this option to compare APL collection strategy configurations. Selecting this option will display the APL Collection Strategy Code and Target APL Collection Strategy fields. APL Collection Strategy Browse the source APL collection strategy that you want to compare against the target APL strategy collection. This serves as the reference for identifying differences. This field is mandatory. Target APL Collection Strategy Browse the target APL collection strategy that you want to compare with the source APL collection strategy. This is the version to evaluate for any changes. This field is optional. If no target APL collection strategy is selected, the source APL collection strategy will compare with itself. Python Module Select this option to compare Python module configurations. Selecting this option will display the Python Module and Target Python Module fields. Python Module Browse the source Python module that you want to compare against the target Python module. This serves as the reference for identifying differences. This field is mandatory. Target Python Module Browse the target Python module that you want to compare with the source Python module. This is the version to evaluate for any changes. This field is optional. If no target Python module is selected, the source Python module will compare with itself. Ultra Format Select this option to compare configurations specifically for Ultra format. Selecting this option will display the Ultra Format and Target Ultra Format fields. Ultra Format Enter the original Ultra format that you want to compare against the target Ultra format. This serves as the reference for identifying differences. This field is mandatory. Target Ultra Format Enter the updated Ultra format that you want to compare with the original Ultra format This is the version to evaluate for any changes. This field is optional. If no target Ultra format is selected, the source Ultra format will compare with itself. Unit Test Select this option to compare Unit test configurations. Selecting this option will display the Unit Test and Target Unit Test fields. Unit Test Browse the source Unit test that you want to compare against the target Unit test. This serves as the reference for identifying differences. This field is mandatory. Target Unit Test Browse the target Unit test that you want to compare with the source Unit test. This is the version to evaluate for any changes. This field is optional. If no target Unit test is selected, the source Unit test will compare with itself. Viewing the Comparison Results Once you have selected the configuration type, two panes will be displayed. Open Configuration Diff - Comparing configurations You can navigate through the differences by scrolling both panes in parallel using the scroll bar on the right side of either pane. To scroll through each pane separately, hover over the pane that you want to scroll and use the scroll wheel on your mouse. Field Description Field Description History To select a different version of the same configuration, use the drop-down box to select the version you want to display. Open Configuration Diff - History drop-down You can also display and view encrypted configurations. If you select an encrypted configuration, you are prompted to enter the relevant password to decrypt the configuration. Left pane This pane displays the configuration selected for APL Code , APL Collection Strategy , Python Module , Ultra Format , or Unit Test . Differences in this pane are highlighted in green. Right pane This pane displays the configuration selected for Target APL Code , Target APL Collection Strategy , Target Python Module , Target Ultra Format, or Target Unit Test . Differences in this pane are highlighted in red. To quickly jump between differences, use the navigation buttons located at the top left of the screen. Button Description Button Description Select Configurations Click this to open the Select Configurations dialog. It allows you to browse for subsequent configurations to compare without returning to the main page. For more information, refer to Configuration Diff | Selecting the Configuration Type . Next Click this to move to the next difference. Previous Click this to return to the previous difference. Refresh Click this to display the latest version of the configuration. Configurations are not locked when viewed in Configuration Diff . If another user has modified and saved a configuration that you are currently viewing, clicking Refresh will allow you to see the most recent updates.",
    "title": "Configuration Diff - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352182495/Configuration+Diff",
    "word_count": 919,
    "char_count": 5789
  }
]