[
  {
    "chunk_id": 1,
    "text": "Use the Signature functions to generate digital signatures for data. The following functions for Signature described here are: 1 signPrepare 2 signData 3 signHmac 4 signHmacSHA256 5 signHmacSHA512 signPrepare This function is called to get a key from a Java keystore file. any signPrepare ( string file, string keystoreType, string password) Parameter Description Parameter Description file The file that contains the keystore dat keystoreType The keystore type e g . JKS, PKCS8, PKCS12 or CA_CERTIFICATES_PATH password The keystore password Returns A private key object signData This function calculates the hash value of a bytearray, using the specified algorithm, and signs the result. bytearray signData ( any key, bytearray data, string algorithm) Parameter Description Parameter Description key A private key object data The data to be signed algorithm The signature algorithm e g SHA1withDSA, SHA1withRSA or SHA256withRSA. Returns A bytearray containing the digital signature signHmac This function calculates the hash value of a key retrieved with the signPrepare function or a bytearray constituting a key, using the specified algorithm, and signs the result. bytearray signData ( any key, bytearray data, string algorithm) Parameter Description Parameter Description key A private key object data The data to be signed algorithm The signature algorithm e g Hmac-SHA256 or Hmac-SHA512. Returns A bytearray containing the digital signature signHmacSHA256 This function calculates the hash value of a key retrieved with the signPrepare function or a bytearray constituting a key, using Hmac-SHA256, and signs the result. bytearray signData ( any key, bytearray data) Parameter Description Parameter Description key A private key object data The data to be signed Returns A bytearray containing the digital signature signHmacSHA512 This function calculates the hash value of a key retrieved with the signPrepare function or a bytearray constituting a key, using Hmac-SHA512, and signs the result. bytearray signData ( any key, bytearray data) Parameter Description Parameter Description key A private key object data The data to be signed Returns A bytearray containing the digital signature",
    "title": "Signature Functions - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352118620/Signature+Functions",
    "word_count": 324,
    "char_count": 2197
  }
]