[
  {
    "chunk_id": 1,
    "text": "The Error tab is specifically for configuring error handling in batch workflows. It defines the actions to take when a batch workflow hits a cancelBatch behavior. For more information about the cancelBatch state, see Workflow Execution State . If  Abort after one cancel batch followed by <configured amount> consecutive cancel batches  or  Do not abort after cancel batch  is selected, the error batch can be forwarded to either ECS or Data Veracity by selecting the appropriate option in the Error Batch Type field. These settings apply only to batch workflows, as real-time workflows do not use batch processing. Open Setting Description Setting Description Abort after one cancel batch If enabled, the workflow immediately aborts on the first cancelBatch emitted from any agent in the workflow. The erroneous data batch is kept in its original place and must be moved or deleted manually before the workflow can be started again. Abort after one cancel batch followed by <configured amount> c onsecutive cancel batches If enabled, the value of <configured amount> indicates the number of allowed cancelBatch occurrence, from any agent in a workflow before the workflow is aborted. The counter is reset between each successfully processed data batch. Thus, if 5 is entered, the workflow aborts on the 6th data batch in a row that is reported erroneous. All erroneous files, but the first one, are removed from the stream and placed into Data Veracity or the ECS . Do not abort after cancel batch The workflow will never abort. However, as with the other error handling options, the System Log is always updated for each cancel batch message, and files are sent to Data Veracity or the ECS . Error Batch Type When selecting  Abort after one cancel batch followed by <configured amount> consecutive cancel batches  or  Do not abort after cancel batch  options above, the Error Batch Type radio buttons are enabled. Choosing Data Veracity will send all erroneous batches to Data Veracity while choosing ECS will send the erroneous batches to the ECS. Data Veracity Error Batch To use Data Veracity here, you must set up a database table prior to setting up the error batch handling for your workflows. For more information see Data Veracity . The Error Batch Type is grayed out until one of the  Abort after one cancel batch followed by <configured amount> consecutive cancel batches  or  Do not abort after cancel batch  alternatives is selected. Selecting Data Veracity in Error Batch Type will then enable the Data Veracity Profile field. Setting Description Setting Description Error Code Select from a drop-down list of error codes that have been defined from the error code web interface. You can refer to Error Codes for instructions. The Error Codes are shared between Data Veracity and the ECS . Note! The use of udrAddError() APL function to specify the ErrorCode will override the error code configured in Workflow Properties. Data Veracity Profile The Data Veracity profile to be used when forwarding error batch to Data Veracity. Refer to Data Veracity Profile for instructions to set up the profile for use. Named MIMs MIM values to be associated with the erroneous batch file when sent to Data Veracity. The Named MIMs added in the Data Veracity Profile should be listed in the table. MIM Resource The Mim Resource column is populated with the MIM values that are based on the MIM parameters which are selected from the MIM Browser dialog. ECS Error Batch The Error Batch Type is grayed out until one of the  Abort after one cancel batch followed by <configured amount> consecutive cancel batches  or  Do not abort after cancel batch  alternatives is selected. Selecting ECS in Error Batch Type will then enable the Error Code and Error UDR Type field. The Error UDR Type field specifies the error UDR to be associated with the error batch and sent to ECS when the batch workflow triggers a Cancel Batch scenario. In the Error tab, you can also map MIM Resources to the corresponding fields in the error UDR using the Error UDR MIM Mapping section. Once the error UDR is sent to ECS, its values can be reviewed in the View Error UDR page in ECS Inspector. The error UDR may be populated from Analysis or Aggregation agents as well. This is useful if you want to enter other values than MIMs. Open Setting Description Setting Description Error Code Select from a drop-down list of error codes that have been defined in the Error Correction System Inspector. The Error Codes are shared between Data Veracity and ECS . Refer to Error Codes for instructions. Note! The use of udrAddError() APL function to specify the ErrorCode will override the error code configured for this field. Error UDR Type The error UDR to be associated with the error batch. The appropriate format can be selected from the UDR Internal Format Browser dialog opened by selecting the Browse... button. The columns UDR Field and MIM Resource are populated depending on the selected UDR type. Note! The use of cancelBatch() APL function to specify the errorUDR will override the error UDR configured for this field. UDR Field A list of all the fields available for the selected Error UDR Type. MIM Resource The MIM Resource column is populated by clicking the MIM button. The preferred MIM to map to the Error UDR Type fields can then be selected from the MIM Browser dialog. Logged MIMs The column Error MIM holds information on what MIM resources to be logged in the System Log when the workflow aborts or sends UDRs and batches to ECS. These values may also be viewed from ECS (the MIM column). The most relevant resources to select are things that identify the data batch, such as the source filename, if available. Note that this is only a short summary of the functionality description. For further information, see Error Correction System .",
    "title": "Error Tab - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352137720/Error+Tab",
    "word_count": 983,
    "char_count": 5831
  }
]