[
  {
    "chunk_id": 1,
    "text": "Open In this section, you can see information about the new features and functionality in this release. 1 New Features 1.1 Configuration Tracer 1.2 New Command Line Interface (mzcli) for MediationZone 1.3 Usability 1.3.1 Dashboard View 1.3.2 Environment Indicator 1.4 Functionality Made Available in Desktop Online 1.4.1 ECS Statistics 1.4.2 ECS Inspector 1.4.3 Configuration Diff 1.4.4 Development Toolkit 1.4.5 Additional HTTP Security Headers 1.4.6 Documentation Generator 2 Enhancements 2.1 HTTP/2 Client Agent Supports new OAuth2UDR 2.2 HTTP/2 Server Agent Supports Dynamic Public Key 2.3 HTTP/2 Server Agent Supports Additional Certificate Validation 2.4 Running Authorization Server on Either Platform or EC 2.5 Host Header Validation 2.6 Improved configuration options in the Streaming Telemetry Agent 2.7 Upgrade Improvements 2.8 Usability Improvements 2.8.1 Configuration Browser Supports Additional Keyboard Shortcuts 2.8.2 Code Editors Supports Additional Keyboard Shortcuts 2.8.3 Workflow Template Adds Context Menu 2.8.4 New Icons 2.9 Documentation Improvements 2.9.1 Pico Management with Topo 2.9.2 Status Codes for REST Server 2.9.3 Database Sizing 2.9.4 Log Forwarding Properties 2.10 Rollback New Features The following new functionality has been added in this release: Configuration Tracer Ref: XE-14659/XE-14668 There is now a new tool called Configuration Tracer available in Desktop Client, which you can use to view active and historical configuration and also restore historical configurations. You can access it from the Tools and Monitoring section of the Manage view. For more information, see Configuration Tracer . New Command Line Interface (mzcli) for MediationZone Ref: XE-15667 A new command line interface, mzcli , is now available in MediationZone. It enables you to execute system commands independently across multiple hosts, offering greater flexibility for remote system management, see  https://infozone.atlassian.net/wiki/x/b_f8F Usability Dashboard View Ref: XE-10595 A live health view of the entire system is now available and accessible from the start page of the desktop. You can view the number of aborted workflows, error logs, and monitor the memory and CPU usage for the Platform and any running ECs. For more information, see Dashboard View . Environment Indicator Ref: XE-17136/XE-17131 An environment indicator is now available at the top menu bar. The environment indicator is used to help you differentiate which MediationZone the desktop belongs to. This is particularly useful if you have multiple MediationZone installations running in your environment. You can differentiate if you are accessing the Desktop that belongs to the Production environment or the Development and testing environment. The environment indicator is hidden by default when you log in for the first time, and it can be made visible to you from the options at the Users profile submenu. For more information, see Desktop User Interface | Top Menu Bar . Functionality Made Available in Desktop Online The following tools that were previously only available in the Desktop Client are now available in Desktop Online: ECS Statistics Ref: XE-9287 ECS Statistics can now be accessed in Desktop Online. You can access the ECS Statistics from the Data Management section in the Manage view. For more information, see ECS Statistics . ECS Inspector Ref: XE-16670 The ECS Inspector functionality can now be accessed in Desktop Online. You can access the ECS Inspector from the Data Management section in the Manage view. Note! The ECS Restricted Fields and Bulk Edit features are currently available only in Legacy Desktop. The Desktop version of this feature is coming soon. Configuration Diff Ref: XE-14658/XE-14666 The Configuration Diff tool allows you to compare two configurations or versions of the same configuration type side by side. It highlights differences between the selected configurations. For more information, see Configuration Diff . Development Toolkit Ref: XE-14889 Plugins created with the Development Toolkit can now be accessed in Desktop. For more information, see Development Toolkit User's Guide . Additional HTTP Security Headers Ref: XE-15299 The following headers have now been added to the Desktop: Referrer-Policy X-Content-Type-Options Documentation Generator Ref: XE-16381/XE-17542 The Documentation Generator that you can use to create automated documentation for configurations including descriptions, functions, uses, and access rights, has now been added to the Desktop. See Documentation Generator for more information. Enhancements HTTP/2 Client Agent Supports new OAuth2UDR Ref: XE-18303/XE-15677 The HTTP/2 Client agent will support a new input UDR called http.OAuth2UDR . This new UDR will allow OAuth2 authentication configuration to be done through APL instead of the agent configuration. Note! Sending a http.OAuth2UDR into the HTTP/2 Client will overwrite any OAuth2 authentication configuration in the agent configuration. For more information, see HTTP/2 UDRs | OAuth2UDR . HTTP/2 Server Agent Supports Dynamic Public Key Ref: XE-15811/XE-15669 HTTP/2 Server agent will support dynamic public key by querying JWKS (JSON Web Key Set) endpoint of an OpenID Connect (OIDC) server that returns JWKS as JSON objects. For more information, see HTTP/2 Server Agent Configuration | Authentication Tab . HTTP/2 Server Agent Supports Additional Certificate Validation Ref: XE-18303/XE-16324 HTTP/2 Server agent will support 2 additional certificate validation. These are to perform certificate chain validation and revocation status check. For more information, see HTTP/2 Server Agent Configuration | Server Tab . Running Authorization Server on Either Platform or EC Ref: XE-16535 Authorization Server for HTTP/2 Agents can now be run on an EC if you choose not to run it on a Platform. For steps on how to configure the Authorization Server for an EC, see Enabling Authorization Server . For more general information regarding the Authorization Server, see Authorization Server User's Guide . Host Header Validation Ref: XE-16051 We have now added a new property that can be used to validate host headers to prevent malicious redirects: ui.webserver.strict.host.validation For more information, see  Desktop Properties . Improved configuration options in the Streaming Telemetry Agent Ref: XE-16590 We have added a checkbox option to the Telemetry Agent configuration that allows you to enable or disable automatic connection retries, see https://infozone.atlassian.net/wiki/x/PVL9F . Upgrade Improvements Ref: XE-15534 A couple of improvements have been made to the upgrade: New flags have been introduced to validate the following before installation install.xml parameters mzadmin password db owner password db parameters checks that tables exist in the db check that new version is not older than installed version Improved error messages For more information, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/352071976 and https://infozone.atlassian.net/wiki/spaces/MD94/pages/352072133 . Usability Improvements We have made several usability improvements in this release. Configuration Browser Supports Additional Keyboard Shortcuts Ref: XE-17048/XE-17208 The Configuration Browser in Desktop now supports additional keyboard shortcuts for easier navigation using only the keyboard. For more information, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/352137286/Configuration+View#Configuration-Browser . Code Editors Supports Additional Keyboard Shortcuts Ref: XE-17071 The code editors in Desktop now support additional keyboard shortcuts for easier navigation using only the keyboard. For more information, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/568557569 . Workflow Template Adds Context Menu Ref: XE-17074/XE-17392 The workflow template now has a context menu for the workflow editor and agents to allow you to access key operations. Access the agent context menu by left-clicking on an agent and then clicking on the ellipsis icon within the agent options. The available options in the agent context menu include: Cut : Removes the selected agent and places it on the clipboard, allowing it to be pasted elsewhere within the workflow editor. Copy : Creates a duplicate of the selected agent on the clipboard without removing it from its original position. Connect Agent : Provides an option to create a connection between the selected agent and another agent in the workflow. Delete : Removes the agent and all its stored configuration. Access the workflow editor context menu by right-clicking on the blank canvas. The available options in the workflow editor context menu include: Paste : Inserts the agent from the clipboard into the workflow editor. MIM Browser : Opens the MIM (Meta Information Model) Browser, providing users with a detailed view of the agent's data structure and related information. UDR Assistance : Offers guidance and support related to Usage Detail Records (UDRs), assisting users in managing and troubleshooting UDRs associated with the agent. For more information, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/352072897 . New Icons Ref: XE-17407 We have refreshed the icons across the UI to include a new color palette and clearer, more distinct symbols. The updated icons are designed to improve visual clarity and meet accessibility requirements. The table below shows the new colors and what each one represents. Colour Meaning Colour Meaning Open Logic, Security - For configurations containing code or encryption, for example: Analysis Agent Encryption Profile Open Storage, Database - For configurations responsible for storing files or data, for example: Couchbase Profile Disk Open Recovery, Prosperity - For configurations that handle data recovery and veracity, for example: Data Veracity Profile ECS Agent Open Streaming - For configurations that handle real-time streaming, for example: Kafka agents Streaming Telemetry agent Open Transformation, Division - For configurations that compress or transform data to another form, for example: Data masking Encoder Agent Open Unity - For configurations that group or categorize data, for example: Aggregation Inter workflow Open Power, Control - For configurations that monitor, alert and control, for example: Alarm detection Prometheus Open Communication - For configurations that provide messaging or file or data transfer, for example: SFTP Agent 5 G Profile Documentation Improvements We have done a number of documentation improvements in this release. Pico Management with Topo Ref: XE-15527 The description of how to work with pico.groups has been improved, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/352119527 . Status Codes for REST Server Ref: XE-15976 The HTTP status codes and descriptions for the REST server agent have been added to the documentation, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/352179109 . Database Sizing Ref: XE-17321 We have provided recommendations for https://infozone.atlassian.net/wiki/spaces/MD94/pages/511672321 in the documentation. Log Forwarding Properties Ref : XE-15678 In the documentation we have added a table to list and describe properties that can be used for Log Forwarding, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/388661249 . Rollback In previous versions, rollback has not been available, but in this version rollback in case of failed upgrade has been implemented, see https://infozone.atlassian.net/wiki/spaces/MD94/pages/399147509 .",
    "title": "New Features and Enhancements - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352186358/New+Features+and+Enhancements",
    "word_count": 1623,
    "char_count": 11554
  }
]