[
  {
    "chunk_id": 1,
    "text": "MonitorSpendingStatusCycleUDR The MonitorSpendingStatusCycleUDR is a container used to correlate MonitorSpendingUDR requests with the corresponding answers. Field Description Field Description answer (DRUDR) This is the answer to the sent request: either MonitorSpendingStatusResultUDR or CCExceptionUDR . EndProcessingTime (long) This readonly field will only be populated when the agent emits the answer in the workflow. It contains a timestamp which corresponds to the time when the UDR has been received from the SAP Convergent Charging. Latency (long) This readonly field will only be populated when the agent emits the answer in the workflow. It contains the latency introduced by the processing of this UDR. request (DRUDR) This is the request sent: either MonitorSpendingStatusUDR or MonitorSpendingStatusCancelUDR . requestId (long) This is the ID of the request. StartProcessingTime (long) This readonly field will only be populated when the agent emits the request in the workflow. It contains a timestamp which corresponds to the time when the UDR has been submitted to SAP Convergent Charging. MonitorSpendingStatusResultUDR The MonitorSpendingStatusResultUDR contains the answer to a MonitorSpendingUDR request. Field Description Field Description monitoringAction (string) This is the type of action that was taken, either created, changed, or cancelled. monitoringId (string) This the monitoring ID the request refers to. If left empty, the default monitoring ID set in the agent configuration will be used. spendingStatusesIds (list<SpendingStatusUDR (sapcc.monitoring)>) This is the list of the spending status IDs that the monitoring session refers to. If left empty, all available spending status IDs will be monitored. MonitorSpendingStatusUDR The MonitorSpendingStatusUDR initiates monitoring of the spending status for the stated spending status IDs. Field Description Field Description listenerId (byte) This is the listener ID of the SAP CC Online agent which you want to monitor the spending status. monitoringId (string) Monitoring ID is a unique identifier for this monitoring session. spendingStatusIds (list<string>) This is the list of the spending status IDs that you want to monitor. If left empty, all available spending status IDs for the stated monitoring ID will be monitored. ttl (string) This it the Time To Live value in seconds for the monitoring session. If no MonitorSpendingStatusCancelUDR has been received within this number of seconds, the session will close down. If left empty, the default TTL set in the agent configuration will be used. userId (string) This is the ID of the user to which the monitoring ID belongs. MonitorSpendingStatusCancelUDR The MonitorSpendingStatusCancelUDR will terminate monitoring of spending status IDs belonging to the stated monitoring ID. Field Description Field Description listenerId (byte) This is the listener ID of the SAP CC Online agent that is monitoring the spending status. monitoringId (string) Monitoring ID is a unique identifier for this monitoring session. userId (string) This is the ID of the user to which the monitoring ID belongs. SpendingStatusReportUDR Once monitoring has been activated, the SpendingStatusReportUDR will be sent every time that one of the monitored spending status IDs moves to another label. Field Description Field Description monitoringId (string) This the monitoring ID that the report relates to. If left empty, the default monitoring ID set in the agent configuration will be used. spendingStatuses (list<spendingStatusUDR (sapcc.monitoring>)) This is a list of the spendingStatusUDR s included in the report, i e the spending statuses that have moved to another label. SpendingStatusUDR Once monitoring has bee activated, the SpendingStatusUDR will represent the current state of a spending status. Field Description Field Description id (string) This the spending status identifier. label (string) This is the current label for the spending status.",
    "title": "Spending Status UDRs - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352179340/Spending+Status+UDRs",
    "word_count": 573,
    "char_count": 3978
  }
]