[
  {
    "chunk_id": 1,
    "text": "This is the Data Protection and Privacy (DPP) guide for MediationZone. This document is designed to assist you in understanding and implementing the necessary data protection measures when configuring personal data processing within MediationZone. As you implement the configurations and workflows necessary for your projects, this guide will serve as a resource for best practices and efficient data management strategies within MediationZone. 1 Data Protection Enabling Agents in MediationZone 1.1 Data Masking Agent 1.2 Encryption Agent 2 Guidelines for DPP compliance in workflows 2.1 Archiving Agent, Profile and Inspector 2.2 Amazon S3 Forwarding Agent 2.3 Data Veracity Forwarding Agent 2.4 Error Correction System 2.5 SQL Forwarding & Processing Agents 2.6 Disk Forwarding Agent 2.7 Database Forwarding Agent 2.8 Batch-Based Real-Time Agents Data Protection Enabling Agents in MediationZone You can use two different agents for data protection in MediationZone; Data Masking and Encryption. Data Masking Agent MediationZone offers data masking capabilities through its Data Masking agent, ensuring that sensitive personal data is protected in compliance with data protection regulations. With this agent you can both mask and unmask specific fields within User Data Records (UDRs), providing flexibility for batch and real-time data processing workflows. Key Features: Masking Methods : Profile-based approach, providing you with a selection of specific methods for masking; Crypto, Database, or Hash. Each method is tailored to different operational needs and compliance requirements. Supported databases for the Database masking method include Oracle, Postgres, and SAP HANA. Encryption and Decryption : Strong encryption and decryption capabilities using AES-128 and AES-256 standards. Key Management : Secure management of encryption keys through a JCEKS keystore. Data Transformation : Ability to transform input data into random data using SHA-256 hashing. Profile Management : Support for multiple profiles within the agent, enabling different configurations for various data handling requirements. Error Handling and Logging : Error handling and detailed logging mechanisms to track operations and troubleshoot issues. For more information on functionality and configuration, see the Data Masking Agent section in the MediationZone documentation. Encryption Agent MediationZone offers encryption capabilities through its Encryption agent. This functionality is crucial for protection of data in transit and at rest. Key Features: Encryption standards: Support for AES-128 and AES-256 encryption methods. Key management: Secure management of encryption keys through a JCEKS keystore or an external keystore. Data transformation: SHA-256 hashing to anonymise data. For more information on functionality and configuration, see the Encryption Agent section in the MediationZone documentation. Guidelines for DPP compliance in workflows MediationZone provides a suite of agents and profiles that enable you to store data temporarily or permanently. These can be used for integrating data protection standards into your workflows. Understanding how to leverage these agents efficiently is crucial for maintaining compliance. In the following sections, we describe the different agents and profiles that are typically used for storing data and guidelines for using them in a DPP context. Archiving Agent, Profile and Inspector Exapand to read more about guidelines for the Archiving agent, profile and inspector. Amazon S3 Forwarding Agent Expand to read more about guidelines for the Amazon S3 forwarding agent. Data Veracity Forwarding Agent Expand to read more about guidelines for the Data Veracity forwarding agent. Error Correction System Expand to read more about guidelines for the Error Correction System. SQL Forwarding & Processing Agents Expand to read more about guidelines for the SQL forwarding and processing agents. Disk Forwarding Agent Expand to read more about guidelines for the Disk forwarding agent. Database Forwarding Agent Expand to read about guidelines for the Database forwarding agent. Batch-Based Real-Time Agents Expand to read about guidelines for the batch-based real-time agents.",
    "title": "Data Protection and Privacy Guide - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/449413121/Data+Protection+and+Privacy+Guide",
    "word_count": 598,
    "char_count": 4223
  }
]