[
  {
    "chunk_id": 1,
    "text": "Use this filter to configure the Prometheus metrics to be exposed for scraping. The purpose of the Prometheus Filter is to prevent metric flooding in the Prometheus host storage. The filter is inclusive (whitelist-style)  you define which metrics to include. Only matching metrics will be exposed for scraping. Except in the situation where no Prometheus Filter exists or all existing Prometheus Filters are disabled, then all available metrics are exposed for scraping. The exception is MIM metrics from batch workflows. In the case of MIMs from batch workflows, no metrics will be collected unless there is a filter whitelisting them. A Prometheus filter consists of one or more metric filters. Each metric filter has a Metric Name Filter and one or more Label Filters . A metric that passes at least one of the metric filters will be exposed for scraping. Open Exa mple o f a Prometheus filter with one metric filter with no label filters. Setting Description Setting Description Ena bled Whether this Prometheus Filter is enabled or not. Metric Name Filter A filter is applied to the metric name. Label Filter(s) A filter that applies to a label that exists on the metric(s) passes the corresponding metric name filter. Steps to add a Metric Name Filter To add a metric filter, take the following steps: Click the Add button. In the displayed dialog, enter a Metric Name Filter in the form of a regular expression. Optionally, specify one or more label filters by entering the Label along with a corresponding Label Value Filter. The Label Value Filter has to be entered in the form of a regular expression. Click Add to add the metric filter. Click Close when done. Open Add Metric Name Filter dialog For example, five metric filters are configured. See the detailed description in the table below. Setting Label Value Filter Description Setting Label Value Filter Description jvm_.* java_.* process_.* Will give you Global statistics (JVM, processes, event management). com_digitalroute_event.* MIM metrics related to the event handling system. com_digitalroute_wf_.* workflow=Default.myWorkflow.* Workflow MIM metrics for the workflows in the Default folder that have names beginning with \"myWorkflow\".",
    "title": "The Prometheus Filter - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352144333",
    "word_count": 352,
    "char_count": 2209
  }
]