[
  {
    "chunk_id": 1,
    "text": "The Workflow Bridge forwarding agent sends information to the Workflow Bridge real-time collection agent to report workflow state changes. The state information is delivered in a WorkflowStateUDR . The Workflow Bridge real-time collection agent always has to acknowledge a workflow state change by sending back the WorkflowStateUDR to the Workflow Bridge forwarding agent. For ConsumeCycleCDR s, this behavior can be controlled using the Send Reply Over Bridge setting in the Workflow Bridge profile. For more information regarding the stat es, see Workflow State Event . The following fields are common for all of the workflow state UDRs: Setting Description Setting Description AgentId (string) This field includes the agent id that is created for the Workflow Bridge forwarding agent each time a workflow is started. The id is unique per Workflow Bridge forwarding agent and workflow execution. SessionContext (any) This field might contain data that has been populated in the InitializeCycleUDR or BeginBatchCycleUDR by the Workflow Bridge real-time collection agent. For more information about session context, refer to the section, Session Co nte xt, in Workflow Bridge Agents . This field is only readable in this UDR. The following field is included for all Workflow Execution State UDRs that are specific for batch forwarding workflows: Setting Description Setting Description TxnId (long) This field includes the id for the batch transaction of the batch forwarding workflow. WorkflowStateUDR The WorkflowStateUDR defines the common attributes and behaviors for any WorkflowStateUDR s. InitializeCycleUDR This UDR is sent when the forwarding workflow enters the initialize execution state. BeginBatchCycleUDR This UDR is sent when the batch forwarding workflow enters the beginBatch execution state. ConsumeCycleUDR This is the UDR that contains the data that is being collected from the forwarding workflow. For more information about ConsumeCycleUDR s, refer to ConsumeCycleUDR . DrainCycleUDR This UDR is sent when the batch forwarding workflow enters the drain execution state. EndBatchCycleUDR This UDR is sent when the batch forwarding workflow enters the endBatch execution state. CommitCycleUDR This UDR is sent when the batch forwarding workflow enters the commit execution state. In addition to the common UDR fields the CommitCycleUDR also includes the following field: Setting Description Setting Description IsRecovery (boolean) This field includes information on recovery status, to be able to know if a rollback shall be committed. DeinitializeCycleUDR This UDR is sent when the forwarding workflow enters the deinitialize execution state. CancelBatchCycleUDR This UDR is sent when the batch forwarding workflow enters the cancelBatch execution state. RollbackCycleUDR This UDR is sent when the batch forwarding workflow enters the rollback execution state. In addition to the common UDR fields the CommitCycleUDR also includes the following field: Setting Description Setting Description IsRecovery (boolean) This field includes information on recovery status, to be able to know if a rollback shall be committed.",
    "title": "Workflow Execution State UDRs - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352082855/Workflow+Execution+State+UDRs",
    "word_count": 458,
    "char_count": 3139
  }
]