[
  {
    "chunk_id": 1,
    "text": "A user defined event is a basic event, extended with any variables entered by the user. It is configured in the Ultra Format Editor : Example - User defined event event myEvent { ascii addedField1; int addedField2; }; A user defined event is of Workflow type therefore includes Workflow specific fields. The basic fields are automatically included in myEvent , along with the typed in fields. Population of the fields is done via an APL utilizing agent. Example - Usage of user defined event myEvent x = udrCreate( myEvent ); x.addedField1 = aUDR.anum; x.addedField2 = aUDR.code; dispatchEvent( theEvent ); The fields of a user defined event: agentName - The name of the agent issuing the event. category - A user defined category, as entered in the Event Categories dialog. If utilized, this field is set manually in the APL code. eventName - the name of the Event, as defined in Ultra. origin - the IP address of the Execution Context the Workflow issuing the event is running on. receiveTimeStamp - The date and time for when an event is inserted in the Platform database. This is the time used in for example the System Log. severity - The severity of the event. May be any of: \"Information\",\" Warning\", \"Error\", or \"Disaster\". The default value is Information. If another severity is required, this field must be set manually in APL to one of the strings: Information, Warning, Error, Disaster. timeStamp - The date and time taken fro the host where the event is issued. workflowKey - The name of the internal workflow key. workflowName - The name of the Workflow issuing the event. <any> - Any information, as stated in the format configuration. The contents field - Workflow name: <Workflow name>, Agent name: <Agent name>",
    "title": "<User Defined> Event - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352106734/User+Defined+Event",
    "word_count": 294,
    "char_count": 1729
  }
]