[
  {
    "chunk_id": 1,
    "text": "Accessing the ECS Inspector To access the ECS Inspector, perform the following steps: Click on the Manage button in the top navigation bar. Under the Data Management section, click ECS Inspector . Open Buttons in the ECS Inspector The table below provides a detailed description of each button's features based on the image above. Button Description Search Displays the ECS Inspector - Search page, where search criteria can be defined to limit the entries in the list. For further information, see Searching the ECS Inspector . Matching entries are grouped in sets of 500 within the table. The list indicates which group, out of the total number of groups, is currently displayed. Any operation targeting all matching entries will affect all groups. Filter Queries designed to search for erroneous data can be saved as filters. These filters can then be reused by the Data Veracity collection agent and the Search function. Error Codes Displays the ECS Inspector Error Codes page, where error codes in the system can be configured. For further information, see Managing ECS Error Codes . Reprocessing Groups Displays the ECS Inspector - Reprocessing Group page, where reprocessing groups are managed. For further information, see Managing ECS Reprocessing Groups . Restricted Fields Displays the ECS Inspector - Restricted Fields page, where you can specify certain fields within certain UDR types that should be restricted from being updated in the ECS Inspector, see Configuring ECS Restricted Fields . This feature is currently available only in Legacy Desktop. The Desktop version of this feature is coming soon. Searchable Fields Displays the ECS Inspector - Searchable Fields page, where you can define specific UDR fields that you want to add as meta data that can later be used for making searches, see Configuring Searchable Fields in the ECS . This section has the following subsections: Searching with the ECS Inspector Managing ECS Filters Managing ECS Error Codes Managing ECS Reprocessing Groups Configuring ECS Restricted Fields Configuring ECS Searchable Fields",
    "title": "ECS Inspector - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352110232/ECS+Inspector",
    "word_count": 328,
    "char_count": 2078
  }
]