[
  {
    "chunk_id": 1,
    "text": "Before upgrading the Platform, all workflow groups, workflows, and connected Desktops must be properly shut down, except: Workflows running on ECSAs if upgrading from MediationZone 8.3 or earlier. To shut down workflow groups, workflows, and Desktops: Disable all workflow groups and workflows. Disable all workflow groups and workflows to prevent automatic startup by the scheduler. Use the Execution Manager in Desktop (see Execution Manager for details) to disable all workflow groups and workflows. Or run the following MZSH commands. # Disable all the workflow groups mzsh mzadmin/<password> wfgroupdisable * # Disable all the workflows mzsh mzadmin/<password> wfdisable * You can verify workflow status with the following command: mzsh mzadmin/dr wflist -active Note! If you want to disable a subset of your workflows and workflow groups, make lists using the commands below and loop through the lists with the commands above. # List all ENABLED workflow groups mzsh mzadmin/<password> wfgrouplist -mode E # List all workflows and if they are ENABLED or DISABLED mzsh mzadmin/<password> wflist -long -activationMode Stop all workflow groups and workflows. Use the Execution Manager in Desktop (see Execution Manager for details) to stop workflow group and workflows. Or run the following MZSH command: # Stop all the workflow groups mzsh mzadmin/<password> wfgroupstop /* # Stop all the workflows mzsh mzadmin/<password> wfstop /* Note! If you want to stop a subset of your workflows and workflow groups, use the lists produced in the step before. Shut down all connected Desktops. Instruct all users to close their Desktops before proceeding with the upgrade. To check which Desktops are currently connected, run the following MZSH command: mzsh mzadmin/<password> desktopadmin -l To shutdown the Desktop, run the following MZSH command: mzsh mzadmin/<password> desktopadmin -x 1 \"Shutting down for Platform upgrade\" Inform Web Desktop users There is no need to manually shut down Web Desktop, as the upgrade procedure will handle it automatically. Note that the Web Desktop is not available in the new version. To view if there are web desktops running in case you want to inform the users, run the following MZSH command: mzsh mzadmin/dr pico -view",
    "title": "Shutting Down Workflows and Desktops when Upgrading from 8.3 to 9.4 - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/472121458/Shutting+Down+Workflows+and+Desktops+when+Upgrading+from+8.3+to+9.4",
    "word_count": 348,
    "char_count": 2257
  }
]