[
  {
    "chunk_id": 1,
    "text": "Using the Documentation Generator , you can create documentation for the configurations that you have created. Generating Automated Documentation To access the Documentation Generator, click the Configuration button at the top of the menu bar. In the Configuration View , click the ellipsis button in the table action bar, and click the Documentation Generator . Open The Documentation Generator button in the table action bar To generate documentation on the configurations in the system, click the Documentation Generate button. The documentation is downloaded by the browser. Once the documentation generation is completed, a notification is displayed and the documentation can be found in the download folder set in the browser. Open Notification when the documentation has been generated You can then open the generated HTML file (index.html) in your web browser. Open Documentation displayed in web browser Content of the Documentation The documentation generated includes up-to-date information on the saved configurations. The sections included vary according to the type of configuration documented and how it is used. The possible sections included are the following: Section Description Section Description Workflow An image of the configuration. This section is only included for workflow configurations. Globals The variables and constants are declared globally. This section is only included for APL Code configurations. Functions The APL functions. This section is only included for APL Code configurations. Description The content is provided by the user in the configuration profile, using the Documentation dialog. For example, you can provide a description and the purpose of the configuration in the dialog. See Configuration View | Documentation for more information on how to populate this section. Uses A list of all the configurations that the configuration uses, for example, APL code or Ultra format. Used By A list of all the configurations using the configuration. Access A list of the users who have access to the configuration.",
    "title": "Documentation Generator - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/563576852",
    "word_count": 309,
    "char_count": 2057
  }
]