[
  {
    "chunk_id": 1,
    "text": "The search function enables users to identify and locate erroneous UDRs and batches within the ECS. The available search options will adjust based on your selection. On the ECS Inspector page, click Search . You will see the empty search result at first. Click the Filter button to view the Search ECS dialog. Choose either UDRs or Batches data type to reveal specific options for each. Open Search Options The table below lists the search options available when searching for UDRs and Batches in the ECS Inspector. Category Search Options UDRs Batches Description Category Search Options UDRs Batches Description None Saved Filter This field lists all your previously saved filters. For detailed instructions on creating a filter, see the Saving Search Settings as a Filter section below. General Workflow This field lists the name of the workflow that transferred the entry to the ECS. Agent This field lists the name of the agent that transferred the entry to the ECS. Cancel Agent This field lists the name of the agent that cancelled the batch. Cancel Message The error message sent as an argument with the cancelBatch function. Error Code This field lists the Error Code that has been defined in the ECS Inspector. See Managing ECS Error Codes for further information. Error Case This field lists the Error Cases associated with the selected Error Code. If the entry is too long to fit in the field, the dialog can be expanded by enlarging the ECS Inspector in order to display the entire error case text. An Error Case is a string, associated with a defined Error Code. Error Cases can only be appended via APL code: udrAddError( <UDR>, <Error Code>, <Error Case> ); Note! When Batches is selected, the <UDR> parameter is the error UDR. Error UDR Type The type of Error UDR that can optionally be sent with a batch, containing important MIM information (or any other desired information when the UDR is populated via APL). UDR Type The field lists the type of UDR you want to search for. Tag If you have tagged UDRs, you can use this option to display only those UDRs with the specified tag. Period Select this field to search for UDRs or batches that have been inserted into the ECS during a specific time period. Choose User Defined and specify the start and end times using the calendar and time picker, or use one of the predefined intervals provided. Note! This is a required field. The Period value cannot be empty. MIM Resource This field lists the MIM Resource that is defined in the Workflow Properties dialog. You can configure a workflow to include descriptive MIM values along with the actual data. This allows for more precise and refined searches within the ECS. Value This field lists the values associated with the MIM Resource. For example, string, integers, short, long and other data types. Reprocessing Group Reprocessing Group This field lists all of the reprocessing groups. Unassigned UDRs or Batches list all entries not associated with any reprocessing group. Reprocessing State This field filters entries by their state, either New or Reprocessed. Only entries in the New state can be collected. Period* Select this checkbox to search for UDRs or batches that last changed state (to New or  Reprocessed) during a specific time period. Choose User Defined and specify the start and end times using the calendar and time picker, or use one of the predefined intervals provided. Note! This is a required field. The Period value cannot be empty. Advanced Field (The number of fields available depends on the number of searchable fields configured) If you search for UDRs, you can access the Advanced category. Here, you can enter specific values for the UDR labels you have configured, see Configuring Searchable Fields in the ECS . Only UDRs that match the specified values will be displayed in the ECS Inspector. Example - Entering specific values for each UDR label Open Only UDRs with IMSI 2446888776 are displayed in the ECS Inspector, provided that the label IMSI has been mapped to the IMSI field in the UDRs. You can use wildcards and intervals when entering values for the fields. The asterisk * matches any or no characters, while intervals can be specified using brackets [ ]. When using the * or  [ ], the following rules apply: Only one wild card and one inte rval can be used per value. An interval is defined with a start value and an end value. If the interval consists of the same number of digits as start and end values, the match is made based on the specified number of digits, For example, (a[001-002]) matches a001 but not a01. If the interval consists of different numbers of digits as start and end values, the match is made based on an appropriate number of digits in the UDR. For example, (a[1-20]) matches a1 and a20, but not a01 or a020. Only one interval can be specified within the \"[ ]\". The start and end values have to consist of numbers. The start value cannot be larger than the end value. The start value cannot have a larger amount of numbers than the end value. For example, [0001-3]. If a setting for a value is incorrect, an error message is displayed as a tooltip. In order for a UDR to pass the filter, all the defined values have to match. Example - Using wildcards and asterisk in a value Open Only UDRs with matching all the following values will be displayed: A Number starting with 468 B Number starting with 47 Location Area Code 10 to 20",
    "title": "Searching with the ECS Inspector - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352110287",
    "word_count": 940,
    "char_count": 5416
  }
]