[
  {
    "chunk_id": 1,
    "text": "Configurations relating to the Categorized Grouping agent are made in the Categorized Grouping profile. The Categorized Grouping profile is loaded when you start a workflow that depends on it. Changes to the profile become effective when you restart the workflow. Configuration To create a new Categorized Grouping profile configuration, click the New Configuration button from the Configuration dialog available from Build View and then select Categorized Grouping Profile from the menu. The contents of the menus in the menu bar may change depending on which configuration type has been opened in the currently active tab. The Categorized Grouping Profile profile uses the standard menu items and buttons that are visible for all configurations, and these are described in Common Configuration Buttons . Open The contents of the menus in the menu bar may change depending on which configuration type has been opened. The Audit profile uses the standard menu items and buttons that are visible for all configurations, and these are described in Build View . The Audit profile configuration contains the following settings: Setting Description Setting Description Working Directory Absolute path to the working directory to be used by the agent. It will be used to keep data over multiple input transaction boundaries. The same root directory can be used for several agents over several workflows. To enable concatenation and grouping over several activations of the workflow, all ECs where the workflow can be activated, must be able to access the same global root directory. Each agent will create and work in its own unique subdirectory. An agent may leave persistent data if closing conditions are not met, the workflow aborts or Cancel Batch occurs in the last transaction. Abort on Inconsistent Working Directory This setting controls the agents behavior if its storage is not in its expected state, that is, if the agent discovers that the persistent directory does not have the expected contents. Not selected - Warn about the condition and continue from a clean state. Any old data will be moved to a subdirectory. Selected - Abort the workflow. If the workflow aborts, manual intervention may be needed. Regardless of this setting, warnings will be logged. Activate Use of Grouping Activating this option will lead to the spawning of an external process of the script identified by the \"Script path\" described next. If not used, the category data will be concatenated. Script Path Specifies the external script to be used for grouping operations. Script Arguments Used to state the order and contents of arguments and flags in the user defined script. The reserved words %1 and %2 states the position in the call where the arguments are expected. Reserved Words Description %1 This reserved word will during execution be replaced with the target file the script should create (including absolute path) %2 An absolute path to a directory which contains the files (and potential subdirectories) that should be grouped. The agent guarantees that this directory does not contain any other files or directories except for those that are subject to grouping. Example - Type script #!/bin/sh cd $2 //Go to the directory stated in %2 tar cf $1 * //Tar file contents of %2 gzip -9 $1 //Gzip the tared file mv $1.gz $1 //Rename to previous filename exit 0 //Exit Byte Count Specifies the byte count closing condition for the agent. This field will have to be set to a value larger than zero. File Count Specifies the file count closing condition for the agent. This value is optional. Closing Interval Specifies the closing interval in seconds for the agent. This value is optional. After each timeout, all categories will be closed and the timer will be moved forward according to the timeout interval. Close on Deactivation Setting this option will cause the agent to emit its data when the last file has been finished by the workflow. If a workflow aborts before all categories have been committed and this check box is enabled, the agent shall try to log a warning in the system log that data is remaining in the persistent storage. Note! If more than one Closing Condition is reached, the condition with the highest number will be reported. Closing Condition Description Closing Condition Description 0 Timeout 1 This is the last transaction during this activation 2 APL code requested closing 3 The input file count limit is reached 4 The input file size limit for this category is reached or exceeded",
    "title": "Categorized Grouping Profile - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352107553",
    "word_count": 740,
    "char_count": 4507
  }
]