[
  {
    "chunk_id": 1,
    "text": "Data Veracity provides a repository for erroneous records and allows users to search, view, modify and reprocess the stored data. Data Veracity is an alternative to the Error Correction System (ECS): Data Veracity can handle larger volumes of data and has higher performance when searching, filtering, and processing data. Data Veracity can store erroneous batches as well as erroneous UDRs. No additional installation is required. For demo and development systems, the integrated Derby database can be used. Data Veracity will contain a new web UI to support data exploration, classification and modification of records. this is accompanied by 3 new agents and APL functions to offload data flows from invalid, corrupt or incomplete records. The APL functions will work much like the ECS functions to facilitate the automation of detecting, qualifying and correcting the invalid records. Data Veracity Profile The Data Veracity Profile contains settings for selecting the database profile, mapping of UDR types to be used, mapping information for MIM and generation of the SQL script for the generation of tables in the external database. Open Data Veracity Profile Data Veracity is supported for use with the following databases: Oracle PostgreSQL The Data Veracity forwarding agent commits received UDRs to the external database, including any related metadata. Open Example of Workflow with the Data Veracity forwarding agent The Data Veracity collection agent is used to collect erroneous UDRs from the database using the search filters or error codes defined in the Data Veracity web UI. Only UDRs with the status \"NEW\" will be collected. The state will be changed from \"NEW\" to \"UPDATED\" after collection. Data Veracity UI The Data Veracity UI contains functions for examination and manipulation of the stored erroneous data. Open Data Veracity UI",
    "title": "Data Veracity for Correcting Data - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352187150/Data+Veracity+for+Correcting+Data",
    "word_count": 288,
    "char_count": 1854
  }
]