[
  {
    "chunk_id": 1,
    "text": "Usage usage: logger -pico name With this command, you can edit log settings for the picos and update the logging dynamically. Options Option Description Option Description [-reset] Resets the logging to default settings, for example: mzsh <user name>/<password> logger -pico <ec> -reset This option cannot be used in combination with any other option. [-stacktrace] Turns stacktrace on or off, for example: mzsh <user name>/<password> logger -pico <ec> -stacktrace OFF The default value is on. [-level] Determines for which severity levels events should be logged; OFF, ERROR, WARN, INFO, CONFIG, DEBUG, TRACE, FINEST, or ALL, for example: mzsh <user name>/<password> logger -pico <ec> -level WARN Caution! If you set a detailed log level, such as DEBUG, TRACE, or FINEST, logging will be done for all classes in the selected pico(s), including APL logging, which may have a negative impact on performance. To avoid excessive logging when using these log levels, you can add the -package flag, described below, to state a package, for example, the aplLogger package, like this: mzsh <user name>/<password> logger -pico <ec> -level debug -package aplLogger to only do logging for APL. [-file] Will log to an additional file stated with filename, for example: mzsh <user name>/<password> logger -pico <ec> -file mylogfile.txt [-package] Will only log events for the stated package or class, for example: mzsh <user name>/<password> logger -pico <ec> -level debug -package aplLogger Note! When you use the -package option and state the aplLogger package, you can also specify a specific workflow like this: mzsh <user name>/<password> logger -pico <ec> -level debug -package aplLogger.<workflow name> Return Codes Listed below are the different return codes for the logger command: Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if there are missing arguments: Pico not running Pico name missing Unknown failure 2 Will be returned if the level is missing or invalid. 3 Will be returned if the file is missing. 4 Will be returned if the package is missing or invalid. 7 Will be returned if the stacktrace is missing or invalid. 8 Will be returned if reset has been incorrectly used.",
    "title": "logger - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352085679/logger",
    "word_count": 354,
    "char_count": 2234
  }
]