[
  {
    "chunk_id": 1,
    "text": "Usage usage: desktopadmin [options] This command can be used for shutting down connected Desktops, Legacy Desktops or for displaying an administrator message to all users. When shutting down connected Desktops or Legacy Desktops, locked configurations are released as well. Any mention of desktops in the description below will represent both the Desktop and Legacy Desktop unless specified. Note! Only users belonging to the Administrator group are authorized to execute this command. Options The command accepts the following options: Option Description Option Description [-l, --list] List all connected desktop sessions include SSO login. Returns a table with session details. Format: <Name>, <Session ID>, <Username> Example, +----------------+---------------------+----------+ | Name | Session ID | Username | +----------------+---------------------+----------+ | legacy-desktop | 192.168.0.224:53631 | john | | desktop | 154379321 | sarah | +----------------+---------------------+----------+ For Legacy Desktop, Session ID column will display <IP Address:Port>. For Desktop, Session ID column will display Session ID. [-k, --locks] Retrieves a list of locked configurations for each currently connected desktop. Must be used with the -l option. Example, +----------+------------+----------+-------------------------+ | Name | Session ID | Username | Locked Configuration(s) | +----------+------------+----------+-------------------------+ | desktop | 1363198261 | john | | | desktop | 1545132119 | sarah | autotest.asserts | +----------+------------+----------+-------------------------+ [-m, --message] Broadcasts a message to all currently logged-in desktops and those that log in later. Use with -n to send the message to a specific desktop. This message can be removed using the -r option. [-r, --reset] Cancel and clear scheduled shutdown and message, if any. [-n, --session] Apply the command to a specific desktop session obtained using the -l option. Use with one of the following options: -x , -m , -r , or -s . [-x, --shutdown] Schedules a forced shutdown for all desktops after the specified number of minutes (0 for immediate shutdown). Use it with -n to shutdown a specific desktop An optional message can be included using -m . Example, desktopadmin -n 15300940 -x 5 \"Shutting down in 5minutes\" This message will pop up on the desktop and count down of 5 minutes to shutdown. [-s, --status] Use this option to displays the current shutdown timeout and message, if any. Return Codes Listed below are the different return codes for the desktopadmin command: Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if there was a problem parsing command parameters. 2 Will be returned if there was a failure scheduling shutdown of Desktops",
    "title": "mzcli - desktopadmin - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/527073482/mzcli+-+desktopadmin",
    "word_count": 407,
    "char_count": 2805
  }
]