[
  {
    "chunk_id": 1,
    "text": "Before upgrading, the memory and timeout settings for Pico need to be temporarily increased. This helps prevent an Out of Memory (OOM) error ( java.lang.OutOfMemoryError: Metaspace ) during the upgrade process. Once the upgrade is complete, these settings can be reverted to their original values. Caution! The recommended memory settings provided in this document are general guidelines. The actual memory configuration should be determined based on the available RAM in your environment to ensure optimal performance and stability. Configuration Changes Below are the parameters that need to be updated along with their recommended values: 1 Increase pico.startup.timeout in platform.conf 2 Increase maxMetaspace and xmx in platform.conf 3 Verify JVM Arguments 4 Restart Platform Increase pico.startup.timeout in platform.conf Recommended Value: 600 seconds (10 minutes) Steps: Open the platform.conf file using the following command: mzsh topo open topo://container:main1/pico:platform Edit the property value to: pico.startup.timeout=600 Increase maxMetaspace and xmx in platform.conf Recommended Values: maxMetaspace : <Add 100% to original value> xmx : <Add 50% to original value> Steps: Use the topo command to set the maxMetaspace and xmx properties. Replace <container-name> and <pico-name> with the appropriate values for your environment. Run the following command: mzsh topo set --allow-disconnected topo://container:<container-name>/pico:<pico-name>/obj:config.jvmargs ' { maxMetaspace=[ \"-XX:MaxMetaspaceSize=512M\" ] xms=[ \"-Xms4G\" ] xmx=[ \"-Xmx8G\" ] }' Verify JVM Arguments After applying the changes, you can verify the updated JVM arguments using: mzsh topo show jvm-args Restart Platform Once the changes have been made, restart the platform. mzsh startup platform",
    "title": "Increasing Memory And Timeout Settings when Upgrading from 8.3 - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/477757585/Increasing+Memory+And+Timeout+Settings+when+Upgrading+from+8.3",
    "word_count": 241,
    "char_count": 1782
  }
]