[
  {
    "chunk_id": 1,
    "text": "The simple workflow below demonstrates how error UDRs are retrieved from ECS using the ECS Collection agent, which can collect records based on a specified Reprocessing Group or Saved Filter (Read Only). Subsequent validation and transformation logic is applied within the Analysis agent. UDRs that pass validation are routed to the Disk agent for output as new files, while those that remain invalid are redirected to the ECS Forwarding agent for resubmission to ECS. The ECS Collection agent retrieves only UDRs whose Reprocessing State is set to New . When collecting UDRs using a Reprocessing Group , the Reprocessing State of the collected UDRs will be updated to Reprocessed . Open ECS Collection Agent Configure to collect error UDRs based on Reprocessing Group or Saved Filter. Since we selected a UDR-type Reprocessing Group here, UDR Type is enabled to select a UDR to collect. Open Analysis Agent The Analysis agent validates the collected UDRs, assigning an Error Code and Error Case to any invalid records before routing them to the ECS Forwarding agent. For valid UDRs, additional transformation logic can be applied before forwarding them to the Disk Out agent for output. See udrClearErrors() and udrAddError() . Example - Reassigning to a different Reprocessing Group Suppose there is a workflow collecting and validating UDRs from the ECS. If the validation fails, the UDRs are sent back to the ECS with an associated Error Code. UDRs assigned to a new or a different Error Code are directed to a new Reprocessing Group. If you need to associate these UDRs with a different Reprocessing Group, udrClearErrors() must be called before udrAddError() . The exception is if the new Error Code is associated with the same Reprocessing Group. Case 1 - Same Reprocessing Group If the new Error Code belongs to the same Reprocessing Group: Using udrClearErrors() results in a new Error Code and Reprocessing Group to be associated with the UDR in the ECS. This method avoids several Error Codes pointing at different Reprocessing Groups, which makes automatic group assignment impossible. Leaving out udrClearErrors() results in old and new Error Codes (including the Reprocessing Group) to be associated with the UDR in the ECS. Case 2 - Different Reprocessing Group If the new Error Code belongs to a different Reprocessing Group: Using udrClearErrors() results in a new Error Code and Reprocessing Group to be associated with the UDR in the ECS. Leaving out udrClearErrors() does not result in any association with a Reprocessing Group, however, both Error Codes are associated with the UDR in the ECS.",
    "title": "ECS Collection Workflow (UDR) - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352175719/ECS+Collection+Workflow+UDR",
    "word_count": 424,
    "char_count": 2614
  }
]