[
  {
    "chunk_id": 1,
    "text": "This section describes the properties related to Oracle, PostgreSQL, and SAP HANA that you can set. Derby The following properties are applicable to the Derby database. Property Description Property Description derby.restore.path Default value: \"MZ_HOME/dbrestore\" Set this property to set the Derby restore directory. Oracle The following properties are applicable to the Oracle database. These settings are used by the Platform for the connection towards the Platform database, and for ECs for connections towards external databases. Property Description Property Description oracle.pool.connectionwaittimeout Default value: 900 The number of seconds to wait for a free connection if the pool has reached max-connections used. oracle.pool.maxlimit Default value: -1 Maximum number of connections in the pool. It should be set to no less than \"3\". A usual setting would be about 10 to 100. The default value \"-1\" means that the number of connections is unlimited. Oracle Advanced Security Support The following properties are supported for Oracle 12.2, which includes support for Oracle Advanced Security. Set the properties below if you want to enable encryption for Platform for the connection towards the Platform database and for ECs for connections towards external databases. More information about Oracle Advanced Security can be found in the Oracle Database Advanced Security Administrator's Guide . Note! MediationZone only supports Oracle Advanced Security for Oracle 12.2. Property Description Property Description oracle.net.encryption_client The level of security of the client that will connect to the Oracle database is determined with this parameter. Accepted values include, REJECTED, ACCEPTED, REQUESTED, and REQUIRED. Example oracle.net.encryption_client=\"REQUIRED\" oracle.net.encryption_types_client The encryption algorithm to be used is determined with this parameter. oracle.net.crypto_checksum_client The level of security regarding data integrity for the connection with the Oracle database is determined with this parameter. Accepted values include, REJECTED, ACCEPTED, REQUESTED, and REQUIRED. Example oracle.net.crypto_checksum_client=\"REQUIRED\" oracle.net.crypto_checksum_types_client The data integrity algorithm to be used is determined with this parameter. PostgreSQL The following properties are applicable to the PostgreSQL database. These settings are used by the Platform for the connection towards the Platform database, and for ECs for connections towards external databases. Property Description Property Description postgresql.connectionpool.defaultQueryTimeout Default value: 300 Sets the maximum allowed duration in ms of any statement. postgresql.connectionpool.maxlimit Default value: 10 Maximum number of connections in the pool for the PostgreSQL database. It should be set to no less than the sum of the values of postgresql.connectionpool.maxlimit configured for Platform and database profiles connecting to this database. These settings are used by the Platform for the connection towards the Platform database and can also be used for ECs connections towards external databases and it is set on Database profile level. The following settings are used by the PostgreSQL Database for the connection to MediationZone, and are stored in the postgresql.conf file in the server that is hosting the PostgreSQL database. These settings are updated from the Psql Terminal using the ALTER SYSTEM sql command. Changes to the settings will require a restart of the PostgreSQL service. $ psql postgres=# ALTER SYSTEM SET max_connections = 110; ALTER SYSTEM Property Description Property Description max_connections Default value: 100 Maximum number of connections in the pool for the PostgreSQL database. It should be set to no less than the value set for postgresql.connectionpool.maxlimit. shared_buffers Default value: 32 Amount of memory (in MB) for caching data that should be dedicated to the PostgreSQL database. effective_cache_size Default value: 128 Amount of memory (in MB) for disk caching. The recommended effective size should be set to 1/2 of the total memory of the server. work_mem Default value: 1 Memory (in MB) for performing in-memory complex sorts in the database. random_page_cost Default value: 4.0 Multiplier value for determining the length of time it takes for the disk to seek a random disk page. SAP HANA The following properties are applicable to the SAP HANA database. These settings are used by the Platform for the connection towards the MediationZone database, and by ECs for connections towards external databases. Property Description Property Description saphana.connectionpool.maxlimit Default value: 10 This property specifies the maximum number of connections in the pool. It is recommended that the value is set to 3 or greater. A usual setting would be between 10 and 100.",
    "title": "Database Properties - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352119666/Database+Properties",
    "word_count": 686,
    "char_count": 4852
  }
]