[
  {
    "chunk_id": 1,
    "text": "This Web Service Requester workflow consists of the following agents: TCP_IP_1: Collects the input data. Analysis_1: Creates the UDR type WSCycle_charge and routes it to the Web Service Requester Web Service Requester (Processing): Sends a request to a Web Service server. Once the web server replies, the Web Service Requester forwards the reply to Analysis_2. Analysis_2: Receives the Web Service reply. In this example, we use this agent for output demonstration. Open Configuring the Agents In the Workflow Editor, open the configuration views of both agents. In the TCP_IP agent configuration view, set the Port to 3210. Note! This port number should not be the same one that the Web Service Provider is configured with. In the Analysis_1 agent configuration view, enter the following APL code into the text pane: import ultra.ws.example.charge.cycles; import ultra.ws.example.charge.x1; consume { // Create a WSCycle_charge UDR WSCycle_charge udr = udrCreate(WSCycle_charge); // Creaete a Charger UDR as parameter udr.param = udrCreate(Charge); // Populate the parameter with data udr.param.chargingEvent = udrCreate(ChargingEvent); udr.param.chargingEvent.amount = 0.50; udr.param.chargingEvent.id = \"0123456789\"; udr.param.serviceType = \"SMS\"; // Route the UDR udrRoute(udr); } To enter the UDR type, click on the Set To Input button. The type bytearray appears on the UDR types list. In the Web Service Agent Configuration tab, click on the Browse... button to enter the WS profile. To automatically set the HTTP address, click on the Extract Profile Settings button. Note! In this example the HTTP address is http://localhost:8080/charge . This is the same address that the Web Service Provider is assigned. Using the same address both in the Provider agent as well as in the Requester agent enables the Web Service Requester workflow to act as a client of the Web Service Provider workflow. In the Analysis_2 Configuration view, enter the following APL code into the text pane: consume { debug(input); } Click on the Set To Input button. bytearray will appear on the UDR types list.",
    "title": "Web Service Example - Creating a Web Service Request Workflow - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352181234/Web+Service+Example+-+Creating+a+Web+Service+Request+Workflow",
    "word_count": 318,
    "char_count": 2093
  }
]