[
  {
    "chunk_id": 1,
    "text": "During the upgrade process, always use the default application user, mzadmin, along with the correct password when prompted. Upgrading the Platform Container To upgrade the platform container: Go to the Release Content Directory which is the directory created during the extraction of the delivered *.tgz file in the Upgrade Preparation step. Execute the Upgrade Command to initiate the upgrade process. Pre-upgrade validations will be performed to verify the environment and configuration, ensuring a seamless upgrade experience. ./setup.sh upgrade If the upgrade validation fails, there is no need to perform a rollback or restore, as the upgrade process has not yet begun. Note! If validation fails but you choose to proceed, you can run the following command: ./setup.sh upgrade -skip-validate Caution! You can choose to skip validation, but be aware that this bypasses checks for potential issues in your environment and configuration. If there are undetected problems, the upgrade may fail or cause unexpected behavior. Proceed with caution and ensure you have backups before continuing. To perform validation without starting the upgrade, run the following command: ./setup.sh upgrade -validate-only Monitor the upgrade progress. The ./setup.sh upgrade command generates a setup log file in the $MZ_HOME/log directory. To monitor the upgrade progress in real-time, use the following command in a separate window: tail -f $MZ_HOME/log/setup-9.4.0.0.log Rollback in case of failure. If the upgrade is aborted and a rollback is necessary, use the backups created during the https://infozone.atlassian.net/wiki/spaces/MD94/pages/472121478 . Delete the contents in $MZ_HOME and copy the backup mzhome back to the $MZ_HOME. Restore MZDB in database with the backup. Kill all processes and restart platform/ec. Note! If any configurations become invalid during the upgrade, these will be listed in the log file. There is no cause for concern, as configuration errors will be solved when importing the upgraded configuration done as part of the preparation for upgrade procedures. Example - Output in the upgrade_<timestamp>.log file with invalid configurations. Mon Nov 19 10:52:10 CET 2013 Regenerating configs The following configurations changed status and may require manual attention: Workflow Test.WF1 became invalid, Workflow Test.WF2 became invalid, APL Code Test.apl_profile became invalid, Platform Container Post-Upgrade Steps The following post-upgrade steps need to be performed: Start the Platform if it is not running Run the first command to verify the Platform is running. Start it if necessary: mzsh status mzsh startup platform Start Desktop by running the following commands: mzsh startup ui Desktop is accessible in a browser at: http(s)://<host>:9001/desktop/ Hint! Default port: 9001 . If this was changed during the upgrade install.xml parameter ui.webserver.port use the updated value. If you need to modify the UI port, execute this command and restart the ui process: mzsh topo set topo://container:<platform-container>/pico:ui/val:config.properties.ui.webserver.port <port-number> Note! The Legacy Desktop is also available, but will be phased out in future major release. Download and install the Desktop launcher: https://infozone.atlassian.net/wiki/spaces/MD94/pages/352147511 . Ensure you run Java 17 locally. Import the Upgraded Configuration from step https://infozone.atlassian.net/wiki/spaces/MD94/pages/547128090 . You can import the upgraded configuration either via the UI or using the following command: mzsh <username>/<password> systemimport <file to import>.zip Regenerate configurations. Run the following command to regenerate configurations: mzsh regenerateconfigs",
    "title": "Upgrade Platform Container from 8.3 to 9.4 - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/472121542/Upgrade+Platform+Container+from+8.3+to+9.4",
    "word_count": 514,
    "char_count": 3710
  }
]