[
  {
    "chunk_id": 1,
    "text": "To open the ECS collection agent configuration, click Configuration  New Configuration . Select Workflow from the Configurations dialog. When prompted to Select workflow type , select Batch . Click Add agent and select ECS from the Agent Selection dialog. Double-click the agent icon or right-click the icon and select Edit agent to display the Agent Configuration dialog. You either collect data from a Reprocessing Group defined in the ECS Inspector or from a Saved Filter defined in the ECS Inspector. The settings in the configuration dialog depend on which option you choose. Note! The default directory, used to store UDRs and batches routed to the ECS, is $MZ_HOME/ecs . Open Setting Description Setting Description Reprocessing Group Select this checkbox to collect data from a predefined Reprocessing Group . The groups in the Reprocessing Group list are suffixed with their type - batch or UDR . Reprocessing groups are defined in the ECS Inspector. Collected UDRs or batches are automatically marked as Reprocessed state. Reprocessed data can be collected again, if the state is manually changed back to New in the ECS Inspector. Saved Filter (Read Only) Select this checkbox to collect data defined by a filter saved in the ECS Inspector. Saved Filter is limited to read-only collection and is applicable only when collecting error UDRs . In order for UDRs to be collectible, they must match the search criteria in the selected filter. The collected UDRs using Saved Filter will not be updated to Reprocessed State. Collection Size This field is enabled when a UDR Reprocessing Group is selected. The value defines how many UDRs to collect before the ECS collection agent finishes the current batch and starts a new one. The valid range is 1,000 to 100,000 UDRs. A higher value requires more memory and can have an impact on performance. SQL Bulk Size To improve performance, data records are retrieved in bulk. The SQL Bulk Size value specifies how many records are included in each bulk. The valid range is 1 to 1000, with a default value of 20. Routed Types A group of UDRs can consist of several format types. Select Add to display the UDR Internal Format Browser. Select the type or types to collect. Any UDRs in the Reprocessing Group that do not match the selected types are ignored. If Routed Types is empty, all UDR types are routed as DRUDR type. This field is enabled for selection when a UDR-type Reprocessing Group or Saved Filter is selected.",
    "title": "ECS Collection Agent Configuration - MediationZone Documentation 9.4 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352110208",
    "word_count": 414,
    "char_count": 2468
  }
]