[
  {
    "chunk_id": 1,
    "text": "Menu Search field   Sign In  +1 Get Certified For Teachers Spaces Plus Get Certified For Teachers Spaces Plus   HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST HTML Tutorial HTML HOME HTML Introduction HTML Editors HTML Basic HTML Elements HTML Attributes HTML Headings HTML Paragraphs HTML Styles HTML Formatting HTML Quotations HTML Comments HTML Colors Colors RGB HEX HSL HTML CSS HTML Links Links Link Colors Link Bookmarks HTML Images Images Image Map Background Images The Picture Element HTML Favicon HTML Page Title HTML Tables HTML Tables Table Borders Table Sizes Table Headers Padding & Spacing Colspan & Rowspan Table Styling Table Colgroup HTML Lists Lists Unordered Lists Ordered Lists Other Lists HTML Block & Inline HTML Div HTML Classes HTML Id HTML Iframes HTML JavaScript HTML File Paths HTML Head HTML Layout HTML Responsive HTML Computercode HTML Semantics HTML Style Guide HTML Entities HTML Symbols HTML Emojis HTML Charsets HTML URL Encode HTML vs. XHTML HTML Forms HTML Forms HTML Form Attributes HTML Form Elements HTML Input Types HTML Input Attributes Input Form Attributes HTML Graphics HTML Canvas HTML SVG HTML Media HTML Media HTML Video HTML Audio HTML Plug-ins HTML YouTube HTML APIs HTML Web APIs HTML Geolocation HTML Drag and Drop HTML Web Storage HTML Web Workers HTML SSE HTML Examples HTML Examples HTML Editor HTML Quiz HTML Exercises HTML Website HTML Syllabus HTML Study Plan HTML Interview Prep HTML Bootcamp HTML Certificate HTML Summary HTML Accessibility HTML References HTML Tag List HTML Attributes HTML Global Attributes HTML Browser Support HTML Events HTML Colors HTML Canvas HTML Audio/Video HTML Doctypes HTML Character Sets HTML URL Encode HTML Lang Codes HTTP Messages HTTP Methods PX to EM Converter Keyboard Shortcuts HTML Website Hosting  Previous Next  Create Website with HTML Host Websites with W3Schools Spaces Get Started for Free Practice Coding Skills kAI AI Tutor Build Projects Host Securely Choose your Plan By subscribing to a plan you support the W3Schools mission to make learning available to everyone - no matter their background. Monthly Annually Free $0 /Forever This is for you that are beginning to explore coding and web development Track your progress Set your goals Build and host 1 static website 100 credits/month Access various AI features like W3Schools kAI coding tutor and interview preparation. No support Get Free W3Schools Plus $14.99 /Month This is for you that want to learn and reach your goals faster. Build fullstack projects, ad free experience. Ad-free experience Unlimited challenges Unlimited practice tests Build and host 15 static websites Build and host 1 full stack server Choose from 75+ templates 10000 credits/month Access various AI features like W3Schools kAI coding tutor and interview preparation. Cancel anytime Get Plus W3Schools Academy For teachers Spend less time on admin tasks while engaging your students. Help them learn, practice and collaborate. All in one place. Ad-free for focused learning Dashboard to manage your classroom Study plans for structured learning Track progress with insights Interactive code challenges and projects Access to all courses and certification exams Spaces for building and publishing projects Get More Info NEW SUBSCRIBER DEAL 25% OFF FOR A YEAR USE PROMO CODE: SPACES25 Want custom domains? You can also buy a domain or connect an existing one. Looking to add multiple users? Read here for how to get in touch Powerful Code Editor Front-end, Back-end or Full-stack - the choice is yours Practice Makes Perfect Sharpen and Master your development skills with these technologies using Spaces . Get Started for Free Save Time with Templates Build powerful websites in just a few clicks Portfolio Blog Webshop Tutor Explore All Templates Get Started for Free k AI Just landed in Spaces Learn to code more effectively and intelligently with kAI - AI tutor Get Started for Free Hi! I'm kAI, W3Schools AI Tutor... Feel free to ask me any coding-related questions, and I'll do my best to assist you. I can help you checking your code for errors, improving your code's structure, explaining coding concepts in a clear and understandable way, and more... I can even create complete websites for you based on your input, so what are you waiting for? Super Simple to Share Host and Publish Websites in no time Included for free in all plans W3Schools subdomain, hosting, and SSL certificate. Want custom domains? Buy a domain or transfer an existing one and connect it to your space. How it works 1. Join W3Schools - and create a space 2. Choose a template - or start from scratch 3. Edit code directly in your browser 4. Share your website with the world Coding Made Easy All at your fingertips with our easy-to-use code editor Cloud-based Terminal & Log How To Libraries Database File Navigator Package Manager Analytics Environment Manager Get Started for Free Cloud-Based Save Time & Money. No installation required. Access everything in your browser. Get started in seconds. Get Started for Free File Navigator All Your Files in One Place. Find and switch easily between your code files without leaving the code editor. Get Started for Free Terminal and Log Fix Your Code Faster. Monitor your code, debug and troubleshoot your work during the development process. Get Started for Free Database Get Full Data Visibility. Find and preview all the data stored in your website. Anytime, from anywhere. Get Started for Free Environment Manager Increased Control and Security. Control your website access points to establish secure connections. Get Started for Free Package Manager Find What You Need Quicker. Search and install frameworks and libraries in just one click. Get Started for Free User Analytics Get Traffic Insights. Learn from your website visitors to deliver a better user experience. Get Started for Free Get Inspired Connect and share your website with the community to get instant feedback Get Started for Free Frequently Asked Questions What's the difference between 'Basic' and 'Full Stack' Spaces? With Basic Spaces, you can build frontend websites. Whereas with Fullstack Spaces, you can build frontend and backend websites. Which programming languages are included in 'Basic' and 'Full Stack' Spaces? Basic Spaces include HTML, CSS, and Javascript. Full Stack Spaces include everything in Basic Spaces plus PHP, Python, React.js, Vue.js, Node.js, Handlebars, and Django. How are subscriptions renewed? Your subscription will be automatically renewed every month. What happens if I cancel my subscription? Your access to all the benefits for the paid period of time will continue. However, the subscription will not be renewed automatically. Can I subscribe to multiple accounts at once? To subscribe W3Schools accounts for multiple users, you can contact sales@w3schools.com Have some other questions? Visit our support page Subscribe for $14.99/Month Cancel anytime.  Previous Next   +1 Track your progress - it's free! Log in Sign Up COLOR PICKER PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US  Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference Angular Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS .",
    "title": "Create HTML Website Server | W3Schools.com | W3Schools Spaces",
    "url": "https://www.w3schools.com/html/html_website.asp",
    "word_count": 1387,
    "char_count": 8857
  }
]