[
  {
    "chunk_id": 1,
    "text": "Menu Search field   Sign In  +1 Get Certified For Teachers Spaces Plus Get Certified For Teachers Spaces Plus   HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST HTML Tutorial HTML HOME HTML Introduction HTML Editors HTML Basic HTML Elements HTML Attributes HTML Headings HTML Paragraphs HTML Styles HTML Formatting HTML Quotations HTML Comments HTML Colors Colors RGB HEX HSL HTML CSS HTML Links Links Link Colors Link Bookmarks HTML Images Images Image Map Background Images The Picture Element HTML Favicon HTML Page Title HTML Tables HTML Tables Table Borders Table Sizes Table Headers Padding & Spacing Colspan & Rowspan Table Styling Table Colgroup HTML Lists Lists Unordered Lists Ordered Lists Other Lists HTML Block & Inline HTML Div HTML Classes HTML Id HTML Iframes HTML JavaScript HTML File Paths HTML Head HTML Layout HTML Responsive HTML Computercode HTML Semantics HTML Style Guide HTML Entities HTML Symbols HTML Emojis HTML Charsets HTML URL Encode HTML vs. XHTML HTML Forms HTML Forms HTML Form Attributes HTML Form Elements HTML Input Types HTML Input Attributes Input Form Attributes HTML Graphics HTML Canvas HTML SVG HTML Media HTML Media HTML Video HTML Audio HTML Plug-ins HTML YouTube HTML APIs HTML Web APIs HTML Geolocation HTML Drag and Drop HTML Web Storage HTML Web Workers HTML SSE HTML Examples HTML Examples HTML Editor HTML Quiz HTML Exercises HTML Website HTML Syllabus HTML Study Plan HTML Interview Prep HTML Bootcamp HTML Certificate HTML Summary HTML Accessibility HTML References HTML Tag List HTML Attributes HTML Global Attributes HTML Browser Support HTML Events HTML Colors HTML Canvas HTML Audio/Video HTML Doctypes HTML Character Sets HTML URL Encode HTML Lang Codes HTTP Messages HTTP Methods PX to EM Converter Keyboard Shortcuts HTML Versus XHTML  Previous Next  XHTML is a stricter, more XML-based version of HTML. What is XHTML? XHTML stands for E X tensible H yper T ext M arkup L anguage XHTML is a stricter, more XML-based version of HTML XHTML is HTML defined as an XML application XHTML is supported by all major browsers Why XHTML? XML is a markup language where all documents must be marked up correctly (be \"well-formed\"). XHTML was developed to make HTML more extensible and flexible to work with other data formats (such as XML). In addition, browsers ignore errors in HTML pages, and try to display the website even if it has some errors in the markup. So XHTML comes with a much stricter error handling. If you want to study XML, please read our XML Tutorial . The Most Important Differences from HTML <!DOCTYPE> is mandatory The xmlns attribute in <html> is mandatory <html>, <head>, <title>, and <body> are mandatory Elements must always be properly nested Elements must always be closed Elements must always be in lowercase Attribute names must always be in lowercase Attribute values must always be quoted Attribute minimization is forbidden XHTML - <!DOCTYPE ....> Is Mandatory An XHTML document must have an XHTML <!DOCTYPE> declaration. The <html>, <head>, <title>, and <body> elements must also be present, and the xmlns attribute in <html> must specify the xml namespace for the document. Example Here is an XHTML document with a minimum of required tags: <!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.1//EN\" \"http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd\"> <html xmlns=\"http://www.w3.org/1999/xhtml\"> <head> <title>Title of document</title> </head> <body> some content here... </body> </html> XHTML Elements Must be Properly Nested In XHTML, elements must always be properly nested within each other, like this: Correct: <b><i>Some text</i></b> Wrong: <b><i>Some text</b></i> XHTML Elements Must Always be Closed In XHTML, elements must always be closed, like this: Correct: <p>This is a paragraph</p> <p>This is another paragraph</p> Wrong: <p>This is a paragraph <p>This is another paragraph XHTML Empty Elements Must Always be Closed In XHTML, empty elements must always be closed, like this: Correct: A break: <br /> A horizontal rule: <hr /> An image: <img src=\"happy.gif\" alt=\"Happy face\" /> Wrong: A break: <br> A horizontal rule: <hr> An image: <img src=\"happy.gif\" alt=\"Happy face\"> XHTML Elements Must be in Lowercase In XHTML, element names must always be in lowercase, like this: Correct: <body> <p>This is a paragraph</p> </body> Wrong: <BODY> <P>This is a paragraph</P> </BODY> XHTML Attribute Names Must be in Lowercase In XHTML, attribute names must always be in lowercase, like this: Correct: <a href=\"https://www.w3schools.com/html/\">Visit our HTML tutorial</a> Wrong: <a HREF=\"https://www.w3schools.com/html/\">Visit our HTML tutorial</a> XHTML Attribute Values Must be Quoted In XHTML, attribute values must always be quoted, like this: Correct: <a href=\"https://www.w3schools.com/html/\">Visit our HTML tutorial</a> Wrong: <a href=https://www.w3schools.com/html/>Visit our HTML tutorial</a> XHTML Attribute Minimization is Forbidden In XHTML, attribute minimization is forbidden: Correct: <input type=\"checkbox\" name=\"vehicle\" value=\"car\" checked=\"checked\" /> <input type=\"text\" name=\"lastname\" disabled=\"disabled\" /> Wrong: <input type=\"checkbox\" name=\"vehicle\" value=\"car\" checked /> <input type=\"text\" name=\"lastname\" disabled /> Validate HTML With The W3C Validator Put your web address in the box below:  Previous Next   +1 Track your progress - it's free! Log in Sign Up COLOR PICKER PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US  Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference Angular Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS .",
    "title": "HTML Versus XHTML",
    "url": "https://www.w3schools.com/html/html_xhtml.asp",
    "word_count": 1075,
    "char_count": 7220
  }
]