[
  {
    "chunk_id": 1,
    "text": "Menu Search field   Sign In  +1 Get Certified For Teachers Spaces Plus Get Certified For Teachers Spaces Plus   HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SASS VUE GEN AI SCIPY CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING BASH RUST HTML Tutorial HTML HOME HTML Introduction HTML Editors HTML Basic HTML Elements HTML Attributes HTML Headings HTML Paragraphs HTML Styles HTML Formatting HTML Quotations HTML Comments HTML Colors Colors RGB HEX HSL HTML CSS HTML Links Links Link Colors Link Bookmarks HTML Images Images Image Map Background Images The Picture Element HTML Favicon HTML Page Title HTML Tables HTML Tables Table Borders Table Sizes Table Headers Padding & Spacing Colspan & Rowspan Table Styling Table Colgroup HTML Lists Lists Unordered Lists Ordered Lists Other Lists HTML Block & Inline HTML Div HTML Classes HTML Id HTML Iframes HTML JavaScript HTML File Paths HTML Head HTML Layout HTML Responsive HTML Computercode HTML Semantics HTML Style Guide HTML Entities HTML Symbols HTML Emojis HTML Charsets HTML URL Encode HTML vs. XHTML HTML Forms HTML Forms HTML Form Attributes HTML Form Elements HTML Input Types HTML Input Attributes Input Form Attributes HTML Graphics HTML Canvas HTML SVG HTML Media HTML Media HTML Video HTML Audio HTML Plug-ins HTML YouTube HTML APIs HTML Web APIs HTML Geolocation HTML Drag and Drop HTML Web Storage HTML Web Workers HTML SSE HTML Examples HTML Examples HTML Editor HTML Quiz HTML Exercises HTML Website HTML Syllabus HTML Study Plan HTML Interview Prep HTML Bootcamp HTML Certificate HTML Summary HTML Accessibility HTML References HTML Tag List HTML Attributes HTML Global Attributes HTML Browser Support HTML Events HTML Colors HTML Canvas HTML Audio/Video HTML Doctypes HTML Character Sets HTML URL Encode HTML Lang Codes HTTP Messages HTTP Methods PX to EM Converter Keyboard Shortcuts HTML Attributes  Previous Next  HTML attributes provide additional information about HTML elements. HTML Attributes All HTML elements can have attributes Attributes provide additional information about elements Attributes are always specified in the start tag Attributes usually come in name/value pairs like: name=\"value\" The href Attribute The <a> tag defines a hyperlink. The href attribute specifies the URL of the page the link goes to: Example <a href=\"https://www.w3schools.com\">Visit W3Schools</a> Try it Yourself  You will learn more about links in our HTML Links chapter . The src Attribute The <img> tag is used to embed an image in an HTML page. The src attribute specifies the path to the image to be displayed: Example <img src=\"img_girl.jpg\"> Try it Yourself  There are two ways to specify the URL in the src attribute: 1. Absolute URL - Links to an external image that is hosted on another website. Example: src=\"https://www.w3schools.com/images/img_girl.jpg\" . Notes: External images might be under copyright. If you do not get permission to use it, you may be in violation of copyright laws. In addition, you cannot control external images; it can suddenly be removed or changed. 2. Relative URL - Links to an image that is hosted within the website. Here, the URL does not include the domain name. If the URL begins without a slash, it will be relative to the current page. Example: src=\"img_girl.jpg\". If the URL begins with a slash, it will be relative to the domain. Example: src=\"/images/img_girl.jpg\". Tip: It is almost always best to use relative URLs. They will not break if you change domain. The width and height Attributes The <img> tag should also contain the width and height attributes, which specify the width and height of the image (in pixels): Example <img src=\"img_girl.jpg\" width=\"500\" height=\"600\"> Try it Yourself  The alt Attribute The required alt attribute for the <img> tag specifies an alternate text for an image, if the image for some reason cannot be displayed. This can be due to a slow connection, or an error in the src attribute, or if the user uses a screen reader. Example <img src=\"img_girl.jpg\" alt=\"Girl with a jacket\"> Try it Yourself  Example See what happens if we try to display an image that does not exist: <img src=\"img_typo.jpg\" alt=\"Girl with a jacket\"> Try it Yourself  You will learn more about images in our HTML Images chapter . The style Attribute The style attribute is used to add styles to an element, such as color, font, size, and more. Example <p style=\"color:red;\">This is a red paragraph.</p> Try it Yourself  You will learn more about styles in our HTML Styles chapter . The lang Attribute You should always include the lang attribute inside the <html> tag, to declare the language of the Web page. This is meant to assist search engines and browsers. The following example specifies English as the language: <!DOCTYPE html> <html lang=\"en\"> <body> ... </body> </html> Country codes can also be added to the language code in the lang attribute. So, the first two characters define the language of the HTML page, and the last two characters define the country. The following example specifies English as the language and United States as the country: <!DOCTYPE html> <html lang=\"en-US\"> <body> ... </body> </html> You can see all the language codes in our HTML Language Code Reference . The title Attribute The title attribute defines some extra information about an element. The value of the title attribute will be displayed as a tooltip when you mouse over the element: Example <p title=\"I'm a tooltip\">This is a paragraph.</p> Try it Yourself  We Suggest: Always Use Lowercase Attributes The HTML standard does not require lowercase attribute names. The title attribute (and all other attributes) can be written with uppercase or lowercase like title or TITLE . However, W3C recommends lowercase attributes in HTML, and demands lowercase attributes for stricter document types like XHTML. At W3Schools we always use lowercase attribute names. We Suggest: Always Quote Attribute Values The HTML standard does not require quotes around attribute values. However, W3C recommends quotes in HTML, and demands quotes for stricter document types like XHTML. Good: <a href=\"https://www.w3schools.com/html/\">Visit our HTML tutorial</a> Bad: <a href=https://www.w3schools.com/html/>Visit our HTML tutorial</a> Sometimes you have to use quotes. This example will not display the title attribute correctly, because it contains a space: Example <p title=Description of W3Schools> Try it Yourself  At W3Schools we always use quotes around attribute values. Single or Double Quotes? Double quotes around attribute values are the most common in HTML, but single quotes can also be used. In some situations, when the attribute value itself contains double quotes, it is necessary to use single quotes: <p title='John \"ShotGun\" Nelson'> Or vice versa: <p title=\"John 'ShotGun' Nelson\"> Try it Yourself  Chapter Summary All HTML elements can have attributes The href attribute of <a> specifies the URL of the page the link goes to The src attribute of <img> specifies the path to the image to be displayed The width and height attributes of <img> provide size information for images The alt attribute of <img> provides an alternate text for an image The style attribute is used to add styles to an element, such as color, font, size, and more The lang attribute of the <html> tag declares the language of the Web page The title attribute defines some extra information about an element HTML Attribute Reference A complete list of all attributes for each HTML element, is listed in our: HTML Attribute Reference . Video: HTML Attributes  Previous Next   +1 Track your progress - it's free! Log in Sign Up COLOR PICKER PLUS SPACES GET CERTIFIED FOR TEACHERS FOR BUSINESS CONTACT US  Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference Angular Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookie and privacy policy . Copyright 1999-2025 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS .",
    "title": "HTML Attributes",
    "url": "https://www.w3schools.com/html/html_attributes.asp",
    "word_count": 1479,
    "char_count": 9401
  }
]