{
  "id": "wiki__spaces__MD93__pages__496730317__Supervision_Service",
  "title": "Supervision Service - MediationZone Documentation 9.3 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/496730317/Supervision+Service",
  "categories": [
    "space:MD93"
  ],
  "text": "The Supervision Service allows you to define actions based on specific conditions using decision tables. Depending on which conditions are met, the service can log messages in the System Log, apply an overload protection configuration, or generate an event. You can configure these conditions using any available MIMs in the workflow, such as throughput or queue size. You can also manually trigger the Supervision Service using mzsh commands for maintenance or other purposes. After manual activation, you must switch it back to automatic mode for the settings in the Services tab to retake effect. Open Supervision Service concept Configuration of the Supervision Service To open the Supervision Service configuration, open the Workflow Properties dialog in a real-time workflow configuration, click on the Services tab, click click Add Service , select the Supervision option, and click OK . Open Supervision configuration - Workflow properties Services tab Setting Description Setting Description Execution Interval (ms) Enter the time interval, in milliseconds, with which current MIM values should be checked against the conditions in the decision tables. This configuration will be valid for all decision tables. Decision Tables A Decision Table holds the conditions you set and the actions that are meant to happen when those conditions are met. All the decision tables you configure will be listed in this section. Click Add to add a new decision table. We recommend configuring different decision tables for different purposes, for example, one for aggregation rules and one for data enrichment. Note! You can change the order of your decision tables, but this does not affect the functionality. All decision tables will be applied. Creating a Decision Table Click to add a new decision table, the Add Decision Tables dialog opens. This is where you configure a Decision Table. In a Decision Table, actions are triggered based on predefined conditions. Conditions and actions are configured separately. Open Add Decision Table dialogue Setting Description Setting Description Decision Table Enter a name for your decision table in the Name field. Table Parameters Click the buttons Action Lists and Conditions Lists to configure the different conditions and actions for this table. Decisions Each configured condition list will be displayed in the Conditions column. Each of these conditions can be set to either True , False or - . If you want to add more columns to set up different combinations of conditions, you can right-click the Action column heading and select to add more columns. For each column with a condition combination, you can then select which action to take in the drop-down list containing all configured actions. Configure Decision tables - high level steps Configure the conditions. The conditions you configure are based on different MIM parameters having defined values. Configure the actions. Depending on your workflow configuration you can select different options when configuring the actions. These options are: Generate a Supervision event to reject messages Log an entry in the System Log Add Overload Protection to reject messages (this option is only available if you have Radius or Diameter collection agents in your workflow). Note! If you are using Diameter or Radius Collection agents in your workflow, you can also select from a range of Diameter and Radius specific overload protection strategies in order to only reject specific types of messages. See https://infozone.atlassian.net/wiki/x/RJIyD and https://infozone.atlassian.net/wiki/x/14dCD for further information about these strategies. Set the newly created conditions to True , False or - (ignore), then select an action for each one. Note! When a condition is evaluated to true, the corresponding action will be performed only once, until any other condition is also evaluated to true. Generally, this means that a minimum of two conditions are required in the decision table. Set a name for the decision table if you havent already done so. Click Add . The decision table is added and you can repeat steps 1 to 4 to add additional tables. Open Multiple Decision Tables added in the Services tab Configure Conditions 1. From the Add Decision Tables dialog, click Condition Lists. Open 2. Click Add to open the Add Conditions dialog. Open Condition List dialogue 3. Click Add to add conditions. Open Add Condition List dialogue In the Add Condition dialogue: Open Add Condition dialogue Add Condition option Description Add Condition option Description Left Operand Select the MIM Field that you want to add your condition to. Operator list This is the drop-down list located between the two operands. Select from: > (greater than) < (less than) == (equals) != (does not equal) Right Operand Select either the MIM Field against which the selected left operand will be compared, or add a constant value. Click Add to add the condition to the condition list. Repeat steps 4 to 5 until you have added all the conditions you want to have in the condition list and then click Close when you are finished. You will return to the Add Condition List dialog. Enter a name for the condition list in the Name field. In the Match field select if you want all the conditions in the list to be matched or, if only one condition is required to match by selecting either of the buttons Any of the Following or All of the Following . Open Add Condition List dialogue Click Add to add the condition list in the Add Decision Table s dialog. Repeat steps 3 to 9 until you have created all the condition lists you want to have and then click Close when you are finished. You will return to the Add Decision Tables dialog. Open Add Decision Tables dialogue - with a Condition List Now that you are back in the Decision Table dialog you can create the actions for the condition lists. Configure Actions To configure actions: In the Add Decision Tables dialog, click the Action Lists button. Click the Add button to open the Add Actions dialog. Click the Add button to add actions. Open Add Actions process In this dialog, select which type of action you want to use; System Log , Overload Protection, or Supervision Event . Depending on what you choose, the options in the dialog differ. Add Action option Description Add Action option Description Action Select from the following: System Log - add a notification to the system log. Supervision Event - To generate an event that can be sent to various targets depending on how you configure your Event Notifications, see https://infozone.atlassian.net/wiki/x/u4Q4D . Overload Protection - Overload Protection - Add an overload protection service Note! You will only see the option for an Overload Protection If you have Diameter or Radius Collection agents in your workflow. Description Enter a description for the action. Reject This option is only available when you have selected to configure an Overload Protection action and determines the percentage of requests that should be rejected; 0, 25, 50, or 100 %. Strategy This option is only available when you have selected to configure an Overload Protection action and determines if you want to apply this action on all types of requests or if you only want to apply them to the requests following a selected Diameter or Radius overload protection strategy. Content This option is only available when you have selected to configure a Supervision Event action and it determines the content of the event. See Event Types for more information. Severity This option is only available when you have selected to configure a System Log action and it determines the severity of the log entry; Information, Warning, Error, or Disaster. Message This option is only available when you have selected to configure a System Log action and allows you to enter a message that will be visible in the System Log. Expand the sub-steps for the option you selected If you have selected an Overload Protection action: If you have selected a Supervision Event action: If you have selected a System Log action: Click Add to add the action to the action list. Repeat steps 4 to 5 until you have added all the required actions to the action list and then click Close. You will return to the Add Action List dialogue. Open Add Action List dialogue Add a name and click the Add button to add the action list in the Create Decision Tables dialog. Setting Description Setting Description List Enter a name for the action list in the Name field. Action This section contains all the actions you have added to this list. Repeat steps 1 to 8 until you have created all the necessary action lists then click Close. You will return to the Create Decision Tables dialog. Configuring a Decision Table In the Decision Table tab you will now have two columns; Conditions and Actions . Open Add Decision Table dialogue The Conditions column lists all the condition sets you have created. In the Actions column, you can set each condition to True , False , or - (Ignore), and then choose which action to trigger when the decision table criteria are met. If you have multiple conditions, various combinations may require different actions. To add another action column, right-click the Actions column heading and select Add Column... . You can repeat this process to define actions for all necessary condition combinations. Note! Only one action can be selected for each set of combinations. Note! When a condition is evaluated to true, the corresponding action will be performed only once, until any other condition is also evaluated to true. Generally, this means that a minimum of two conditions are required in the decision table. Example - Decision Table Open Decision Table configuration example The following actions will be taken during the following conditions: Case 1 If the Incoming messages exceed 50, a Supervision Event will be triggered. Case 2 If the Incoming messages exceed 100, 25 % of the incoming Diameter Credit-Control Initial requests will be rejected. Case 3 If the Incoming messages exceed 150, 100 % of the incoming Diameter Credit-Control Initial requests will be rejected. MZSH Commands If you need to manually trigger or clear the supervision service with action overload, for example, for maintenance or other purposes, you can use the mzsh wfcommand . See https://infozone.atlassian.net/wiki/x/MRRCD for more information.",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "The Supervision Service allows you to define actions based on specific conditions using decision tables. Depending on which conditions are met, the service can log messages in the System Log, apply an overload protection configuration, or generate an event. You can configure these conditions using any available MIMs in the workflow, such as throughput or queue size. You can also manually trigger the Supervision Service using mzsh commands for maintenance or other purposes. After manual activation, you must switch it back to automatic mode for the settings in the Services tab to retake effect. Open Supervision Service concept Configuration of the Supervision Service To open the Supervision Service configuration, open the Workflow Properties dialog in a real-time workflow configuration, click on the Services tab, click click Add Service , select the Supervision option, and click OK . Open Supervision configuration - Workflow properties Services tab Setting Description Setting Description Execution Interval (ms) Enter the time interval, in milliseconds, with which current MIM values should be checked against the conditions in the decision tables. This configuration will be valid for all decision tables. Decision Tables A Decision Table holds the conditions you set and the actions that are meant to happen when those conditions are met. All the decision tables you configure will be listed in this section. Click Add to add a new decision table. We recommend configuring different decision tables for different purposes, for example, one for aggregation rules and one for data enrichment. Note! You can change the order of your decision tables, but this does not affect the functionality. All decision tables will be applied. Creating a Decision Table Click to add a new decision table, the Add Decision Tables dialog opens. This is where you configure a Decision Table. In a Decision Table, actions are triggered based on predefined conditions. Conditions and actions are configured separately. Open Add Decision Table dialogue Setting Description Setting Description Decision Table Enter a name for your decision table in the Name field. Table Parameters Click the buttons Action Lists and Conditions Lists to configure the different conditions and actions for this table. Decisions Each configured condition list will be displayed in the Conditions column. Each of these conditions can be set to either True , False or - . If you want to add more columns to set up different combinations of conditions, you can right-click the Action column heading and select to add more columns. For each column with a condition combination, you can then select which action to take in the drop-down list containing all configured actions. Configure Decision tables - high level steps Configure the conditions. The conditions you configure are based on different MIM parameters having defined values. Configure the actions. Depending on your workflow configuration you can select different options when configuring the actions. These options are: Generate a Supervision event to reject messages Log an entry in the System Log Add Overload Protection to reject messages (this option is only available if you have Radius or Diameter collection agents in your workflow). Note! If you are using Diameter or Radius Collection agents in your workflow, you can also select from a range of Diameter and Radius specific overload protection strategies in order to only reject specific types of messages. See https://infozone.atlassian.net/wiki/x/RJIyD and https://infozone.atlassian.net/wiki/x/14dCD for further information about these strategies. Set the newly created conditions to True , False or - (ignore), then select an action for each one. Note! When a condition is evaluated to true, the corresponding action will be performed only once, until any other condition is also evaluated to true. Generally, this means that a minimum of two conditions are required in the decision table. Set a name for the decision table if you havent already done so. Click Add . The decision table is added and you can repeat steps 1 to 4 to add additional tables. Open Multiple Decision Tables added in the Services tab Configure Conditions 1. From the Add Decision Tables dialog, click Condition Lists. Open 2. Click Add to open the Add Conditions dialog. Open Condition List dialogue 3. Click Add to add conditions. Open Add Condition List dialogue In the Add Condition dialogue: Open Add Condition dialogue Add Condition option Description Add Condition option Description Left Operand Select the MIM Field that you want to add your condition to. Operator list This is the drop-down list located between the two operands. Select from: > (greater than) < (less than) == (equals) != (does not equal) Right Operand Select either the MIM Field against which the selected left operand will be compared, or add a constant value. Click Add to add the condition to the condition list. Repeat steps 4 to 5 until you have added all the conditions you want to have in the condition list and then click Close when you are finished. You will return to the Add Condition List dialog. Enter a name for the condition list in the Name field. In the Match field select if you want all the conditions in the list to be matched or, if only one condition is required to match by selecting either of the buttons Any of the Following or All of the Following . Open Add Condition List dialogue Click Add to add the condition list in the Add Decision Table s dialog. Repeat steps 3 to 9 until you have created all the condition lists you want to have and then click Close when you are finished. You will return to the Add Decision Tables dialog. Open Add Decision Tables dialogue - with a Condition List Now that you are back in the Decision Table dialog you can create the actions for the condition lists. Configure Actions To configure actions: In the Add Decision Tables dialog, click the Action Lists button. Click the Add button to open the Add Actions dialog. Click the Add button to add actions. Open Add Actions process In this dialog, select which type of action you want to use; System Log , Overload Protection, or Supervision Event . Depending on what you choose, the options in the dialog differ. Add Action option Description Add Action option Description Action Select from the following: System Log - add a notification to the system log. Supervision Event - To generate an event that can be sent to various targets depending on how you configure your Event Notifications, see https://infozone.atlassian.net/wiki/x/u4Q4D . Overload Protection - Overload Protection - Add an overload protection service Note! You will only see the option for an Overload Protection If you have Diameter or Radius Collection agents in your workflow. Description Enter a description for the action. Reject This option is only available when you have selected to configure an Overload Protection action and determines the percentage of requests that should be rejected; 0, 25, 50, or 100 %. Strategy This option is only available when you have selected to configure an Overload Protection action and determines if you want to apply this action on all types of requests or if you only want to apply them to the requests following a selected Diameter or Radius overload protection strategy. Content This option is only available when you have selected to configure a Supervision Event action and it determines the content of the event. See Event Types for more information. Severity This option is only available when you have selected to configure a System Log action and it determines the severity of the log entry; Information, Warning, Error, or Disaster. Message This option is only available when you have selected to configure a System Log action and allows you to enter a message that will be visible in the System Log. Expand the sub-steps for the option you selected If you have selected an Overload Protection action: If you have selected a Supervision Event action: If you have selected a System Log action: Click Add to add the action to the action list. Repeat steps 4 to 5 until you have added all the required actions to the action list and then click Close. You will return to the Add Action List dialogue. Open Add Action List dialogue Add a name and click the Add button to add the action list in the Create Decision Tables dialog. Setting Description Setting Description List Enter a name for the action list in the Name field. Action This section contains all the actions you have added to this list. Repeat steps 1 to 8 until you have created all the necessary action lists then click Close. You will return to the Create Decision Tables dialog. Configuring a Decision Table In the Decision Table tab you will now have two columns; Conditions and Actions . Open Add Decision Table dialogue The Conditions column lists all the condition sets you have created. In the Actions column, you can set each condition to True , False , or - (Ignore), and then choose which action to trigger when the decision table criteria are met. If you have multiple conditions, various combinations may require different actions. To add another action column, right-click the Actions column heading and select Add Column... . You can repeat this process to define actions for all necessary condition combinations. Note! Only one action can be selected for each set of combinations. Note! When a condition is evaluated to true, the corresponding action will be performed only once, until any other condition is also evaluated to true. Generally, this means that a minimum of two conditions are required in the decision table. Example - Decision Table Open Decision Table configuration example The following actions will be taken during the following conditions: Case 1 If the Incoming messages exceed 50, a Supervision Event will be triggered. Case 2 If the Incoming messages exceed 100, 25 % of the incoming Diameter Credit-Control Initial requests will be rejected. Case 3 If the Incoming messages exceed 150, 100 % of the incoming Diameter Credit-Control Initial requests will be rejected. MZSH Commands If you need to manually trigger or clear the supervision service with action overload, for example, for maintenance or other purposes, you can use the mzsh wfcommand . See https://infozone.atlassian.net/wiki/x/MRRCD for more information.",
      "title": "Supervision Service - MediationZone Documentation 9.3 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/496730317/Supervision+Service",
      "word_count": 1699,
      "char_count": 10400
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T04:48:56.658715",
    "word_count": 1699,
    "char_count": 10400,
    "chunk_count": 1
  }
}