{
  "id": "wiki__spaces__MD93__pages__205783709__MediationZone_Desktop",
  "title": "MediationZone Desktop - MediationZone Documentation 9.3 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205783709/MediationZone+Desktop",
  "categories": [
    "space:MD93"
  ],
  "text": "The Desktop is an intuitive and powerful tab-based management user interface that covers all aspects of the systems configuration. The following figure shows the main Desktop window. In the Desktop menus, various types of configurations, tools, and inspectors are available depending on the type of license you have. For example, if you dont have a Diameter license none of the Diameter agents or profiles will be available in the Desktop. Desktop Menus There are three types of menus available for you when you click on the new button in the desktop menu as shown in the figure below: Configuration menu, Inspection menu, and Tools menu. Open Composite-picture showing Desktop menus. The content of each menu is non-exhaustive and may vary per system environment. Configuration Menu Option Description Option Description Aggregation Profile Used for registration of aggregation criteria configurations that are used in an Aggregation Agent. Alarm Detection Enables you to define criteria for generation of alarm messages. You select a condition, or combine a set of conditions, that within specific limits generate an alarm message. Amazon Profile The Amazon Profile is a generic profile used for setting up Amazon S3 credentials and properties that can be used by various other profiles or agents. APL Code Used for registration of APL scripts that are used in Analysis and Aggregation agents. APL Collection Strategy Enables specific selection logic to be created for Disk, FTP, SCP and SFTP agents. Archive Profile Used for registration of archiving configurations that are used in Archiving agents. Audit Profile Used for registration of Audit table configurations that are used in workflows. Categorized Grouping Profile Used for registration of a Categorized Grouping Agent configuration used by a Categorized Grouping Agent. Couchbase Profile Used for registration of Couchbase configurations, which can be selected in Distributed Storage profiles in order to access buckets in a Couchbase cluster. Data Masking Profile Used for configuring the masking method that you want the Data Masking agent to use, which UDR types and field you want to obscure/reveal, and any masking method specific settings. Database Profile Used for registration of database configurations, both external and internal, that are used in the workflows. Diameter Application Profile Used for registration of supported Diameter Application IDs, Diameter AVPs and Diameter Commands that are used in Diameter Stack (server) / Request (client) agents. Diameter Routing Profile Used for registration of the peer table, realm routing table, and DNS settings for Diameter Stack/Request agents. Distributed Storage Profile Used for registration of distributed storage configurations that are used in workflows. Duplicate Batch Profile Used for registration of Duplicate Batch criteria configurations that are used in Duplicate Batch agents. Duplicate UDR Profile Used for registration of Duplicate UDR (record) criteria configurations that are used in Duplicate UDR agents. Elasticsearch Profile An Elasticsearch profile is used to read and write data in an Elasticsearch Service in AWS and can be accessed by batch workflows using Aggregation agents. Encryption Key Profile The Encryption Profile is a generic profile used for making encryption configurations that can be used by various agents. Encryption Profile The Encryption Profile you make encryption configurations to be used by the Encryptor agent. Event Notification Used for registration of notification and event setups that are used in workflows. External Reference Profile Used for mapping of external reference sources into MediationZone external reference targets. File System Profile The File System Profile are used for making file syste- specific configurations, currently used by the Amazon S3 collection and forwarding agents. Inter Workflow Profile Used for registration of parameter configurations for passing data between workflows using Inter Workflow. JMS Profile Used for registration of JMS specific configurations that are used in the JMS agents. Kafka Profile Used to configure which topic to use, and to select to use embedded Kafka or external Kafka, and configure the profile according to selection. Nordpool Profile The NordPool profile configure the token and server path, as well as login details. OpenAPI Profile The Open API profile can be used for automatically generating UDR structures based on an entered REST API schema in the profile. Python Interpreter Profile Interpreter profiles configure which executable to to use and also which working directory to use. Python Module Python Module configurations share Python code that can be imported by multiple Python agents. Redis Profile Used for registration of Redis profiles that are used in the workflows. Rest Server Profile The REST Server Profile is used to define the endpoint URI for any particular REST server agent in MediationZone. Reference Data Profile Used to query and edit specific table sets in relational databases while schema permissions remain unaltered. SAP RFC Profile Used for dynamic generation of UDRs based on the selected SAP RFC functions that are part of an SAP system. Shared Table Profile Used for registration of shared memory table SQL queries. SNMP Collection Profile Used by the SNMP Request and SNMP Trap collection agents. SNMP OID Profile SNMP OID profile configure which OIDs, i e UDR types and fields to poll, outside of the SNMP Request agent itself, which enables several agents to use the same configuration. Suspend Execution Profile The Suspend Execution profile enables you to apply a restriction that prevents specific workflows and/or Workflow Groups from running in specific periods of time. System Insight Profile Used to create, edit or remove profiles and filters that you want to use to display or store statistics using the System Insight service. TLS Profile The TLS profile enables you to make more detailed configurations for which cipher suites to accept. Ultra Format Used for registration of data configurations using the Ultra Formatting Subsystem. Please refer to the section Ultra Format Definition Language (UFDL) for more information about Ultra. Workflow Used for access to configure and/or change workflows. A workflow is identified as a set of agents connected to each other to represent a data flow. Workflows are the cornerstones of the MediationZone system. Workflow Bridge Profile Used for registration of parameter configurations for passing data between workflows using Workflow Bridge. Workflow Group Enables you to configure several workflows as a single entity WS Profile Used for registration of parameter configurations used in Web Services Inspection Menu Option Description Option Description Aggregation Session Inspector Allows the user to view and edit aggregation sessions Alarm Inspector An alarm can be searched and filtered via the Alarm Inspector tab. The result is presented in a table showing alarm name, description and severity configured using the Alarm Detection configuration. Archive Inspector Allows the user to view and purge Archive entries. Duplicate Batch Inspector Allows the user to view and delete duplicate batch entries. Duplicate UDR Inspector Allows the user to view and delete duplicate UDR entries. ECS Inspector Allows the user to view and manage entries in the Error Correction System (ECS). ECS Statistics Allows the user to view statistics about entries in the Error Correction System (ECS). See Error Correction System (ECS) for more information about ECS. Tools Menu Option Description Option Description Access Controller Used for management of access security to the system Configuration Browser Allows the user to view the configurations for which they have authorization Configuration Diff Allows the user to view two configurations, or two versions of the same configuration side-by-side. The configuration types that can be viewed and compared are APL and Ultra. Configuration Monitor Contains a list of all operations in queue and their progress, e.g. the workflow state. Documentation Generator Allows the user to generate documentation from the configurations in the system. Encrypt Password Encrypt Password allows to encrypt any password and prints out the result onto the text field. Execution Manager With Execution Manager you enable, activate and monitor multiple Workflow groups. Key Manager The Key Manager enables you to configure key exchange required by the protocols for several different agents. Pico Manager Used for management of servers with the system to include Execution Contexts (i.e., the processing servers) Pico Viewer Allows the user to view the servers with the system to include Execution Contexts (i.e., the processing servers). See Overview of MediationZone for more information about the system architecture. Python Language Service Must be running while you are writing your Python code to allow for Code Completion, Validation or Compilation Test to the Python packages that you have installed. System Exporter Used for exporting part or the entire configuration of the system. System Importer Used for importing part or the entire configuration of the system. System Log Allows the user to view and purge System Log entries System Monitor Allows the user to access and read the JMX MBeans for services running on pico hosts (instead of using external tools like jconsole or visualvm). System Statistics Allows the user to view system processing statistics UDR File Editor Allows the user to view and correct the contents of records and files Ultra Format Converter For converting UDRs from one Ultra format to another Help Menu Option Description Option Description User Documentation Allows the user access to an offline version of the user manuals Online Help Directs the user to login to the online user manuals About Allows the user to view the list of software packages and versions, and pico versions for the current instance of Mediation Zone.",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "The Desktop is an intuitive and powerful tab-based management user interface that covers all aspects of the systems configuration. The following figure shows the main Desktop window. In the Desktop menus, various types of configurations, tools, and inspectors are available depending on the type of license you have. For example, if you dont have a Diameter license none of the Diameter agents or profiles will be available in the Desktop. Desktop Menus There are three types of menus available for you when you click on the new button in the desktop menu as shown in the figure below: Configuration menu, Inspection menu, and Tools menu. Open Composite-picture showing Desktop menus. The content of each menu is non-exhaustive and may vary per system environment. Configuration Menu Option Description Option Description Aggregation Profile Used for registration of aggregation criteria configurations that are used in an Aggregation Agent. Alarm Detection Enables you to define criteria for generation of alarm messages. You select a condition, or combine a set of conditions, that within specific limits generate an alarm message. Amazon Profile The Amazon Profile is a generic profile used for setting up Amazon S3 credentials and properties that can be used by various other profiles or agents. APL Code Used for registration of APL scripts that are used in Analysis and Aggregation agents. APL Collection Strategy Enables specific selection logic to be created for Disk, FTP, SCP and SFTP agents. Archive Profile Used for registration of archiving configurations that are used in Archiving agents. Audit Profile Used for registration of Audit table configurations that are used in workflows. Categorized Grouping Profile Used for registration of a Categorized Grouping Agent configuration used by a Categorized Grouping Agent. Couchbase Profile Used for registration of Couchbase configurations, which can be selected in Distributed Storage profiles in order to access buckets in a Couchbase cluster. Data Masking Profile Used for configuring the masking method that you want the Data Masking agent to use, which UDR types and field you want to obscure/reveal, and any masking method specific settings. Database Profile Used for registration of database configurations, both external and internal, that are used in the workflows. Diameter Application Profile Used for registration of supported Diameter Application IDs, Diameter AVPs and Diameter Commands that are used in Diameter Stack (server) / Request (client) agents. Diameter Routing Profile Used for registration of the peer table, realm routing table, and DNS settings for Diameter Stack/Request agents. Distributed Storage Profile Used for registration of distributed storage configurations that are used in workflows. Duplicate Batch Profile Used for registration of Duplicate Batch criteria configurations that are used in Duplicate Batch agents. Duplicate UDR Profile Used for registration of Duplicate UDR (record) criteria configurations that are used in Duplicate UDR agents. Elasticsearch Profile An Elasticsearch profile is used to read and write data in an Elasticsearch Service in AWS and can be accessed by batch workflows using Aggregation agents. Encryption Key Profile The Encryption Profile is a generic profile used for making encryption configurations that can be used by various agents. Encryption Profile The Encryption Profile you make encryption configurations to be used by the Encryptor agent. Event Notification Used for registration of notification and event setups that are used in workflows. External Reference Profile Used for mapping of external reference sources into MediationZone external reference targets. File System Profile The File System Profile are used for making file syste- specific configurations, currently used by the Amazon S3 collection and forwarding agents. Inter Workflow Profile Used for registration of parameter configurations for passing data between workflows using Inter Workflow. JMS Profile Used for registration of JMS specific configurations that are used in the JMS agents. Kafka Profile Used to configure which topic to use, and to select to use embedded Kafka or external Kafka, and configure the profile according to selection. Nordpool Profile The NordPool profile configure the token and server path, as well as login details. OpenAPI Profile The Open API profile can be used for automatically generating UDR structures based on an entered REST API schema in the profile. Python Interpreter Profile Interpreter profiles configure which executable to to use and also which working directory to use. Python Module Python Module configurations share Python code that can be imported by multiple Python agents. Redis Profile Used for registration of Redis profiles that are used in the workflows. Rest Server Profile The REST Server Profile is used to define the endpoint URI for any particular REST server agent in MediationZone. Reference Data Profile Used to query and edit specific table sets in relational databases while schema permissions remain unaltered. SAP RFC Profile Used for dynamic generation of UDRs based on the selected SAP RFC functions that are part of an SAP system. Shared Table Profile Used for registration of shared memory table SQL queries. SNMP Collection Profile Used by the SNMP Request and SNMP Trap collection agents. SNMP OID Profile SNMP OID profile configure which OIDs, i e UDR types and fields to poll, outside of the SNMP Request agent itself, which enables several agents to use the same configuration. Suspend Execution Profile The Suspend Execution profile enables you to apply a restriction that prevents specific workflows and/or Workflow Groups from running in specific periods of time. System Insight Profile Used to create, edit or remove profiles and filters that you want to use to display or store statistics using the System Insight service. TLS Profile The TLS profile enables you to make more detailed configurations for which cipher suites to accept. Ultra Format Used for registration of data configurations using the Ultra Formatting Subsystem. Please refer to the section Ultra Format Definition Language (UFDL) for more information about Ultra. Workflow Used for access to configure and/or change workflows. A workflow is identified as a set of agents connected to each other to represent a data flow. Workflows are the cornerstones of the MediationZone system. Workflow Bridge Profile Used for registration of parameter configurations for passing data between workflows using Workflow Bridge. Workflow Group Enables you to configure several workflows as a single entity WS Profile Used for registration of parameter configurations used in Web Services Inspection Menu Option Description Option Description Aggregation Session Inspector Allows the user to view and edit aggregation sessions Alarm Inspector An alarm can be searched and filtered via the Alarm Inspector tab. The result is presented in a table showing alarm name, description and severity configured using the Alarm Detection configuration. Archive Inspector Allows the user to view and purge Archive entries. Duplicate Batch Inspector Allows the user to view and delete duplicate batch entries. Duplicate UDR Inspector Allows the user to view and delete duplicate UDR entries. ECS Inspector Allows the user to view and manage entries in the Error Correction System (ECS). ECS Statistics Allows the user to view statistics about entries in the Error Correction System (ECS). See Error Correction System (ECS) for more information about ECS. Tools Menu Option Description Option Description Access Controller Used for management of access security to the system Configuration Browser Allows the user to view the configurations for which they have authorization Configuration Diff Allows the user to view two configurations, or two versions of the same configuration side-by-side. The configuration types that can be viewed and compared are APL and Ultra. Configuration Monitor Contains a list of all operations in queue and their progress, e.g. the workflow state. Documentation Generator Allows the user to generate documentation from the configurations in the system. Encrypt Password Encrypt Password allows to encrypt any password and prints out the result onto the text field. Execution Manager With Execution Manager you enable, activate and monitor multiple Workflow groups. Key Manager The Key Manager enables you to configure key exchange required by the protocols for several different agents. Pico Manager Used for management of servers with the system to include Execution Contexts (i.e., the processing servers) Pico Viewer Allows the user to view the servers with the system to include Execution Contexts (i.e., the processing servers). See Overview of MediationZone for more information about the system architecture. Python Language Service Must be running while you are writing your Python code to allow for Code Completion, Validation or Compilation Test to the Python packages that you have installed. System Exporter Used for exporting part or the entire configuration of the system. System Importer Used for importing part or the entire configuration of the system. System Log Allows the user to view and purge System Log entries System Monitor Allows the user to access and read the JMX MBeans for services running on pico hosts (instead of using external tools like jconsole or visualvm). System Statistics Allows the user to view system processing statistics UDR File Editor Allows the user to view and correct the contents of records and files Ultra Format Converter For converting UDRs from one Ultra format to another Help Menu Option Description Option Description User Documentation Allows the user access to an offline version of the user manuals Online Help Directs the user to login to the online user manuals About Allows the user to view the list of software packages and versions, and pico versions for the current instance of Mediation Zone.",
      "title": "MediationZone Desktop - MediationZone Documentation 9.3 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205783709/MediationZone+Desktop",
      "word_count": 1532,
      "char_count": 10025
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T03:53:27.682226",
    "word_count": 1532,
    "char_count": 10025,
    "chunk_count": 1
  }
}