{
  "id": "wiki__spaces__MD93__pages__204604969",
  "title": "Managing a Workflow Group - MediationZone Documentation 9.3 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204604969",
  "categories": [
    "space:MD93"
  ],
  "text": "This section includes the following topics: Opening a new or saved workflow group Creating a workflow group Removing members Execution: Manual or Scheduled Configuration Opening a Workflow Group Configuration You create a new workflow group configuration from the Build view of the Desktop User Interface. To open the workflow group configuration, click Build  New Configuration . Select Workflow Group from the Configurations dialog. To open an existing workflow group configuration, click Build and select the workflow group configuration in the Configuration Browser, or right-click a workflow configuration and then select View Configuration . Creating a Workflow Group You create a workflow group by adding a workflow or a workflow group, as a member to the group. To create a workflow group: In the Available To Add pane, select a workflow or a workflow group. Note! An invalid workflow member will not affect the validity of the workflow group. Click the button. The member is added in the Group Members list. Note! Batch, task and system task workflow members can be combined in a workflow group, but real-time workflow members can only be combined with other real-time workflow members. However, for real-time workflows, we recommend that only one workflow is included in each workflow group, unless you have selected the Continuous Workflow Execution checkbox in the Execution tab, which will allow you to have multiple real-time workflows in the same group. Click the Save As button and give the new workflow group a name. Removing a Member from a Workflow Group When you remove a member from a workflow group, the member does not cease to exist: A workflow member may still be running according to its configuration, or as a member of a workflow group in the system. A workflow group member may still run as a member of another workflow group in the system. To remove a member from a workflow group: Select the member that you want to remove in the in the Group Members list in the Members tab in workflow group configuration. Click the Remove button. You will get a question if you are sure you want to remove the member. Click Yes if you are sure. The member is removed from the group. Executing a Workflow Group Execute the Workflow group either manually, from the Execution Manager - see Execution Manager - or, schedule an automatic execution - see the section below, Scheduling. Configuring a Workflow Group Configuring a workflow group includes: Planning members' execution order Setting the workflow group execution parameters Setting the workflow group scheduling parameters Members' Execution Order When planning the execution order of the members in your workflow group, use the Prerequisites column in the Group Members table. By doing so you ensure: A linear execution A certain execution order That every member is fully executed before the next member starts running Note! If you use the Continuous Workflow Execution setting, you can override this behavior by allowing scheduled workflows to execute even though all workflow members are not finished. See the section below, Execution, for further information. To configure members' execution order: Select a member in the Group Members pane in the Members tab. Click the Edit button. The Prerequisites dialog box opens. Open The Prerequisites dialog box Select the checkboxes for the members that the current member should follow. Click OK . See the image below for an example of how it may look. Open Workflow Group members' execution prerequisites You can rearrange the members' order of appearance in the Group Members list, by using the Up and Down buttons. When rearranging a list, that is already configured with Prerequisites you notice that the Prerequisites parameter is removed and a yellow warning icon appears instead. Note that this does not affect the workflow group validity. To remove the notification sign, either open the Prerequisites dialog box and click OK , or - to remove all the notification signs - save the workflow group configuration, and reopen it. Execution Click the Execution tab in the workflow group configuration. Open The Workflow Group Execution tab Entry Description Entry Description Max Simultaneous Running Workflows Enter the maximum number of workflows you want to be able to run concurrently. Note! If you do not specify a limit, your specific work environment and equipment will determine the maximum number of workflows that can run simultaneously. This value applies only to the workflow group that you are defining and does not affect members that are workflow groups. Startup Delay If Max Simultaneous Running Workflows is set to a value larger than 1, enter the delay (in seconds) of the execution start for each of the workflows that may run simultaneously. Note! If you do not enter any value, a very short delay will be applied by the system, by default. You can assign a Startup Delay regardless of the members' status. Once the delay is up, if the member in turn is disabled, the Workflow group attempts to execute the next member. Continuous Workflow Execution Select this checkbox if you want to allow members in scheduled workflow groups to execute on schedule even though all workflow members in the group have not finished execution. This may be useful in case one member is delayed for some reason. In that case remaining workflow members will not be prevented from executing on schedule. Note! This feature is not supported for nested group members, only workflow members. For a workflow group with a member that is delayed over the next scheduled time, this setting makes the member execute immediately when it is finished, and the group will be in a continuous Running state, not switching to Idle in between executions as is the default behavior. This needs to be considered when making configurations based on workflow group states. Continue This option activates the default behavior on member abort, which means that the workflow group will run until all its members are fully executed and/or all are aborted. Note! This means that groups with real-time workflow members continue to run until all the members are aborted or stopped manually. Stop Select this option to have the workflow group stop when a member aborts. A batch Workflow will finish the current batch and then stop. Stop Immediately Select this option to have the workflow group stop immediately when a member aborts. A batch workflow will stop even in the middle of processing a batch. Enable Select this checkbox to enable the workflow group execution settings. Note! Execution settings that you configure here, only apply to workflow members for which execution settings have not been enabled in the configurations that they are part of. Workflow groups cannot run as stand-alones, and will be executed on the Platform. For further information about stand-alone, see Execution Context in the Desktop User's Guide . Distribution A workflow executes on an EC group. You can specify these EC groups, or the system can select them automatically. The Distribution rules are applied to all included group members, such as workflows and workflow group configurations. When there are conflicting settings, the members that are lowest in the workflow group hierarchy have precedence. When the Distribution rules of the workflow group configurations are set on the same level in the hierarchy, they do not conflict with each other. Note! If you configure the distribution using EC groups, the selected distribution type is also applied to the ECs within the groups. The following options exist: Sequential - Starts the workflow on the first EC group in the list. If this EC group is not available, it proceeds with the next in line. Workflow Count - Starts the workflow on the EC group running the fewest number of workflows. If the Execution Contexts list contains at least one entry, only this/these EC groups will be considered. Machine Load - Starts the workflow on the EC group with the lowest machine load. If the Execution Contexts list contains at least one entry, only this/these EC groups will be considered. Which EC group to select is based on information from the System Statistics sub-system. Round Robin - Starts the workflow on the available EC groups in turn, but not necessarily in a sequential order. If ecg1, ecg2, and ecg3 are defined, the workflow may first attempt to start on ecg2. The next time it may start on ecg3 and then finally on ecg1. This order is then repeated. If an EC group is not available, the workflow will be started on any other available EC groups. Scheduling The cause of execution for a workflow group can either be a planned time scheme or a specific event. You can configure the cause of execution in the Scheduling tab. Note! Changes to a running workflow group will not apply until the group has finished running, which means that a real-time workflow will have to be stopped manually for changes to apply. Info! The times stated in Scheduling follows the timezone of the server hosting the MediationZone Platform. Open The Workflow Group Scheduling tab Entry Description Entry Description Day Plans Use this table to plan timed triggers that will execute your Workflow group. Note that you can define a list of various plans. The system picks the plan that meets the top priority according to the section below, Day Plans Priority Rule. Event Trigger Use this table to define an event execution trigger for the Workflow group, see the section below, Event Triggers. Day Plans Priority Rule The Day Plans table lets you create a list of different execution schemes of the Workflow group. You configure each Day Plan to any interval between executions. Note! Two Day Plans should not contradict each another. An example of an invalid configuration: Day Plan A is set to Tuesdays Off, while Day Plan B is set to Every 5 minutes between 15:00:00 and 15:05:00 on Tuesdays. The system applies the following priority rule for picking a Day Plan out of the list: Last day of month Day of month (1-31) Weekday (Monday-Sunday) Every day To Configure a Day Plan Schedule: Click the Add button below the Day Plan table in the Scheduling tab. The Add Day Plan dialog opens. Open The Add Day Plan dialog Entry Description Entry Description Day Select the target day. Valid options are: Every day A specific weekday A specific day of the month (1-31) The last day of the month Day Off Select this checkbox to avoid execution on the day specified in the Day list. Start At Enter a start time for the first execution. Stop At Enter the time for when execution should stop. Note! If these fields are left empty, the default stop time, which is 23:59, is applied. Repeat Every Enter the interval between execution start time in seconds, minutes, or hours. Note! If this field is left empty, only one execution session is run at the specified start time. Note! If a member in a group is delayed for some reason, and not finished at the time the execution is set to be repeated, all members in the group have to wait until the next repeat time. To override this behavior, you can use the Continuous Workflow Execution setting in the Execution tab. See the Execution section above. Event Triggers To trigger the execution of a Workflow group you add a row to the Event Trigger table. A row can be either a certain event, or a chain of events, that must occur in order for the Workflow group execution to set off. Note! An Event Trigger that is comprised of a chain of events will take effect only when all the events that it includes have occurred. The events that have occurred are stored in memory. When MediationZone is restarted this information is lost and none of the events on the event chain are considered to have occurred. To Configure an Event Trigger: Click the Add button beneath the Event Triggers table. The Add Event Chain Trigger dialog opens. Open The Add Event Chain Trigger Dialog Click the Add button. The Add Event Selection dialog opens. Open The Add Event Selection dialog Select an Event Type from the drop-down list. See Event Fields in Event Notifications Configuration . Double-click an entry in the Event Filter table. The Edit Match Value dialog opens. Click the Add button. The Add Match Value dialog opens. If you want to filter all the events based on specific values of the selected type, enter the values in the Match Value(s) column. Otherwise, if you leave the default value, all events of the selected event type will trigger the execution of the Workflow group. Click Add/OK/Close to close each of the four dialog boxes, confirming that your entry is included. Note! There are no referential constraints for Event Triggers nor any way to track relations between workflows that are triggered by one another. For example: Workflow A is defined to be activated when Workflow B is activated. Workflow B may be deleted without any warnings, leaving Workflow A, still a valid workflow, without a trigger. This can happen since value matching is based on a regular expression of the workflow name, and not on a precise link match.",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "This section includes the following topics: Opening a new or saved workflow group Creating a workflow group Removing members Execution: Manual or Scheduled Configuration Opening a Workflow Group Configuration You create a new workflow group configuration from the Build view of the Desktop User Interface. To open the workflow group configuration, click Build  New Configuration . Select Workflow Group from the Configurations dialog. To open an existing workflow group configuration, click Build and select the workflow group configuration in the Configuration Browser, or right-click a workflow configuration and then select View Configuration . Creating a Workflow Group You create a workflow group by adding a workflow or a workflow group, as a member to the group. To create a workflow group: In the Available To Add pane, select a workflow or a workflow group. Note! An invalid workflow member will not affect the validity of the workflow group. Click the button. The member is added in the Group Members list. Note! Batch, task and system task workflow members can be combined in a workflow group, but real-time workflow members can only be combined with other real-time workflow members. However, for real-time workflows, we recommend that only one workflow is included in each workflow group, unless you have selected the Continuous Workflow Execution checkbox in the Execution tab, which will allow you to have multiple real-time workflows in the same group. Click the Save As button and give the new workflow group a name. Removing a Member from a Workflow Group When you remove a member from a workflow group, the member does not cease to exist: A workflow member may still be running according to its configuration, or as a member of a workflow group in the system. A workflow group member may still run as a member of another workflow group in the system. To remove a member from a workflow group: Select the member that you want to remove in the in the Group Members list in the Members tab in workflow group configuration. Click the Remove button. You will get a question if you are sure you want to remove the member. Click Yes if you are sure. The member is removed from the group. Executing a Workflow Group Execute the Workflow group either manually, from the Execution Manager - see Execution Manager - or, schedule an automatic execution - see the section below, Scheduling. Configuring a Workflow Group Configuring a workflow group includes: Planning members' execution order Setting the workflow group execution parameters Setting the workflow group scheduling parameters Members' Execution Order When planning the execution order of the members in your workflow group, use the Prerequisites column in the Group Members table. By doing so you ensure: A linear execution A certain execution order That every member is fully executed before the next member starts running Note! If you use the Continuous Workflow Execution setting, you can override this behavior by allowing scheduled workflows to execute even though all workflow members are not finished. See the section below, Execution, for further information. To configure members' execution order: Select a member in the Group Members pane in the Members tab. Click the Edit button. The Prerequisites dialog box opens. Open The Prerequisites dialog box Select the checkboxes for the members that the current member should follow. Click OK . See the image below for an example of how it may look. Open Workflow Group members' execution prerequisites You can rearrange the members' order of appearance in the Group Members list, by using the Up and Down buttons. When rearranging a list, that is already configured with Prerequisites you notice that the Prerequisites parameter is removed and a yellow warning icon appears instead. Note that this does not affect the workflow group validity. To remove the notification sign, either open the Prerequisites dialog box and click OK , or - to remove all the notification signs - save the workflow group configuration, and reopen it. Execution Click the Execution tab in the workflow group configuration. Open The Workflow Group Execution tab Entry Description Entry Description Max Simultaneous Running Workflows Enter the maximum number of workflows you want to be able to run concurrently. Note! If you do not specify a limit, your specific work environment and equipment will determine the maximum number of workflows that can run simultaneously. This value applies only to the workflow group that you are defining and does not affect members that are workflow groups. Startup Delay If Max Simultaneous Running Workflows is set to a value larger than 1, enter the delay (in seconds) of the execution start for each of the workflows that may run simultaneously. Note! If you do not enter any value, a very short delay will be applied by the system, by default. You can assign a Startup Delay regardless of the members' status. Once the delay is up, if the member in turn is disabled, the Workflow group attempts to execute the next member. Continuous Workflow Execution Select this checkbox if you want to allow members in scheduled workflow groups to execute on schedule even though all workflow members in the group have not finished execution. This may be useful in case one member is delayed for some reason. In that case remaining workflow members will not be prevented from executing on schedule. Note! This feature is not supported for nested group members, only workflow members. For a workflow group with a member that is delayed over the next scheduled time, this setting makes the member execute immediately when it is finished, and the group will be in a continuous Running state, not switching to Idle in between executions as is the default behavior. This needs to be considered when making configurations based on workflow group states. Continue This option activates the default behavior on member abort, which means that the workflow group will run until all its members are fully executed and/or all are aborted. Note! This means that groups with real-time workflow members continue to run until all the members are aborted or stopped manually. Stop Select this option to have the workflow group stop when a member aborts. A batch Workflow will finish the current batch and then stop. Stop Immediately Select this option to have the workflow group stop immediately when a member aborts. A batch workflow will stop even in the middle of processing a batch. Enable Select this checkbox to enable the workflow group execution settings. Note! Execution settings that you configure here, only apply to workflow members for which execution settings have not been enabled in the configurations that they are part of. Workflow groups cannot run as stand-alones, and will be executed on the Platform. For further information about stand-alone, see Execution Context in the Desktop User's Guide . Distribution A workflow executes on an EC group. You can specify these EC groups, or the system can select them automatically. The Distribution rules are applied to all included group members, such as workflows and workflow group configurations. When there are conflicting settings, the members that are lowest in the workflow group hierarchy have precedence. When the Distribution rules of the workflow group configurations are set on the same level in the hierarchy, they do not conflict with each other. Note! If you configure the distribution using EC groups, the selected distribution type is also applied to the ECs within the groups. The following options exist: Sequential - Starts the workflow on the first EC group in the list. If this EC group is not available, it proceeds with the next in line. Workflow Count - Starts the workflow on the EC group running the fewest number of workflows. If the Execution Contexts list contains at least one entry, only this/these EC groups will be considered. Machine Load - Starts the workflow on the EC group with the lowest machine load. If the Execution Contexts list contains at least one entry, only this/these EC groups will be considered. Which EC group to select is based on information from the System Statistics sub-system. Round Robin - Starts the workflow on the available EC groups in turn, but not necessarily in a sequential order. If ecg1, ecg2, and ecg3 are defined, the workflow may first attempt to start on ecg2. The next time it may start on ecg3 and then finally on ecg1. This order is then repeated. If an EC group is not available, the workflow will be started on any other available EC groups. Scheduling The cause of execution for a workflow group can either be a planned time scheme or a specific event. You can configure the cause of execution in the Scheduling tab. Note! Changes to a running workflow group will not apply until the group has finished running, which means that a real-time workflow will have to be stopped manually for changes to apply. Info! The times stated in Scheduling follows the timezone of the server hosting the MediationZone Platform. Open The Workflow Group Scheduling tab Entry Description Entry Description Day Plans Use this table to plan timed triggers that will execute your Workflow group. Note that you can define a list of various plans. The system picks the plan that meets the top priority according to the section below, Day Plans Priority Rule. Event Trigger Use this table to define an event execution trigger for the Workflow group, see the section below, Event Triggers. Day Plans Priority Rule The Day Plans table lets you create a list of different execution schemes of the Workflow group. You configure each Day Plan to any interval between executions. Note! Two Day Plans should not contradict each another. An example of an invalid configuration: Day Plan A is set to Tuesdays Off, while Day Plan B is set to Every 5 minutes between 15:00:00 and 15:05:00 on Tuesdays. The system applies the following priority rule for picking a Day Plan out of the list: Last day of month Day of month (1-31) Weekday (Monday-Sunday) Every day To Configure a Day Plan Schedule: Click the Add button below the Day Plan table in the Scheduling tab. The Add Day Plan dialog opens. Open The Add Day Plan dialog Entry Description Entry Description Day Select the target day. Valid options are: Every day A specific weekday A specific day of the month (1-31) The last day of the month Day Off Select this checkbox to avoid execution on the day specified in the Day list. Start At Enter a start time for the first execution. Stop At Enter the time for when execution should stop. Note! If these fields are left empty, the default stop time, which is 23:59, is applied. Repeat Every Enter the interval between execution start time in seconds, minutes, or hours. Note! If this field is left empty, only one execution session is run at the specified start time. Note! If a member in a group is delayed for some reason, and not finished at the time the execution is set to be repeated, all members in the group have to wait until the next repeat time. To override this behavior, you can use the Continuous Workflow Execution setting in the Execution tab. See the Execution section above. Event Triggers To trigger the execution of a Workflow group you add a row to the Event Trigger table. A row can be either a certain event, or a chain of events, that must occur in order for the Workflow group execution to set off. Note! An Event Trigger that is comprised of a chain of events will take effect only when all the events that it includes have occurred. The events that have occurred are stored in memory. When MediationZone is restarted this information is lost and none of the events on the event chain are considered to have occurred. To Configure an Event Trigger: Click the Add button beneath the Event Triggers table. The Add Event Chain Trigger dialog opens. Open The Add Event Chain Trigger Dialog Click the Add button. The Add Event Selection dialog opens. Open The Add Event Selection dialog Select an Event Type from the drop-down list. See Event Fields in Event Notifications Configuration . Double-click an entry in the Event Filter table. The Edit Match Value dialog opens. Click the Add button. The Add Match Value dialog opens. If you want to filter all the events based on specific values of the selected type, enter the values in the Match Value(s) column. Otherwise, if you leave the default value, all events of the selected event type will trigger the execution of the Workflow group. Click Add/OK/Close to close each of the four dialog boxes, confirming that your entry is included. Note! There are no referential constraints for Event Triggers nor any way to track relations between workflows that are triggered by one another. For example: Workflow A is defined to be activated when Workflow B is activated. Workflow B may be deleted without any warnings, leaving Workflow A, still a valid workflow, without a trigger. This can happen since value matching is based on a regular expression of the workflow name, and not on a precise link match.",
      "title": "Managing a Workflow Group - MediationZone Documentation 9.3 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204604969",
      "word_count": 2195,
      "char_count": 13095
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T04:12:01.301000",
    "word_count": 2195,
    "char_count": 13095,
    "chunk_count": 1
  }
}