{
  "id": "wiki__spaces__MD93__pages__204642846__Charging_Answer_UDRs",
  "title": "Charging Answer UDRs - MediationZone Documentation 9.3 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204642846/Charging+Answer+UDRs",
  "categories": [
    "space:MD93"
  ],
  "text": "PurchaseOrderUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a ChargeUDR , a BlankChargeUDR or an EstimateChargeUDR . Field Description Field Description allNotifications (list<NotificationUDR>) Usually, the Notifications are enclosed in the transactions. This list offers a shortcut to the generated Notification independently of the transaction. For further information, see Notification UDRs . chargingResults (list<ChargingResultUDR>) A list of charging results that contain details about the charging operation. For further information, refer to the section below, ChargingResultUDR. currency (string) The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD moneyAmount (string) A string representation of the charged amount. The moneyAmount value respects the SAP Convergent Charging Money.toString() . format. For example: EUR 12.15 , or USD 0.123456 status (OrderStateUDR) FREE PAID transactionList (list<TransactionUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . snapshotId (int) The snapshot identifier used to rate event CheckLimitResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a CheckLimitUDR . Field Description Field Description allNotifications (list<NotificactionUDR>) Usually, the Notifications are enclosed in the transactions. This list offers a shortcut to the generated Notification independently of the transaction. For further information, see Notification UDRs . iterations (int) Represents the number of iterations, necessary to get the result limit (string) The limit maxLimitReached (boolean) Is true if the limit is the maximum, otherwise false . The maximum corresponds to the propertyToInverse value set in the chargeableItem passed in the request. precision (string) The precision of the request propertyToInverse (string) The property to inverse transactionList (list<TransactionUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . SessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a SessionStartUDR , SessionUpdateUDR , SessionStopUDR . Field Description Field Description accumulatedAmount (list <MoneyUDR>) Contains the accumulated reserved amount serviceSessionResults (list <ServiceSessionResultUDR>) Contains the the charging answer for start, stop and update of a session For further information, see the section below, ServiceSessionResultUDR. transacSetsToCleanup (list <TransactionSetUDR>) Depending on the CleanupResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . ServiceSessionResultUDR This UDR contains information associated with Service Session. Field Description Field Description exception (CCExceptionUDR) Is set if the charging operation failed reservationId (string) The unique identifier for the service startRateResult (StartSessionResultUDR) This field is populated if a Service Session contains a Reservation Item. For further information, see the section below, StartSessionResultUDR. stopRateResult (StopSessionResultUDR) This field is populated if a Service Session contains a Confirmation Item or has Cancellation set to true. For further information, see the section below, StopSessionResultUDR. updateRateResult (UpdateSessionResultUDR) This field is populated if a Service Session contains a Confirmation Item and a Reservation Item. For further information, see the section below, UpdateSessionResultUDR. StartSessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a StartSessionUDR. Field Description Field Description allNotifications (list<NotificationUDR>) The aggregation of the three above notification lists. For further information, see Notification UDRs . currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD limit (string) The limit name (string) The name toConfirmMoneyAmount (string) A string representation of the amount to confirm. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toReserveMoneyAmount (string) A string representation of the charged amount to reserve. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 transactionSetsToCleanup (list<TransactionSetUDR>) Depending on the CleanupResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . transactionSetsToConfirm (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction set (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to confirm. For further information, see Common SAP CC UDRs . transactionSetsToReserve (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction set (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to reserve. For further information, see Common SAP CC UDRs . transactionCleanedupNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cleaned-up transactions For further information, see Notification UDRs . transactionConfirmedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the confirmed transactions. For further information, see Notification UDRs . transactionReservedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the reserved transactions. For further information, see Notification UDRs . transactionSetId (long) The transaction set id of the answer UpdateSessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a UpdateSessionUDR . Field Description Field Description accumulatedMoneyAmount (string) A string representation of the total amount confirmed since the beginning of the session. The accumulatedMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 allNotifications (list<NotificationUDR>) The aggregation of the three above notification lists. For further information, see Notification UDRs . currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD limit (string) The limit name (string) The name toCancelMoneyAmount (string) A string representation of the amount to cancel for this update. The toCancelMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toConfirmMoneyAmount (string) A string representation of the amount to confirm for this update. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toReserveMoneyAmount (string) A string representation of the charged amount to reserve for this update. The toReserveMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 transactionSetsToCancel (list<TransactionSetUDR>) Depending on the ResultType defined in the request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to cancel. For further information, see Common SAP CC UDRs . transactionSetsToCleanup (list<TransactionSetUDR>) Depending on the CleanupResultType defined in the request, it will contain the generated transaction set (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . transactionSetsToConfirm (list<TransactionSetUDR>) Depending on the ResultType defined in the request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to confirm. For further information, see Common SAP CC UDRs . transactionSetsToReserve (list<TransactionSetUDR>) Depending on the ResultType defined in the request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to reserve. For further information, see Common SAP CC UDRs . transactionCanceledNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cancelled transactions. For further information, see Notification UDRs . transactionCleanedupNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cleaned up transactions. For further information, see Notification UDRs . transactionConfirmedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the confirmed transactions. For further information, see Notification UDRs . transactionReservedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the reserved transactions. For further information, see Notification UDRs . StopSessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a StopSessionUDR . Field Description Field Description accumulatedMoneyAmount (string) A string representation of the total amount confirmed since the beginning of the session. The accumulatedMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toConfirmMoneyAmount (string) A string representation of the amount to confirm for this stop. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toCancelMoneyAmount (string) A string representation of the amount to cancel for this stop. The toCancelMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD transactionSetsToCleanup (list<TransactionSetUDR>) Depending on the CleanupResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . transactionSetsToConfirm (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to confirm. For further information, see Common SAP CC UDRs . transactionSetsToCancel (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to cancel. For further information, see Common SAP CC UDRs . transactionCleanedupNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cleaned-up transactions ( list<TransactionSetUDR> ) For further information, see Notification UDRs . transactionConfirmedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the confirmed transactions. For further information, see Notification UDRs . transactionCanceledNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cancelled transactions. For further information, see Notification UDRs . allNotifications (list<NotificationUDR>) The aggregation of the three above notification lists. For further information, see Notification UDRs . CCExceptionUDR This UDR represents a charging error that may be received from the SAP Convergent Charging Core server when charging fails, or as a result of failed validation of UDR field values ( BadUDRFormatException ) before the request is sent to the server. Every charging request could result in a CCExceptionUDR . Field Description Field Description cause (string) The stack trace of the exception message (string) A string description of the error message reason (string) A string description of the error reasonCode (int) A specific code for this error type (string) The type of the Exception. Can be: CommunicationFailureException IllegalArgumentException ServerFailureException InvalidItemException ForbiddenChargeException TransactionClearingException StartRateException StopRateException UpdateRateException DoesNotExistException CannotInverseException BadUDRFormatException TranslateResultUDR This UDR represents the result of a successful translate operation. Field Description Field Description translatedValues (string) A list of strings, including translated values ChargingResultUDR The result of a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description chargedItems (list<ChargedItemUDR>) This is the charged items returned as output from the charge operation. responseItems (list<ResponseItemUDR>) This is the response items that were generated from the charge operations. notifications(list<NotificationUDR>) This list contains the notifications produced during the price plan execution. AccountOperationTypeUDR This UDR represents the account operation type for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description CREDIT (AccountOperationTypeUDR (sapcc.accountOperation)) The account operation is a credit operation. DEBIT (AccountOperationTypeUDR (sapcc.accountOperation)) The account operation is a debit operation. AccountOperationUDR This UDR represents the details of an account operation for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description amount (MoneyUDR sapcc) A string representation of the price amount and currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD amountAssignments (list <AmountAssignmentUDR (sapcc.accountOperation)>) The list of amount assignments for the account operation. For more details on the possible values, see the field definitions in the section below, AmountAssignmentUDR. dependentAccountOperationKey (int) The numeric key of the account operation that it depends on, if applicable key (int) The numeric key of the account operation mainAccountReference (AccountReferenceUDR (sapcc.accountOperation)) The main account reference to the account impacted by the charging operation. For more details on the possible values, see the field definitions in the section below, AccountReferenceUDR. netAmount (MoneyUDR (sapcc)) A string representation of the net amount and currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD taxAmount (MoneyUDR (sapcc)) A string representation of the tax amount and currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD type (AccountOperationTypeUDR (sapcc.AccountOperation)) The type of account operation. For more details on the possible values, see the field definitions in the section above, AccountOperationTypeUDR. AccountReferenceTypeUDR This UDR represents the account reference type for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description EXTERNAL (AccountReferenceTypeUDR (sapcc.accountOperation)) The account reference is an external account. PREPAID (AccountReferenceTypeUDR (sapcc.accountOperation)) The account reference is a prepaid account. AccountReferenceUDR This UDR represents the reference to an account impacted by a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description id (string) The identifier of the account impacted by a charging operation. type (AccountReferenceTypeUDR (sapcc.accountOperation)) The type of account impacted by a charging operation. For details on the possible values, see the field definitions in the section above, AccountReferenceTypeUDR. AccountTypeUDR This UDR represents the account type for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description EXTERNAL (AccountTypeUDR sapcc) The account type is a postpaid account that is managed in a third-party accounting system. PREPAID (AccountTypeUDR sapcc) The count type is a prepaid account that is managed in the SAP CC system. UNDEFINED (AccountTypeUDR sapcc) The account type is not defined as external or prepaid. AmountAlertModelUDR This UDR represents the alert that could be received when the balance reaches a certain amount for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description amount (string) The amount that triggers an alert code (string) The code of the amount alert AmountAssignmentUDR This UDR represents the assignment of part of the amount of an amount operation to an account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description accountReference (AccountReferenceTypeUDR (sapcc.accountOperation)) The reference to the account impacted by a charging operation. For more details, see the field definitions in the section above, AccountReferenceTypeUDR. amount (MoneyUDR (sapcc)) A string representation of the amount and currency of the assignment amount. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format For example: EUR , or USD chargedItemKey (int) The numeric key of the charged item ChargeableItemInfoUDR This UDR inherits all fields from UniqueIdentifierUDR . ChargeableItemInfoUDR represents the details of the chargeable item associated to a charging result. ChargingContractInfoUDR This UDR represents the details of the charging contract associated to a charging result for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description chargingContractId (string) The identifier of the charging contract chargingContractItemId (string) The external identifier of the charging contract item subscriberAccountId (string) The identifier of the subscriber account associated to the charging contract. ChargingProcessInfoUDR This UDR represents the details of the charging process for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description chargedItemSetUniqueId (UniqueIdentifierUDR (sapcc)) The unique identifier of the charged item set generated by the charging process. For more details on the possible values, see the field definitions in the section below, UniqueIdentifierUDR. eventProcessingDate (date) The date when the event was processed ExpirationAlertModelUDR This UDR represents the alert that could be received before or after a reference date when the state of a prepaid account has changed for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description dayCount (int) The number of days before or after the reference state date of the prepaid account that this alert must be thrown refStateDate (ReferenceStateDateUDR (sapcc)) The reference state of the expiration alert. For more details on the possible values, see the the field definitions in the section below, ReferenceStateDateUDR. ExternalAccountModelUDR This UDR represents the external account defined in a subscriber account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description code (string) The code of the external account currencyCode (string) The currency code of the external account description (string) The description of the external account externalAccountCode (string) The external code of the external account systemCode (string) The system code of the external account type (ExternalAccountTypeUDR (sapcc)) The type of external account. For more details on the possible values, see the field definitions in the section below, ExternalAccountTypeUDR. ExternalAccountTypeUDR This UDR represents the type of external account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description PAYABLE (ExternalAccountTypeUDR (sapcc)) The external account type is payable. RECEIVABLE (ExternalAccountTypeUDR (sapcc)) The external account type is receivable. UNDEFINED (ExternalAccountTypeUDR (sapcc)) The external account is not defined as payable or receivable. PrepaidAccountModelUDR This UDR represents the details of a prepaid account for a charge or blank charge operation when the chargeExecutionContext is set in the request. The prepaid account is a balance defined by a minimal value that can be zero, but cannot be less than zero, unless overspending is granted. Field Description Field Description amount (string) A string representation of the amount of the prepaid account amountAlerts (list<AmountAlertModelUDR (sapcc)>) The list of amount alerts in the prepaid account. For more details on the possible values, see the field definitions in the section above, AmountAlertModelUDR. blockedStateDate (date) The blocked state date of the prepaid account closedStateDate (date) The closed state date of the prepaid account code (string) The code of the prepaid account currencyCode (string) The currency code of the prepaid account description (string) The description of the prepaid account emptyLimit (string) The minimal amount (empty limit) of the prepaid account. expirationAlerts (list<expirationAlertModelUDR (sapcc)>) The list of expiration alerts for the prepaid account. For more details on the possible values, see the field definitions in the section above, ExpirationAlertModelUDR. lockedStateDate (date) The locked state date of the prepaid account overrunAccountCode (string) The overrun account code of the prepaid account overrunAccountType (AccountTypeUDR (sapcc)) The overrun account type of the prepaid account. This field is optional. For more details on the possible values, see the field definitions in the section above AccountTypeUDR. ReferenceStateDateUDR This UDR represents the reference state date of the prepaid account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description ACTIVE (ReferenceStateDateUDR (sapcc)) The alert must be thrown when the state of the prepaid account becomes active after it has been blocked or locked. In this case, the dayCount does not apply. BLOCKED (ReferenceStateDateUDR (sapcc)) The reference date of the alert is the blocked state date of the prepaid account. CLOSED (ReferenceStateDateUDR (sapcc)) The reference date of the alert is the closed state date of the prepaid account. LOCKED (ReferenceStateDateUDR (sapcc)) The reference date of the alert is the locked state date of the prepaid account. UniqueIdentifierUDR This UDR represents the unique identifier for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description type (string) The type of unique identifier",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "PurchaseOrderUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a ChargeUDR , a BlankChargeUDR or an EstimateChargeUDR . Field Description Field Description allNotifications (list<NotificationUDR>) Usually, the Notifications are enclosed in the transactions. This list offers a shortcut to the generated Notification independently of the transaction. For further information, see Notification UDRs . chargingResults (list<ChargingResultUDR>) A list of charging results that contain details about the charging operation. For further information, refer to the section below, ChargingResultUDR. currency (string) The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD moneyAmount (string) A string representation of the charged amount. The moneyAmount value respects the SAP Convergent Charging Money.toString() . format. For example: EUR 12.15 , or USD 0.123456 status (OrderStateUDR) FREE PAID transactionList (list<TransactionUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . snapshotId (int) The snapshot identifier used to rate event CheckLimitResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a CheckLimitUDR . Field Description Field Description allNotifications (list<NotificactionUDR>) Usually, the Notifications are enclosed in the transactions. This list offers a shortcut to the generated Notification independently of the transaction. For further information, see Notification UDRs . iterations (int) Represents the number of iterations, necessary to get the result limit (string) The limit maxLimitReached (boolean) Is true if the limit is the maximum, otherwise false . The maximum corresponds to the propertyToInverse value set in the chargeableItem passed in the request. precision (string) The precision of the request propertyToInverse (string) The property to inverse transactionList (list<TransactionUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . SessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a SessionStartUDR , SessionUpdateUDR , SessionStopUDR . Field Description Field Description accumulatedAmount (list <MoneyUDR>) Contains the accumulated reserved amount serviceSessionResults (list <ServiceSessionResultUDR>) Contains the the charging answer for start, stop and update of a session For further information, see the section below, ServiceSessionResultUDR. transacSetsToCleanup (list <TransactionSetUDR>) Depending on the CleanupResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . ServiceSessionResultUDR This UDR contains information associated with Service Session. Field Description Field Description exception (CCExceptionUDR) Is set if the charging operation failed reservationId (string) The unique identifier for the service startRateResult (StartSessionResultUDR) This field is populated if a Service Session contains a Reservation Item. For further information, see the section below, StartSessionResultUDR. stopRateResult (StopSessionResultUDR) This field is populated if a Service Session contains a Confirmation Item or has Cancellation set to true. For further information, see the section below, StopSessionResultUDR. updateRateResult (UpdateSessionResultUDR) This field is populated if a Service Session contains a Confirmation Item and a Reservation Item. For further information, see the section below, UpdateSessionResultUDR. StartSessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a StartSessionUDR. Field Description Field Description allNotifications (list<NotificationUDR>) The aggregation of the three above notification lists. For further information, see Notification UDRs . currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD limit (string) The limit name (string) The name toConfirmMoneyAmount (string) A string representation of the amount to confirm. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toReserveMoneyAmount (string) A string representation of the charged amount to reserve. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 transactionSetsToCleanup (list<TransactionSetUDR>) Depending on the CleanupResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . transactionSetsToConfirm (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction set (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to confirm. For further information, see Common SAP CC UDRs . transactionSetsToReserve (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction set (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to reserve. For further information, see Common SAP CC UDRs . transactionCleanedupNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cleaned-up transactions For further information, see Notification UDRs . transactionConfirmedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the confirmed transactions. For further information, see Notification UDRs . transactionReservedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the reserved transactions. For further information, see Notification UDRs . transactionSetId (long) The transaction set id of the answer UpdateSessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a UpdateSessionUDR . Field Description Field Description accumulatedMoneyAmount (string) A string representation of the total amount confirmed since the beginning of the session. The accumulatedMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 allNotifications (list<NotificationUDR>) The aggregation of the three above notification lists. For further information, see Notification UDRs . currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD limit (string) The limit name (string) The name toCancelMoneyAmount (string) A string representation of the amount to cancel for this update. The toCancelMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toConfirmMoneyAmount (string) A string representation of the amount to confirm for this update. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toReserveMoneyAmount (string) A string representation of the charged amount to reserve for this update. The toReserveMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 transactionSetsToCancel (list<TransactionSetUDR>) Depending on the ResultType defined in the request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to cancel. For further information, see Common SAP CC UDRs . transactionSetsToCleanup (list<TransactionSetUDR>) Depending on the CleanupResultType defined in the request, it will contain the generated transaction set (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . transactionSetsToConfirm (list<TransactionSetUDR>) Depending on the ResultType defined in the request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to confirm. For further information, see Common SAP CC UDRs . transactionSetsToReserve (list<TransactionSetUDR>) Depending on the ResultType defined in the request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to reserve. For further information, see Common SAP CC UDRs . transactionCanceledNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cancelled transactions. For further information, see Notification UDRs . transactionCleanedupNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cleaned up transactions. For further information, see Notification UDRs . transactionConfirmedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the confirmed transactions. For further information, see Notification UDRs . transactionReservedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the reserved transactions. For further information, see Notification UDRs . StopSessionResultUDR This UDR represents the charging answer which could be received from the SAP Convergent Charging Core server in response to a StopSessionUDR . Field Description Field Description accumulatedMoneyAmount (string) A string representation of the total amount confirmed since the beginning of the session. The accumulatedMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toConfirmMoneyAmount (string) A string representation of the amount to confirm for this stop. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 toCancelMoneyAmount (string) A string representation of the amount to cancel for this stop. The toCancelMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD transactionSetsToCleanup (list<TransactionSetUDR>) Depending on the CleanupResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). For further information, see Common SAP CC UDRs . transactionSetsToConfirm (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to confirm. For further information, see Common SAP CC UDRs . transactionSetsToCancel (list<TransactionSetUDR>) Depending on the ResultType defined on the Request, it will contain the generated transaction (i.e. the detail generated by the pricing logic). This transaction set corresponds to the amount to cancel. For further information, see Common SAP CC UDRs . transactionCleanedupNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cleaned-up transactions ( list<TransactionSetUDR> ) For further information, see Notification UDRs . transactionConfirmedNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the confirmed transactions. For further information, see Notification UDRs . transactionCanceledNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification present in the cancelled transactions. For further information, see Notification UDRs . allNotifications (list<NotificationUDR>) The aggregation of the three above notification lists. For further information, see Notification UDRs . CCExceptionUDR This UDR represents a charging error that may be received from the SAP Convergent Charging Core server when charging fails, or as a result of failed validation of UDR field values ( BadUDRFormatException ) before the request is sent to the server. Every charging request could result in a CCExceptionUDR . Field Description Field Description cause (string) The stack trace of the exception message (string) A string description of the error message reason (string) A string description of the error reasonCode (int) A specific code for this error type (string) The type of the Exception. Can be: CommunicationFailureException IllegalArgumentException ServerFailureException InvalidItemException ForbiddenChargeException TransactionClearingException StartRateException StopRateException UpdateRateException DoesNotExistException CannotInverseException BadUDRFormatException TranslateResultUDR This UDR represents the result of a successful translate operation. Field Description Field Description translatedValues (string) A list of strings, including translated values ChargingResultUDR The result of a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description chargedItems (list<ChargedItemUDR>) This is the charged items returned as output from the charge operation. responseItems (list<ResponseItemUDR>) This is the response items that were generated from the charge operations. notifications(list<NotificationUDR>) This list contains the notifications produced during the price plan execution. AccountOperationTypeUDR This UDR represents the account operation type for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description CREDIT (AccountOperationTypeUDR (sapcc.accountOperation)) The account operation is a credit operation. DEBIT (AccountOperationTypeUDR (sapcc.accountOperation)) The account operation is a debit operation. AccountOperationUDR This UDR represents the details of an account operation for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description amount (MoneyUDR sapcc) A string representation of the price amount and currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD amountAssignments (list <AmountAssignmentUDR (sapcc.accountOperation)>) The list of amount assignments for the account operation. For more details on the possible values, see the field definitions in the section below, AmountAssignmentUDR. dependentAccountOperationKey (int) The numeric key of the account operation that it depends on, if applicable key (int) The numeric key of the account operation mainAccountReference (AccountReferenceUDR (sapcc.accountOperation)) The main account reference to the account impacted by the charging operation. For more details on the possible values, see the field definitions in the section below, AccountReferenceUDR. netAmount (MoneyUDR (sapcc)) A string representation of the net amount and currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD taxAmount (MoneyUDR (sapcc)) A string representation of the tax amount and currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example: EUR , or USD type (AccountOperationTypeUDR (sapcc.AccountOperation)) The type of account operation. For more details on the possible values, see the field definitions in the section above, AccountOperationTypeUDR. AccountReferenceTypeUDR This UDR represents the account reference type for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description EXTERNAL (AccountReferenceTypeUDR (sapcc.accountOperation)) The account reference is an external account. PREPAID (AccountReferenceTypeUDR (sapcc.accountOperation)) The account reference is a prepaid account. AccountReferenceUDR This UDR represents the reference to an account impacted by a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description id (string) The identifier of the account impacted by a charging operation. type (AccountReferenceTypeUDR (sapcc.accountOperation)) The type of account impacted by a charging operation. For details on the possible values, see the field definitions in the section above, AccountReferenceTypeUDR. AccountTypeUDR This UDR represents the account type for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description EXTERNAL (AccountTypeUDR sapcc) The account type is a postpaid account that is managed in a third-party accounting system. PREPAID (AccountTypeUDR sapcc) The count type is a prepaid account that is managed in the SAP CC system. UNDEFINED (AccountTypeUDR sapcc) The account type is not defined as external or prepaid. AmountAlertModelUDR This UDR represents the alert that could be received when the balance reaches a certain amount for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description amount (string) The amount that triggers an alert code (string) The code of the amount alert AmountAssignmentUDR This UDR represents the assignment of part of the amount of an amount operation to an account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description accountReference (AccountReferenceTypeUDR (sapcc.accountOperation)) The reference to the account impacted by a charging operation. For more details, see the field definitions in the section above, AccountReferenceTypeUDR. amount (MoneyUDR (sapcc)) A string representation of the amount and currency of the assignment amount. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format For example: EUR , or USD chargedItemKey (int) The numeric key of the charged item ChargeableItemInfoUDR This UDR inherits all fields from UniqueIdentifierUDR . ChargeableItemInfoUDR represents the details of the chargeable item associated to a charging result. ChargingContractInfoUDR This UDR represents the details of the charging contract associated to a charging result for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description chargingContractId (string) The identifier of the charging contract chargingContractItemId (string) The external identifier of the charging contract item subscriberAccountId (string) The identifier of the subscriber account associated to the charging contract. ChargingProcessInfoUDR This UDR represents the details of the charging process for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description chargedItemSetUniqueId (UniqueIdentifierUDR (sapcc)) The unique identifier of the charged item set generated by the charging process. For more details on the possible values, see the field definitions in the section below, UniqueIdentifierUDR. eventProcessingDate (date) The date when the event was processed ExpirationAlertModelUDR This UDR represents the alert that could be received before or after a reference date when the state of a prepaid account has changed for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description dayCount (int) The number of days before or after the reference state date of the prepaid account that this alert must be thrown refStateDate (ReferenceStateDateUDR (sapcc)) The reference state of the expiration alert. For more details on the possible values, see the the field definitions in the section below, ReferenceStateDateUDR. ExternalAccountModelUDR This UDR represents the external account defined in a subscriber account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description code (string) The code of the external account currencyCode (string) The currency code of the external account description (string) The description of the external account externalAccountCode (string) The external code of the external account systemCode (string) The system code of the external account type (ExternalAccountTypeUDR (sapcc)) The type of external account. For more details on the possible values, see the field definitions in the section below, ExternalAccountTypeUDR. ExternalAccountTypeUDR This UDR represents the type of external account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description PAYABLE (ExternalAccountTypeUDR (sapcc)) The external account type is payable. RECEIVABLE (ExternalAccountTypeUDR (sapcc)) The external account type is receivable. UNDEFINED (ExternalAccountTypeUDR (sapcc)) The external account is not defined as payable or receivable. PrepaidAccountModelUDR This UDR represents the details of a prepaid account for a charge or blank charge operation when the chargeExecutionContext is set in the request. The prepaid account is a balance defined by a minimal value that can be zero, but cannot be less than zero, unless overspending is granted. Field Description Field Description amount (string) A string representation of the amount of the prepaid account amountAlerts (list<AmountAlertModelUDR (sapcc)>) The list of amount alerts in the prepaid account. For more details on the possible values, see the field definitions in the section above, AmountAlertModelUDR. blockedStateDate (date) The blocked state date of the prepaid account closedStateDate (date) The closed state date of the prepaid account code (string) The code of the prepaid account currencyCode (string) The currency code of the prepaid account description (string) The description of the prepaid account emptyLimit (string) The minimal amount (empty limit) of the prepaid account. expirationAlerts (list<expirationAlertModelUDR (sapcc)>) The list of expiration alerts for the prepaid account. For more details on the possible values, see the field definitions in the section above, ExpirationAlertModelUDR. lockedStateDate (date) The locked state date of the prepaid account overrunAccountCode (string) The overrun account code of the prepaid account overrunAccountType (AccountTypeUDR (sapcc)) The overrun account type of the prepaid account. This field is optional. For more details on the possible values, see the field definitions in the section above AccountTypeUDR. ReferenceStateDateUDR This UDR represents the reference state date of the prepaid account for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description ACTIVE (ReferenceStateDateUDR (sapcc)) The alert must be thrown when the state of the prepaid account becomes active after it has been blocked or locked. In this case, the dayCount does not apply. BLOCKED (ReferenceStateDateUDR (sapcc)) The reference date of the alert is the blocked state date of the prepaid account. CLOSED (ReferenceStateDateUDR (sapcc)) The reference date of the alert is the closed state date of the prepaid account. LOCKED (ReferenceStateDateUDR (sapcc)) The reference date of the alert is the locked state date of the prepaid account. UniqueIdentifierUDR This UDR represents the unique identifier for a charge or blank charge operation when the chargeExecutionContext is set in the request. Field Description Field Description type (string) The type of unique identifier",
      "title": "Charging Answer UDRs - MediationZone Documentation 9.3 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204642846/Charging+Answer+UDRs",
      "word_count": 3268,
      "char_count": 24538
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T04:56:04.234139",
    "word_count": 3268,
    "char_count": 24538,
    "chunk_count": 1
  }
}