{
  "id": "wiki__spaces__MD94__pages__352113648__Common_SAP_CC_UDRs",
  "title": "Common SAP CC UDRs - MediationZone Documentation 9.4 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352113648/Common+SAP+CC+UDRs",
  "categories": [
    "space:MD94"
  ],
  "text": "ChargedItemFieldTypeUDR This is a constant UDR, where value returns either \"String\", \"Date\", \"Number\" or \"Boolean\", depending on if the field type is STRING , DATE , NUMBER , or BOOLEAN . For an example that describes how to get the value, see the section below, OperationTypeUDR. Field Description NUMBER Constant value \"Number\" STRING Constant value \"String\" BOOLEAN Constant value \"Boolean\" DATE Constant value \"Date\" value (string) The property type value, can be \"String\", \"Date\", \"Number\", or \"Boolean\". This is a read-only field. ChargedItemFieldUDR Field Description name (name) The name of the field type (ChargedItemFieldTypeUDR) The type of the field value (any) The value of the field which must be cast to the right type, based on the type field. Note that numbers are represented as strings. ChargedItemUDR Field Description key (int) The numeric key of the charged item chargedItemClassId (string) The class identifier corresponding to the charged item fields (list<ChargedItemFieldUDR>) A list of all the fields in the corresponding charged item ChargeExecutionContextUDR This UDR is used to limit what is included in the response of a charge or blank charge operation. Info! The Execution Context in the UDR name is not related to the Execution Context. Field Description outputChargeableItemExported This field determines whether chargeable items must be exported in the output of the charging operation. resultAccountInfoReturned This boolean field determines if the account information is returned in the result of the charging operation. resultAccountOperationReturned This boolean field determines if the account operations is returned in the result of the charging operation. resultAllReturned This boolean field determines if all available information is returned in the result of the charging operation. resultChargeableItemInfoReturned This boolean field determines if the chargeable item information is returned in the result of the charging operation. resultChargedItemReturned This boolean field determines if the charged item is returned in the result of the charging operation. resultChargingContractInfoReturned This boolean field determines if the charging contract information is returned in the result of the charging operation. resultChargingProcessInfoReturned This boolean field determines if the charging process information is returned in the result of the charging operation. resultNotificationReturned This boolean field determines if the notifications is returned in the result of the charging operation. resultResponseItemReturned This boolean field determines if the response items is returned in the result of the charging operation. TransactionSetUDR This UDR represents the TransactionSet associated with a charging request result. The transaction set may be empty. Field Description allNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification contained in all generated transactions (master and dependents). For further information, see Notification UDRs . dependentTransactionList (list<TransactionUDR>) This list contains the transactions generated by the associated dependent charges (if they exist). For further information, see the section below, TransactionUDR. masterTransaction (list<TransactionUDR>) This field contains the transaction generated by the master charge. For further information, see the section below, TransactionUDR. name (string) The name origin (string) The origin of the transaction set. It corresponds to the origin of the master transaction which can be: usage recurring oneshot snapshotId (int) The snapshot identifier used to rate event transactionSetId (long) The transaction set owner id ServiceSessionUDR This UDR represents the services associated with a Charging Request. Field Description cancellation (boolean) TRUE : Cancel session FALSE : Do not cancel session  this is the default value. confirmationItem (ChargeableItemUDR  optional) A ChargeableItem represents the information that the client needs to send to perform the charge process. It consists of a name and a list of properties. propertyToInverse (string) The name of the property used by the inverse rating process. This property must be contained in the chargeableItem definition on the SAP Convergent Charging Core server. reservationId (string) This field contains a unique identifier for the service. reservationItem (ChargeableItemUDR  optional) A ChargeableItem represents the information that the client needs to send to perform the charge process. It consist of a name and a list of properties. sessionResolutionMode (ResolutionModeUDR  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the session termination to apply if this particular session has reached its 'time to live'. The session can be either cancelled (cancel) or confirmed (confirm). sessionTTL (long  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the 'time to live' for this particular charging session. Note! This field will only work on SAP CC 5.0 SP1 and later. For older versions, this field will be present but it will not have any effect on the TTL. TransactionUDR This UDR represents the Transaction associated with a Charging Request Result. A transaction corresponds to the details of the price computation by the rating engine. It may be empty. Field Description currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example EUR , or USD detailList (list<TransactionDetailUDR>) This field contains the list of the transaction details produced during the price plan execution. It may be empty. For further information, see the section below, TransactionDetailUDR. dispatchCode1 (string) This field contains the value of the dispatch code. dispatchCode2 (string) This field contains the value of the dispatch code2. dispatchCode3 (string) This field contains the value of the dispatch code3. label (string) This field contains the label of the transaction. MoneyAmount (string) A string representation of the charged amount. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 notifList (list<NotificationUDR>) This list contains the notification produced during the price plan execution. For further information, see Notification UDRs . offerCode (string) This field contains the offer code of the subscription. chargeCode (string) This field contains the charge code of the subscription which leads to this transaction. operationType (OperationTypeUDR) This field contains the operation type of the transaction. It can be: CREDIT DEBIT origin (OriginUDR) This field contains the origin of the transaction. It can be: ONE_SHOT RECURRING USAGE relationshipType (RelationshipTypeUDR) This field contains the relationship type of the transaction. It can be: CLIENT PARTNER sessionId (string) When the transaction is produced during a session based rating, this field contains the corresponding session id. subscriptionCode (string) This field contains the subscription code against which the transaction was produced. transDate (date) The date of the transaction TransactionDetailUDR This UDR represents a transaction detail. It corresponds to a property produced during the price plan computation. TransactionDetailUDR is an instance of a PropertyUDR . For more details, refer to the section below, PropertyUDR. PropertyUDR This UDR is the base representation of a name-value property. In addition, a type can be added to specify how to cast the value. Field Description ccType (PropertyTypeUDR) The type of property. This field is read only. The ccType will be populated when the properties are returned while retrieving charged items. When it comes to submitting chargeable items, it can be left empty. The property types can be: STRING - Used for String, Boolean, or DRIpAddress Object types NUMBER - Used for Byte, Character, Short, Integer, Float, Double, Long and BigInteger object types DATE - Used for Date or DRDate Object types BIG_DECIMAL - Used for BigDecimal Object type. In this case the value will be a string representation of this bigDecimal ( BigDecimal.toPlainString() ). name (string) The name of the property value (any) The value of the property OperationTypeUDR This is a constant UDR, where value returns either \"1\" or \"0\", depending on if the operation type is CREDIT or DEBIT. This is an APL code example for how to get the operation type value: OperationTypeUDR rt = (OperationTypeUDR) input; if( rt.value == rt.DEBIT.value ) { ... ... } else if ( rt.value == rt.CREDIT.value ) { ... ... } Field Description CREDIT (OperationTypeUDR) Constant value 1 DEBIT (OperationTypeUDR) Constant value 0 value (string) The operation type value, which can be \"1\" or \"0\". This is a read-only field. OrderStateUDR This is a constant UDR, where value returns either \"2\" or \"1\", depending on if the order state is FREE or PAID. For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description FREE (OrderStateUDR) Constant value 2 PAID (OrderStateUDR) Constant value 1 value (string) The order state value, which can be \"2\" or \"1\". This is a read-only field. OriginUDR This is a constant UDR, where value returns either \"2\", \"1\" or \"0\", depending on if the origin is ONE_SHOT , RECURRING or USAGE . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description ONE_SHOT (OriginUDR) Constant value 2 RECURRING (OriginUDR) Constant value 1 USAGE (OriginUDR) Constant value 0 value (string) The origin value, which can be \"2\", \"1\" or \"0\". This is a read-only field. PropertyTypeUDR This is a constant UDR, where value returns either \"String\", \"Date\", \"Number\" or \"BigDecimal\", depending on if the property type is BIG_DECIMAL , DATE, NUMBER or STRING . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description BIG_DECIMAL (String) Constant value x DATE (Date) Constant value x NUMBER (Number) Constant value x STRING (BigDecimal) Constant value x value (string) The property type value, which can be \"String\", \"Date\", \"Number\" or \"BigDecimal\". This is a read-only field. RelationshipTypeUDR This is a constant UDR, where value returns either \"1\" or \"0\", depending on if the relationship type is PARTNER or CLIENT . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description CLIENT (RelationshipTypeUDR) Constant value 0 PARTNER (RelationshipTypeUDR) Constant value 1 value (string) The relationship type value, which can be \"1\" or \"0\". This is a read-only field. ResolutionModeUDR This is a constant UDR, where value returns either \"-1\", \"1\" or \"0\", depending on if the resolution mode is USE_DEFAULT , CANCEL, or CONFIRM . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description USE_DEFAULT (ResolutionModeUDR) Constant value -1 CANCEL (ResolutionModeUDR) Constant value 1 CONFIRM (ResolutionModeUDR) Constant value 0 value (string) The resolution mode value, which can be \"-1\", \"1\" or \"0\". This is a read-only field. ResponseItemUDR Field Description key (int) The numeric key of the response item chargedItemClassId (string) The class identifier corresponding to the response item fields (list<ChargedItemFieldUDR>) A list of all the fields in the corresponding response item ResultTypeUDR This is a constant UDR, where value returns either \"-1\", \"0\" or \"1\", \"2\" or \"3\" depending on if the result type is USE_DEFAULT , NO_TRANSACTIONS , MASTER_TRANSACTION , ALL_TRANSACTIONS, or ALL_TRANSACTIONS_AND_RECURRING . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description USE_DEFAULT (ResultTypeUDR) Constant value -1 NO_TRANSACTIONS (ResultTypeUDR) Constant value 0 MASTER_TRANSACTION (ResultTypeUDR) Constant value 1 ALL_TRANSACTIONS (ResultTypeUDR) Constant value 2 ALL_TRANSACTIONS_AND_RECURRING (ResultTypeUDR) Constant value 3 value (string) The result type value, which can be \"-1\", \"0\" or \"1\", \"2\" or \"3\". This is a read-only field. Loading",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "ChargedItemFieldTypeUDR This is a constant UDR, where value returns either \"String\", \"Date\", \"Number\" or \"Boolean\", depending on if the field type is STRING , DATE , NUMBER , or BOOLEAN . For an example that describes how to get the value, see the section below, OperationTypeUDR. Field Description NUMBER Constant value \"Number\" STRING Constant value \"String\" BOOLEAN Constant value \"Boolean\" DATE Constant value \"Date\" value (string) The property type value, can be \"String\", \"Date\", \"Number\", or \"Boolean\". This is a read-only field. ChargedItemFieldUDR Field Description name (name) The name of the field type (ChargedItemFieldTypeUDR) The type of the field value (any) The value of the field which must be cast to the right type, based on the type field. Note that numbers are represented as strings. ChargedItemUDR Field Description key (int) The numeric key of the charged item chargedItemClassId (string) The class identifier corresponding to the charged item fields (list<ChargedItemFieldUDR>) A list of all the fields in the corresponding charged item ChargeExecutionContextUDR This UDR is used to limit what is included in the response of a charge or blank charge operation. Info! The Execution Context in the UDR name is not related to the Execution Context. Field Description outputChargeableItemExported This field determines whether chargeable items must be exported in the output of the charging operation. resultAccountInfoReturned This boolean field determines if the account information is returned in the result of the charging operation. resultAccountOperationReturned This boolean field determines if the account operations is returned in the result of the charging operation. resultAllReturned This boolean field determines if all available information is returned in the result of the charging operation. resultChargeableItemInfoReturned This boolean field determines if the chargeable item information is returned in the result of the charging operation. resultChargedItemReturned This boolean field determines if the charged item is returned in the result of the charging operation. resultChargingContractInfoReturned This boolean field determines if the charging contract information is returned in the result of the charging operation. resultChargingProcessInfoReturned This boolean field determines if the charging process information is returned in the result of the charging operation. resultNotificationReturned This boolean field determines if the notifications is returned in the result of the charging operation. resultResponseItemReturned This boolean field determines if the response items is returned in the result of the charging operation. TransactionSetUDR This UDR represents the TransactionSet associated with a charging request result. The transaction set may be empty. Field Description allNotifications (list<NotificationUDR>) This list offers a shortcut to the generated Notification contained in all generated transactions (master and dependents). For further information, see Notification UDRs . dependentTransactionList (list<TransactionUDR>) This list contains the transactions generated by the associated dependent charges (if they exist). For further information, see the section below, TransactionUDR. masterTransaction (list<TransactionUDR>) This field contains the transaction generated by the master charge. For further information, see the section below, TransactionUDR. name (string) The name origin (string) The origin of the transaction set. It corresponds to the origin of the master transaction which can be: usage recurring oneshot snapshotId (int) The snapshot identifier used to rate event transactionSetId (long) The transaction set owner id ServiceSessionUDR This UDR represents the services associated with a Charging Request. Field Description cancellation (boolean) TRUE : Cancel session FALSE : Do not cancel session  this is the default value. confirmationItem (ChargeableItemUDR  optional) A ChargeableItem represents the information that the client needs to send to perform the charge process. It consists of a name and a list of properties. propertyToInverse (string) The name of the property used by the inverse rating process. This property must be contained in the chargeableItem definition on the SAP Convergent Charging Core server. reservationId (string) This field contains a unique identifier for the service. reservationItem (ChargeableItemUDR  optional) A ChargeableItem represents the information that the client needs to send to perform the charge process. It consist of a name and a list of properties. sessionResolutionMode (ResolutionModeUDR  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the session termination to apply if this particular session has reached its 'time to live'. The session can be either cancelled (cancel) or confirmed (confirm). sessionTTL (long  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the 'time to live' for this particular charging session. Note! This field will only work on SAP CC 5.0 SP1 and later. For older versions, this field will be present but it will not have any effect on the TTL. TransactionUDR This UDR represents the Transaction associated with a Charging Request Result. A transaction corresponds to the details of the price computation by the rating engine. It may be empty. Field Description currency (string) A string representation of the currency. The currency value respects the SAP Convergent Charging Currency.getAlphaCode() format. For example EUR , or USD detailList (list<TransactionDetailUDR>) This field contains the list of the transaction details produced during the price plan execution. It may be empty. For further information, see the section below, TransactionDetailUDR. dispatchCode1 (string) This field contains the value of the dispatch code. dispatchCode2 (string) This field contains the value of the dispatch code2. dispatchCode3 (string) This field contains the value of the dispatch code3. label (string) This field contains the label of the transaction. MoneyAmount (string) A string representation of the charged amount. The toConfirmMoneyAmount value respects the SAP Convergent Charging Money.toString() format. For example: EUR 12.15 , or USD 0.123456 notifList (list<NotificationUDR>) This list contains the notification produced during the price plan execution. For further information, see Notification UDRs . offerCode (string) This field contains the offer code of the subscription. chargeCode (string) This field contains the charge code of the subscription which leads to this transaction. operationType (OperationTypeUDR) This field contains the operation type of the transaction. It can be: CREDIT DEBIT origin (OriginUDR) This field contains the origin of the transaction. It can be: ONE_SHOT RECURRING USAGE relationshipType (RelationshipTypeUDR) This field contains the relationship type of the transaction. It can be: CLIENT PARTNER sessionId (string) When the transaction is produced during a session based rating, this field contains the corresponding session id. subscriptionCode (string) This field contains the subscription code against which the transaction was produced. transDate (date) The date of the transaction TransactionDetailUDR This UDR represents a transaction detail. It corresponds to a property produced during the price plan computation. TransactionDetailUDR is an instance of a PropertyUDR . For more details, refer to the section below, PropertyUDR. PropertyUDR This UDR is the base representation of a name-value property. In addition, a type can be added to specify how to cast the value. Field Description ccType (PropertyTypeUDR) The type of property. This field is read only. The ccType will be populated when the properties are returned while retrieving charged items. When it comes to submitting chargeable items, it can be left empty. The property types can be: STRING - Used for String, Boolean, or DRIpAddress Object types NUMBER - Used for Byte, Character, Short, Integer, Float, Double, Long and BigInteger object types DATE - Used for Date or DRDate Object types BIG_DECIMAL - Used for BigDecimal Object type. In this case the value will be a string representation of this bigDecimal ( BigDecimal.toPlainString() ). name (string) The name of the property value (any) The value of the property OperationTypeUDR This is a constant UDR, where value returns either \"1\" or \"0\", depending on if the operation type is CREDIT or DEBIT. This is an APL code example for how to get the operation type value: OperationTypeUDR rt = (OperationTypeUDR) input; if( rt.value == rt.DEBIT.value ) { ... ... } else if ( rt.value == rt.CREDIT.value ) { ... ... } Field Description CREDIT (OperationTypeUDR) Constant value 1 DEBIT (OperationTypeUDR) Constant value 0 value (string) The operation type value, which can be \"1\" or \"0\". This is a read-only field. OrderStateUDR This is a constant UDR, where value returns either \"2\" or \"1\", depending on if the order state is FREE or PAID. For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description FREE (OrderStateUDR) Constant value 2 PAID (OrderStateUDR) Constant value 1 value (string) The order state value, which can be \"2\" or \"1\". This is a read-only field. OriginUDR This is a constant UDR, where value returns either \"2\", \"1\" or \"0\", depending on if the origin is ONE_SHOT , RECURRING or USAGE . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description ONE_SHOT (OriginUDR) Constant value 2 RECURRING (OriginUDR) Constant value 1 USAGE (OriginUDR) Constant value 0 value (string) The origin value, which can be \"2\", \"1\" or \"0\". This is a read-only field. PropertyTypeUDR This is a constant UDR, where value returns either \"String\", \"Date\", \"Number\" or \"BigDecimal\", depending on if the property type is BIG_DECIMAL , DATE, NUMBER or STRING . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description BIG_DECIMAL (String) Constant value x DATE (Date) Constant value x NUMBER (Number) Constant value x STRING (BigDecimal) Constant value x value (string) The property type value, which can be \"String\", \"Date\", \"Number\" or \"BigDecimal\". This is a read-only field. RelationshipTypeUDR This is a constant UDR, where value returns either \"1\" or \"0\", depending on if the relationship type is PARTNER or CLIENT . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description CLIENT (RelationshipTypeUDR) Constant value 0 PARTNER (RelationshipTypeUDR) Constant value 1 value (string) The relationship type value, which can be \"1\" or \"0\". This is a read-only field. ResolutionModeUDR This is a constant UDR, where value returns either \"-1\", \"1\" or \"0\", depending on if the resolution mode is USE_DEFAULT , CANCEL, or CONFIRM . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description USE_DEFAULT (ResolutionModeUDR) Constant value -1 CANCEL (ResolutionModeUDR) Constant value 1 CONFIRM (ResolutionModeUDR) Constant value 0 value (string) The resolution mode value, which can be \"-1\", \"1\" or \"0\". This is a read-only field. ResponseItemUDR Field Description key (int) The numeric key of the response item chargedItemClassId (string) The class identifier corresponding to the response item fields (list<ChargedItemFieldUDR>) A list of all the fields in the corresponding response item ResultTypeUDR This is a constant UDR, where value returns either \"-1\", \"0\" or \"1\", \"2\" or \"3\" depending on if the result type is USE_DEFAULT , NO_TRANSACTIONS , MASTER_TRANSACTION , ALL_TRANSACTIONS, or ALL_TRANSACTIONS_AND_RECURRING . For an APL code example describing how to get the value, see the section above, OperationTypeUDR. Field Description USE_DEFAULT (ResultTypeUDR) Constant value -1 NO_TRANSACTIONS (ResultTypeUDR) Constant value 0 MASTER_TRANSACTION (ResultTypeUDR) Constant value 1 ALL_TRANSACTIONS (ResultTypeUDR) Constant value 2 ALL_TRANSACTIONS_AND_RECURRING (ResultTypeUDR) Constant value 3 value (string) The result type value, which can be \"-1\", \"0\" or \"1\", \"2\" or \"3\". This is a read-only field. Loading",
      "title": "Common SAP CC UDRs - MediationZone Documentation 9.4 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352113648/Common+SAP+CC+UDRs",
      "word_count": 1812,
      "char_count": 12362
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T04:29:35.595767",
    "word_count": 1812,
    "char_count": 12362,
    "chunk_count": 1
  }
}