{
  "id": "wiki__spaces__MD94__pages__352179328__Charging_Request_UDRs",
  "title": "Charging Request UDRs - MediationZone Documentation 9.4 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352179328/Charging+Request+UDRs",
  "categories": [
    "space:MD94"
  ],
  "text": "ChargeUDR This UDR is dedicated to submitting a charge request to the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. ciPropertyList (list<PropertyUDR>) The list of properties to be included in the chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. any bigint (BigInteger) boolean byte char date (DRDate) double float int ipaddress (DRIPAddress) long short string Others (bitset, bytearray, table, list, map, UDR, ) consumptionDate (date) The date of the consumption event resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. The correct instance of a ResultTypeUDR should be used: NO_TRANSACTIONS MASTER_TRANSACTION ALL_TRANSACTIONS ALL_TRANSACTIONS_AND_RECURRING USE_DEFAULT : indicates that the default agent configuration will be used for this request. Refer to the relevant agent configuration section for more details on the possible values. chargeExecutionContext (ChargeExecutionContextUDR  optional) This field defines what information is to be included in the response to this charge operation. This field cannot be combined with the resultType field. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging BlankChargeUDR This UDR is dedicated to submitting a blank charge request to the SAP Convergent Charging Core server. For the field definitions, refer to the section above, ChargeUDR. EstimateChargeUDR This UDR is dedicated to submitting a get estimated price request to the SAP Convergent Charging Core server. For the field definitions, refer to the section above, ChargeUDR. CheckLimitUDR This UDR is dedicated to submitting a check limit request to the SAP Convergent Charging Core server. This operation represents the property limit check operation also called Inverse Rating. This UDR defines additional fields to ChargeUDR : Field Description estimationMode (boolean - optional) TRUE : the default value FALSE : if set to false, the check limit operation is immediately followed by a final rating, using the found value for the inversed property. Note! The false value will impact the customer account. moneyLimit (string - optional) A string representation of the maximum amount of money available for the inverse rating. When the limit amount of money is not provided (null value), the limit is retrieved from the account balances. The moneyLimit value must respect the SAP Convergent Charging Money definition. For example: EUR 12.15 , or USD 0.123456 . precision (string - optional) The expected precision of the result The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. propertyToInverse (string) The name of the property used by the inverse rating process. This property must be contained in the chargeableItem definition on the SAP Convergent Charging Core server. SessionStartUDR This UDR is dedicated to starting a session-based rating of one or multiple services on the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. consumptionDate (date) The date of the consumption event enableReservationRenewalListener (boolean - optional) TRUE : Reservation Renewal Events are sent in session. FALSE : Reservation Renewal Events are not sent in session. externalData (bytearray) Optional external data that can be used when processing a Reservation Renewal Event. This data is not read or changed by SAP Convergent Charging. reservationRenewalListenerId (byte) The id is a number in the range of 1 to 127. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging services (list<ServiceSessionUDR>) A list of services to be charged in the session. The services may only contain Reservation Items when a session is started. For more details on the possible values, see the field definitions in the section ServiceSessionUDR in Common SAP CC UDRs . sessionCleanupResultType (ResultTypeUDR optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR . sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging StartSessionUDR This UDR is dedicated to starting a session-based rating of one service on the SAP Convergent Charging Core server. Note! This UDR is deprecated with later versions of SAP Convergent Charging and is replaced by SessionStartUDR. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. consumptionDate (date) The date of the consumption event. The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. propertyToInverse (string) The name of the property used by the best effort reservation process. This property must be contained in the chargeableItem definition on the SAP Convergent Charging Core server. reservationItemList (listPropertyUDR) The list of properties to be included in the reservation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. For more details on casting, see the field definitions in the section above , ChargeUDR. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR. sessionId (string) The unique identifier of the session sessionResolutionMode (ResolutionModeUDR  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the session termination to apply if this particular session reached its 'time to live'. The session can be either cancelled (cancel) or confirmed (confirm). sessionTTL (long  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the 'time to live' for this particular charging session. userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging SessionUpdateUDR This UDR is dedicated to updating a session-based rating of one or multiple services on the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The entire details of the price computation will be returned in the answer  this is the default value. consumptionDate (date) The date of the consumption event The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. externalData (bytearray) Optional external data that can be used when processing a Reservation Renewal Event. This data is not read nor changed by SAP CC Server. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR . serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging. services (list<ServiceSessionUDR>) A list of services to be charged in the session. For more details on the possible values, see the field definitions in the section ServiceSessionUDR in Common SAP CC UDRs . sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR . sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging UpdateSessionUDR This UDR is dedicated to updating a session-based rating of one service on the SAP Convergent Charging Core server. Note! This UDR is deprecated with later versions of SAP Convergent Charging and is replaced by SessionUpdateUDR. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. confirmationItemList (list<PropertyUDR> - optional) The list of properties to be included in the confirmation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. Note! If not present, the previous reservation item will be used for the confirmation. The confirmationItem can only redefine the modified properties. For more details on the casting, see the field definitions in the section above, ChargeUDR. consumptionDate (date) The date of the consumption event reservationItemList (list<PropertyUDR> - optional) The list of properties to be included in the new reservation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition Note! If not present, the previous reservation item will be used for the new reservation. The new reservation Item can only redefine the modified properties. For more details on the casting, see the field definitions in the section above, ChargeUDR . resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR. sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging. SessionStopUDR This UDR is dedicated to stopping a session-based rating of one or multiple services on the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. consumptionDate (date) The date of the consumption event. The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. externalData (bytearray - optional) Optional external data that can be used when processing a Reservation Renewal Event. This data is not read nor changed by SAP Convergent Charging. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging. services (list<ServiceSessionUDR>) A list of services to be charged in the session. The services may only contain Confirmation Items or have Cancellation set when a session is stopped. For more details on the possible values, see the field definitions in the section ServiceSessionUDR in Common SAP CC UDRs . sessionCleanupResultType (ResultTypeUDR  optional) This field could be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR . sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging. StopSessionUDR This UDR is dedicated to stopping a session-based rating of one service on the SAP Convergent Charging Core server. Note! This UDR is deprecated with later versions of SAP Convergent Charging and is replaced by SessionStopUDR . Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. confirmationItemList (list<PropertyUDR> - optional) The list of properties to be included in the confirmation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. Note! If not present, the previous reservation item will be used for the confirmation. The confirmationItem can only redefine the modified properties. For more details on the casting, see the field definitions in the section above, ChargeUDR. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging. sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR sessionId (string) The unique identifier of the session SessionResolutionMode (ResolutionModeUDR) The session termination to apply to the session. The session can be either cancelled (cancel) or confirmed (confirm). userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "ChargeUDR This UDR is dedicated to submitting a charge request to the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. ciPropertyList (list<PropertyUDR>) The list of properties to be included in the chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. any bigint (BigInteger) boolean byte char date (DRDate) double float int ipaddress (DRIPAddress) long short string Others (bitset, bytearray, table, list, map, UDR, ) consumptionDate (date) The date of the consumption event resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. The correct instance of a ResultTypeUDR should be used: NO_TRANSACTIONS MASTER_TRANSACTION ALL_TRANSACTIONS ALL_TRANSACTIONS_AND_RECURRING USE_DEFAULT : indicates that the default agent configuration will be used for this request. Refer to the relevant agent configuration section for more details on the possible values. chargeExecutionContext (ChargeExecutionContextUDR  optional) This field defines what information is to be included in the response to this charge operation. This field cannot be combined with the resultType field. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging BlankChargeUDR This UDR is dedicated to submitting a blank charge request to the SAP Convergent Charging Core server. For the field definitions, refer to the section above, ChargeUDR. EstimateChargeUDR This UDR is dedicated to submitting a get estimated price request to the SAP Convergent Charging Core server. For the field definitions, refer to the section above, ChargeUDR. CheckLimitUDR This UDR is dedicated to submitting a check limit request to the SAP Convergent Charging Core server. This operation represents the property limit check operation also called Inverse Rating. This UDR defines additional fields to ChargeUDR : Field Description estimationMode (boolean - optional) TRUE : the default value FALSE : if set to false, the check limit operation is immediately followed by a final rating, using the found value for the inversed property. Note! The false value will impact the customer account. moneyLimit (string - optional) A string representation of the maximum amount of money available for the inverse rating. When the limit amount of money is not provided (null value), the limit is retrieved from the account balances. The moneyLimit value must respect the SAP Convergent Charging Money definition. For example: EUR 12.15 , or USD 0.123456 . precision (string - optional) The expected precision of the result The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. propertyToInverse (string) The name of the property used by the inverse rating process. This property must be contained in the chargeableItem definition on the SAP Convergent Charging Core server. SessionStartUDR This UDR is dedicated to starting a session-based rating of one or multiple services on the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. consumptionDate (date) The date of the consumption event enableReservationRenewalListener (boolean - optional) TRUE : Reservation Renewal Events are sent in session. FALSE : Reservation Renewal Events are not sent in session. externalData (bytearray) Optional external data that can be used when processing a Reservation Renewal Event. This data is not read or changed by SAP Convergent Charging. reservationRenewalListenerId (byte) The id is a number in the range of 1 to 127. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging services (list<ServiceSessionUDR>) A list of services to be charged in the session. The services may only contain Reservation Items when a session is started. For more details on the possible values, see the field definitions in the section ServiceSessionUDR in Common SAP CC UDRs . sessionCleanupResultType (ResultTypeUDR optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR . sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging StartSessionUDR This UDR is dedicated to starting a session-based rating of one service on the SAP Convergent Charging Core server. Note! This UDR is deprecated with later versions of SAP Convergent Charging and is replaced by SessionStartUDR. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. consumptionDate (date) The date of the consumption event. The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. propertyToInverse (string) The name of the property used by the best effort reservation process. This property must be contained in the chargeableItem definition on the SAP Convergent Charging Core server. reservationItemList (listPropertyUDR) The list of properties to be included in the reservation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. For more details on casting, see the field definitions in the section above , ChargeUDR. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR. sessionId (string) The unique identifier of the session sessionResolutionMode (ResolutionModeUDR  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the session termination to apply if this particular session reached its 'time to live'. The session can be either cancelled (cancel) or confirmed (confirm). sessionTTL (long  optional) This optional field can be used to pass over the default agent configuration. If set, it defines the 'time to live' for this particular charging session. userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging SessionUpdateUDR This UDR is dedicated to updating a session-based rating of one or multiple services on the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The entire details of the price computation will be returned in the answer  this is the default value. consumptionDate (date) The date of the consumption event The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. externalData (bytearray) Optional external data that can be used when processing a Reservation Renewal Event. This data is not read nor changed by SAP CC Server. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR . serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging. services (list<ServiceSessionUDR>) A list of services to be charged in the session. For more details on the possible values, see the field definitions in the section ServiceSessionUDR in Common SAP CC UDRs . sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR . sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging UpdateSessionUDR This UDR is dedicated to updating a session-based rating of one service on the SAP Convergent Charging Core server. Note! This UDR is deprecated with later versions of SAP Convergent Charging and is replaced by SessionUpdateUDR. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. confirmationItemList (list<PropertyUDR> - optional) The list of properties to be included in the confirmation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. Note! If not present, the previous reservation item will be used for the confirmation. The confirmationItem can only redefine the modified properties. For more details on the casting, see the field definitions in the section above, ChargeUDR. consumptionDate (date) The date of the consumption event reservationItemList (list<PropertyUDR> - optional) The list of properties to be included in the new reservation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition Note! If not present, the previous reservation item will be used for the new reservation. The new reservation Item can only redefine the modified properties. For more details on the casting, see the field definitions in the section above, ChargeUDR . resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR. sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging. SessionStopUDR This UDR is dedicated to stopping a session-based rating of one or multiple services on the SAP Convergent Charging Core server. Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. consumptionDate (date) The date of the consumption event. The value must be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. externalData (bytearray - optional) Optional external data that can be used when processing a Reservation Renewal Event. This data is not read nor changed by SAP Convergent Charging. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR. serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging. services (list<ServiceSessionUDR>) A list of services to be charged in the session. The services may only contain Confirmation Items or have Cancellation set when a session is stopped. For more details on the possible values, see the field definitions in the section ServiceSessionUDR in Common SAP CC UDRs . sessionCleanupResultType (ResultTypeUDR  optional) This field could be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR . sessionId (string) The unique identifier of the session userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging. StopSessionUDR This UDR is dedicated to stopping a session-based rating of one service on the SAP Convergent Charging Core server. Note! This UDR is deprecated with later versions of SAP Convergent Charging and is replaced by SessionStopUDR . Field Description applyTransactionFilter (boolean - optional) TRUE : Only the details of the price computation which are not filtered will be returned in the answer. FALSE : The full details of the price computation will be returned in the answer  this is the default value. chargeableItemName (string) The name of the ChargeableItem which corresponds to this usage as defined in SAP Convergent Charging. A ChargeableItem represents the information that the client needs to be sent to perform the charge process. It consists of a name and a list of properties. confirmationItemList (list<PropertyUDR> - optional) The list of properties to be included in the confirmation chargeableItem as defined in SAP Convergent Charging ChargeableItem package definition. Note! If not present, the previous reservation item will be used for the confirmation. The confirmationItem can only redefine the modified properties. For more details on the casting, see the field definitions in the section above, ChargeUDR. resultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definition for resultType in the section above, ChargeUDR serviceId (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging. sessionCleanupResultType (ResultTypeUDR  optional) This field can be used to pass over the default agent configuration. For more details on the possible values, see the field definitions in the section above, ChargeUDR sessionId (string) The unique identifier of the session SessionResolutionMode (ResolutionModeUDR) The session termination to apply to the session. The session can be either cancelled (cancel) or confirmed (confirm). userId (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging",
      "title": "Charging Request UDRs - MediationZone Documentation 9.4 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352179328/Charging+Request+UDRs",
      "word_count": 2487,
      "char_count": 16399
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T04:49:05.237044",
    "word_count": 2487,
    "char_count": 16399,
    "chunk_count": 1
  }
}