{
  "id": "wiki__spaces__MD94__pages__352111629__IPDR_SP_UDRs",
  "title": "IPDR SP UDRs - MediationZone Documentation 9.4 - InfoZone",
  "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352111629/IPDR+SP+UDRs",
  "categories": [
    "space:MD94"
  ],
  "text": "The IPDR SP agent generates the following UDRs: SAMIS SAMIS_TYPE_1 SAMIS_TYPE_2 V3_0 V3_1 Data Simple TemplateData For a complete list of UDRs generated by the IPDR SP agent, refer to the UDR Assistance. Open UDR Internal Format Browser - IPDRSP UDRs SAMIS UDRs The following fields are included in the SAMIS UDRs: Field Description Field Description CMcpelpv4List (list<ipaddress>) This field contains a list of CPE IPv4 addresses that is associated with the cable modem. CMdocsisMode (int) This field indicates the registration mode of the cable modem. CMipAddress (ipaddress) This field contains the IP address of the cable modem. CMmacAddress (string) This field contains the MAC address of the cable modem. CMTScatvIfIndex (long) This field contains the ifIndex for the CMTS CATV interface. CMTScatvIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS CATV interface (ifType = 127) for this cable modem. CMTSdownIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS downstream interface for this cable modem. CMTShostName (string) This field indicates the fully qualified domain name for the CMTS, if available. CMTSipAddress ( ipaddress ) This field contains the IP address for the CMTS. CMTSsysUpTime (long) This field indicates the time (in hundredths of a second) since system initialization. CMTSupIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS upstream interface for this cable modem. CMTSupIfType (int) This field indicates the type of interface the cable modem is registered with. CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP exporter. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port. GateId (long) This field contains the GateID of the SF. The field can also contain the value 0. IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP record. RawData (bytearray) This field contains the raw data of the IPDR SP record. RecCreationTime (bigint) This field contains the timestamp (in milliseconds) of the time the data for the record was acquired. RecType (int) This field identifies the record type for the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. ServiceClassName (string) This field contains the Service Class Name (SCN) of the service flow. ServiceDirection (int) This field indicates the direction of the service flow from the CMTS cable interface. ServiceIdentifier (long) This field contains the service flow ID. ServiceOctetsPassed (bigint) This field contains a counter value of the octets that has passed through the service flow. ServicePktsPassed (bigint) This field contains a counter value of the packets that have passed through the service flow. ServiceSlaDelayPkts (long) This field contains a counter value of the packets that exceeds the SLA in the downstream service flow. ServiceSlaDropPkts (long) This field contains a counter value of the packets that has dropped as it has exceeded the SLA in the downstream service flow. ServiceTimeActive (long) This field describes the time service flow is active. ServiceTimeCreated (long) This field describes the creation time of the service flow. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. SAMIS_TYPE_1 UDRs The following fields are included in the SAMIS_TYPE_1 UDRs: Field Description Field Description CmIpv4Addr (ipaddress) This field contains the IPv4 address that is associated with the cable modem. CmIpv6Addr (ipaddress) This field contains the IPv6 address that is associated with the cable modem. CmIpv6LinkLocalAddr (ipaddress) This field contains the IPv4 Link Local address that is associated with the cable modem. CmLastRegTime (long) This field contains the date and time for when the cable modem was registered last. CmMacAddress (string) This field contains the MAC address of the cable modem. CmQosVersion (int) This field describes the queuing services registered by the cable modem. CmRegStatusValue (int) This field contains the unique identifying value for the cable modem. CmtsHostName (string) This field indicates the fully qualified domain name for the CMTS, if available. CmtsIpv4Addr (ipaddress) This field contains the IPv4 address of the CMTS. CmtsIpv6Addr (ipaddress) This field contains the IPv6 address of the CMTS. CmtsMdIfIndex (long) This field contains the ifIndex for the CMTS Mac Domain interface. CmtsMdIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS Mac Domain interface (ifType = 127) for this cable modem. CmtsSysUpTime (long) This field indicates the time (in hundredths of a second) since system initialization. CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP exporter. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP record. RawData (bytearray) This field contains the raw data of the IPDR SP record. RecCreationTime (bigint) This field contains the timestamp (in milliseconds) of the time the data for the record was acquired. RecType (int) This field identifies the record type for the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. ServiceAppId (long) This field contains the application identifier of the service flow. ServiceClassName (string) This field contains the Service Class Name (SCN) of the service flow. ServiceDirection (int) This field indicates the direction of the service flow from the CMTS cable interface. ServiceDsMulticast (boolean) This field indicates if the service flow is multicast or unicast. ServiceFlowChSet (bytearray) This field contains a set of channels configured for the service flow. ServiceGateId (long) This field contains the GateID of the service flow. The field can also contain the value 0. ServiceIdentifier (long) This field contains the service flow ID. ServiceOctetsPassed (bigint) This field contains a counter value of the octets that has passed through the service flow. ServicePktsPassed (bigint) This field contains a counter value of the packets that have passed through the service flow. ServiceSlaDelayPkts (long) This field contains a counter value of the packets that exceeds the SLA in the downstream service flow. ServiceSlaDropPkts (long) This field contains a counter value of the packets that has dropped as it has exceeded the SLA in the downstream service flow. ServiceTimeActive (long) This field describes the time service flow is active. ServiceTimeCreated (long) This field describes the creation time of the service flow. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. SAMIS_TYPE_2 UDRs The following fields are included in the SAMIS_TYPE_2 UDRs: Field Description Field Description CmMacAddress (string) This field contains the MAC address of the cable modem. CmtsHostName (string) This field indicates the fully qualified domain name for the CMTS, if available. CmtsMdIfIndex (long) This field contains the ifIndex for the CMTS Mac Domain interface. CmtsMdIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS Mac Domain interface (ifType = 127) for this cable modem. CmtsSysUpTime (long) This field indicates the time (in hundredths of a second) since system initialization. CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP record. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port. IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP exporter. RawData (bytearray) This field contains the raw data of the IPDR SP record. RecCreationTime (bigint) This field contains the timestamp (in milliseconds) of the time the data for the record was acquired. RecType (int) This field identifies the record type for the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. ServiceAppId (long) This field contains the application identifier of the service flow. ServiceClassName (string) This field contains the Service Class Name (SCN) of the service flow. ServiceDirection (int) This field indicates the direction of the service flow from the CMTS cable interface. ServiceDsMulticast (boolean) This field indicates if the service flow is multicast or unicast. ServiceFlowChSet (bytearray) This field contains a set of channels configured for the service flow. ServiceGateId (long) This field contains the GateID of the service flow. The field can also contain the value 0. ServiceIdentifier (long) This field contains the service flow ID. ServiceOctetsPassed (bigint) This field contains a counter value of the octets that has passed through the service flow. ServicePktsPassed (bigint) This field contains a counter value of the packets that have passed through the service flow. ServiceSlaDelayPkts (long) This field contains a counter value of the packets that exceeds the SLA in the downstream service flow. ServiceSlaDropPkts (long) This field contains a counter value of the packets that has dropped as it has exceeded the SLA in the downstream service flow. ServiceTimeActive (long) This field describes the time service flow is active. ServiceTimeCreated (long) This field describes the creation time of the service flow. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. V3_0 UDRs Open IPDRSP DOCSIS UDRs - V3_0 UDR The following UDR Types are available in the V3_0 UDR: CMTS_CM_REG_STATUS_TYPE CMTS_CM_SERVICE_FLOW_TYPE CMTS_CM_US_STATS_TYPE CMTS_DS_UTIL_STATS_TYPE CMTS_TOPOLOGY_TYPE CMTS_US_UTIL_STATS_TYPE CPE_TYPE DIAG_LOG_DETAIL_TYPE DIAG_LOG_EVENT_TYPE DIAG_LOG_TYPE IP_MULTICAST_STATS_TYPE SPECTRUM_MEASUREMENT_TYPE V3_1 UDRs Open IPDRSP DOCSIS UDRs - V3_1 UDR The following UDR Types are available in the V3_1 UDR: CMTS_CM_DS_OFDM_PROFILE_STATUS_TYPE CMTS_CM_DS_OFDM_STATUS_TYPE CMTS_CM_DS_OFDMA_PROFILE_STATUS_TYPE CMTS_CM_DS_OFDMA_STATUS_TYPE DS_OFDM_PROFILE_STATS_TYPE US_OFDMA_STATS_TYPE For more information on the fields included in the V3_0 and V3_1 UDRs, refer to Annex C in CM-SP-OSSIv3.0-I05-071206.pdf (cablelabs.com) . IPDRSP Data UDRs The following fields are included in the IPDRSP Data UDRs: Field Description Field Description CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP exporter. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port. IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP record. RawData (bytearray) This field contains the raw data of the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. IPDRSP Simple UDRs For more information on the fields in IPDRSP Simple UDRs, refer to IPDRSP Data UDRs . IPDRSP TemplateData UDRs The following fields are included in the IPDRSP TemplateData UDRs: Field Description Field Description Fields (FieldDescriptor) This field contains a list of 5 other fields: FieldId (int): Denotes the identifier of the field FieldName (string): Describes the name of the field IsEnabled (boolean): Set to true if enabled TypeId (int): Denotes the identifier for the type of field OriginalData (bytearray): Contains the original data in bytearray format SchemaName (string) This field describes the schema name of the IPDR SP template. TemplateId (short) This field contains the template ID for the IPDR SP template. TypeName (string) This field contains the type name for the IPDR template type. OriginalData (bytearray) This field contains the original data in bytearray format.",
  "chunks": [
    {
      "chunk_id": 1,
      "text": "The IPDR SP agent generates the following UDRs: SAMIS SAMIS_TYPE_1 SAMIS_TYPE_2 V3_0 V3_1 Data Simple TemplateData For a complete list of UDRs generated by the IPDR SP agent, refer to the UDR Assistance. Open UDR Internal Format Browser - IPDRSP UDRs SAMIS UDRs The following fields are included in the SAMIS UDRs: Field Description Field Description CMcpelpv4List (list<ipaddress>) This field contains a list of CPE IPv4 addresses that is associated with the cable modem. CMdocsisMode (int) This field indicates the registration mode of the cable modem. CMipAddress (ipaddress) This field contains the IP address of the cable modem. CMmacAddress (string) This field contains the MAC address of the cable modem. CMTScatvIfIndex (long) This field contains the ifIndex for the CMTS CATV interface. CMTScatvIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS CATV interface (ifType = 127) for this cable modem. CMTSdownIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS downstream interface for this cable modem. CMTShostName (string) This field indicates the fully qualified domain name for the CMTS, if available. CMTSipAddress ( ipaddress ) This field contains the IP address for the CMTS. CMTSsysUpTime (long) This field indicates the time (in hundredths of a second) since system initialization. CMTSupIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS upstream interface for this cable modem. CMTSupIfType (int) This field indicates the type of interface the cable modem is registered with. CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP exporter. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port. GateId (long) This field contains the GateID of the SF. The field can also contain the value 0. IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP record. RawData (bytearray) This field contains the raw data of the IPDR SP record. RecCreationTime (bigint) This field contains the timestamp (in milliseconds) of the time the data for the record was acquired. RecType (int) This field identifies the record type for the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. ServiceClassName (string) This field contains the Service Class Name (SCN) of the service flow. ServiceDirection (int) This field indicates the direction of the service flow from the CMTS cable interface. ServiceIdentifier (long) This field contains the service flow ID. ServiceOctetsPassed (bigint) This field contains a counter value of the octets that has passed through the service flow. ServicePktsPassed (bigint) This field contains a counter value of the packets that have passed through the service flow. ServiceSlaDelayPkts (long) This field contains a counter value of the packets that exceeds the SLA in the downstream service flow. ServiceSlaDropPkts (long) This field contains a counter value of the packets that has dropped as it has exceeded the SLA in the downstream service flow. ServiceTimeActive (long) This field describes the time service flow is active. ServiceTimeCreated (long) This field describes the creation time of the service flow. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. SAMIS_TYPE_1 UDRs The following fields are included in the SAMIS_TYPE_1 UDRs: Field Description Field Description CmIpv4Addr (ipaddress) This field contains the IPv4 address that is associated with the cable modem. CmIpv6Addr (ipaddress) This field contains the IPv6 address that is associated with the cable modem. CmIpv6LinkLocalAddr (ipaddress) This field contains the IPv4 Link Local address that is associated with the cable modem. CmLastRegTime (long) This field contains the date and time for when the cable modem was registered last. CmMacAddress (string) This field contains the MAC address of the cable modem. CmQosVersion (int) This field describes the queuing services registered by the cable modem. CmRegStatusValue (int) This field contains the unique identifying value for the cable modem. CmtsHostName (string) This field indicates the fully qualified domain name for the CMTS, if available. CmtsIpv4Addr (ipaddress) This field contains the IPv4 address of the CMTS. CmtsIpv6Addr (ipaddress) This field contains the IPv6 address of the CMTS. CmtsMdIfIndex (long) This field contains the ifIndex for the CMTS Mac Domain interface. CmtsMdIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS Mac Domain interface (ifType = 127) for this cable modem. CmtsSysUpTime (long) This field indicates the time (in hundredths of a second) since system initialization. CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP exporter. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP record. RawData (bytearray) This field contains the raw data of the IPDR SP record. RecCreationTime (bigint) This field contains the timestamp (in milliseconds) of the time the data for the record was acquired. RecType (int) This field identifies the record type for the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. ServiceAppId (long) This field contains the application identifier of the service flow. ServiceClassName (string) This field contains the Service Class Name (SCN) of the service flow. ServiceDirection (int) This field indicates the direction of the service flow from the CMTS cable interface. ServiceDsMulticast (boolean) This field indicates if the service flow is multicast or unicast. ServiceFlowChSet (bytearray) This field contains a set of channels configured for the service flow. ServiceGateId (long) This field contains the GateID of the service flow. The field can also contain the value 0. ServiceIdentifier (long) This field contains the service flow ID. ServiceOctetsPassed (bigint) This field contains a counter value of the octets that has passed through the service flow. ServicePktsPassed (bigint) This field contains a counter value of the packets that have passed through the service flow. ServiceSlaDelayPkts (long) This field contains a counter value of the packets that exceeds the SLA in the downstream service flow. ServiceSlaDropPkts (long) This field contains a counter value of the packets that has dropped as it has exceeded the SLA in the downstream service flow. ServiceTimeActive (long) This field describes the time service flow is active. ServiceTimeCreated (long) This field describes the creation time of the service flow. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. SAMIS_TYPE_2 UDRs The following fields are included in the SAMIS_TYPE_2 UDRs: Field Description Field Description CmMacAddress (string) This field contains the MAC address of the cable modem. CmtsHostName (string) This field indicates the fully qualified domain name for the CMTS, if available. CmtsMdIfIndex (long) This field contains the ifIndex for the CMTS Mac Domain interface. CmtsMdIfName (string) This field contains the ifName of the Interfaces Group MIB for the row entry corresponding to the CMTS Mac Domain interface (ifType = 127) for this cable modem. CmtsSysUpTime (long) This field indicates the time (in hundredths of a second) since system initialization. CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP record. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port. IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP exporter. RawData (bytearray) This field contains the raw data of the IPDR SP record. RecCreationTime (bigint) This field contains the timestamp (in milliseconds) of the time the data for the record was acquired. RecType (int) This field identifies the record type for the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. ServiceAppId (long) This field contains the application identifier of the service flow. ServiceClassName (string) This field contains the Service Class Name (SCN) of the service flow. ServiceDirection (int) This field indicates the direction of the service flow from the CMTS cable interface. ServiceDsMulticast (boolean) This field indicates if the service flow is multicast or unicast. ServiceFlowChSet (bytearray) This field contains a set of channels configured for the service flow. ServiceGateId (long) This field contains the GateID of the service flow. The field can also contain the value 0. ServiceIdentifier (long) This field contains the service flow ID. ServiceOctetsPassed (bigint) This field contains a counter value of the octets that has passed through the service flow. ServicePktsPassed (bigint) This field contains a counter value of the packets that have passed through the service flow. ServiceSlaDelayPkts (long) This field contains a counter value of the packets that exceeds the SLA in the downstream service flow. ServiceSlaDropPkts (long) This field contains a counter value of the packets that has dropped as it has exceeded the SLA in the downstream service flow. ServiceTimeActive (long) This field describes the time service flow is active. ServiceTimeCreated (long) This field describes the creation time of the service flow. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. V3_0 UDRs Open IPDRSP DOCSIS UDRs - V3_0 UDR The following UDR Types are available in the V3_0 UDR: CMTS_CM_REG_STATUS_TYPE CMTS_CM_SERVICE_FLOW_TYPE CMTS_CM_US_STATS_TYPE CMTS_DS_UTIL_STATS_TYPE CMTS_TOPOLOGY_TYPE CMTS_US_UTIL_STATS_TYPE CPE_TYPE DIAG_LOG_DETAIL_TYPE DIAG_LOG_EVENT_TYPE DIAG_LOG_TYPE IP_MULTICAST_STATS_TYPE SPECTRUM_MEASUREMENT_TYPE V3_1 UDRs Open IPDRSP DOCSIS UDRs - V3_1 UDR The following UDR Types are available in the V3_1 UDR: CMTS_CM_DS_OFDM_PROFILE_STATUS_TYPE CMTS_CM_DS_OFDM_STATUS_TYPE CMTS_CM_DS_OFDMA_PROFILE_STATUS_TYPE CMTS_CM_DS_OFDMA_STATUS_TYPE DS_OFDM_PROFILE_STATS_TYPE US_OFDMA_STATS_TYPE For more information on the fields included in the V3_0 and V3_1 UDRs, refer to Annex C in CM-SP-OSSIv3.0-I05-071206.pdf (cablelabs.com) . IPDRSP Data UDRs The following fields are included in the IPDRSP Data UDRs: Field Description Field Description CollConfigId (short) This field contains the collector configuration identifier of the IPDR SP record. ConnectionKey (string) This field contains the connection key which is used to identify the connection between agent and the exporter. CreationTime (date) This field indicates the creation time of the UDR. DocumentId (bytearray) This field indicates the document identifier of the IPDR SP record. ExporterAddress (string) This field contains the connection address of the IPDR SP exporter address. ExporterBootTime (date) This field contains the details of the exporter boot time received from the IPDR SP exporter. ExporterPort (int) This field contains the connection port of the IPDR SP exporter port. IsDuplicate (boolean) This field designates the value of the duplicate flag for the IPDR SP record. RawData (bytearray) This field contains the raw data of the IPDR SP record. SeqNo (long) This field identifies the sequence number for the IPDR SP record. SessionId (int) This field contains the session ID of the IPDR SP record. TemplateId (int) This field contains the template ID of the IPDR SP record. TemplateUDR (TemplateData (IPDRSP)) This field contains the TemplateData UDR representing the actual template structure used by the IPDR SP record. OriginalData (bytearray) This field contains the original data in bytearray format. IPDRSP Simple UDRs For more information on the fields in IPDRSP Simple UDRs, refer to IPDRSP Data UDRs . IPDRSP TemplateData UDRs The following fields are included in the IPDRSP TemplateData UDRs: Field Description Field Description Fields (FieldDescriptor) This field contains a list of 5 other fields: FieldId (int): Denotes the identifier of the field FieldName (string): Describes the name of the field IsEnabled (boolean): Set to true if enabled TypeId (int): Denotes the identifier for the type of field OriginalData (bytearray): Contains the original data in bytearray format SchemaName (string) This field describes the schema name of the IPDR SP template. TemplateId (short) This field contains the template ID for the IPDR SP template. TypeName (string) This field contains the type name for the IPDR template type. OriginalData (bytearray) This field contains the original data in bytearray format.",
      "title": "IPDR SP UDRs - MediationZone Documentation 9.4 - InfoZone",
      "url": "https://infozone.atlassian.net/wiki/spaces/MD94/pages/352111629/IPDR+SP+UDRs",
      "word_count": 2277,
      "char_count": 15360
    }
  ],
  "metadata": {
    "scraped_at": "2025-06-24T03:52:30.825422",
    "word_count": 2277,
    "char_count": 15360,
    "chunk_count": 1
  }
}