[
  {
    "chunk_id": 1,
    "text": "APL Collection Strategy configurations are used on top of pre-defined collection strategies to customize how files are collected from the local file system. Prerequisites The reader of this document should be familiar with: Analysis Programming Language. For further information, see the APL Reference Guide . Configuration To open the configuration, go to Build  New Configuration and then select APL Collection Strategy from the menu. Open The APL Collection Strategy Configuration Setting Description Setting Description Base Collection Strategy From the drop-down list , select a pre-defined collection strategy. The Default Collection Strategy is the standard collection strategy that is used by default by the Disk and FTP agents. The available strategies are: Default Collection Strategy Control File Duplicate Filter Multi Directory TMO Full Collection Strategy Note! The Base Collection Strategy is the collection strategy that your APL Extension will be based on. When saving your new collection strategy, make sure to use a descriptive name since it will be added to the list of available strategies in the agent's configuration. The code that you see in the dialog is a default 'skeleton' set of function blocks that are already defined in the Base Collection Strategy . By adding APL code within these function blocks, you customize the way by which the collection is going to be handled by the workflow. initialize deinitialize prepareBaseDirList accept filterFiles preFileCollection postFileCollection begin commit rollback For more information about APL functions blocks and functions, see the APL Reference Guide . The FileInfo UDR Type The FileInfo UDR type includes the properties of the file to collect or a directory where files are stored. The FileInfo UDR type can be viewed in the UDR Internal Format Browser. To open the browser right-click in the editing area of an APL Editor and select UDR Assistance... . The browser opens. Open UDR Internal Format Browser - FileInfo UDR Type FileInfo UDR Fields The following fields are included in the FileInfo UDR: Field Description Field Description isDirectory(boolean) Set to True if FileInfo represents a directory. isFile(boolean) Set to True if FileInfo represents a file. name(string) The name of the file or directory. size(long) The size of the file or directory. timestamp(long) The timestamp for when the file or directory was last modified.",
    "title": "APL Collection Strategy - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205654949/APL+Collection+Strategy",
    "word_count": 372,
    "char_count": 2418
  }
]