[
  {
    "chunk_id": 1,
    "text": "With the Error Codes option, errors can be specified in Data Veracity and associated with the erroneous UDRs or batch files. Error Codes could be used as an option when configuring the Data Veracity Collection Agent as it is used as an identifier for the workflow to collect certain Data Veracity record UDRs with the corresponding Error Codes. There are two predefined Error Codes within the system, AGGR_UNMATCHED_UDR and DUPLICATE_UDR , which are automatically set by the Aggregation and Duplicate UDR Detection agents when the corresponding error condition is detected. All other Error Codes are defined by the user. Open Data Veracity - Error Codes Error Code Sort Order Sorting by Name column is based on Javas default sorting behavior for Strings(for example, sorting of alphabetical characters in Java is case sensitive). To create an Error Code, click on the New button. This will display the Data Veracity Create Error Code dialog. This is where assignments of new Error Codes are made. Open Data Veracity Create Error Code dialog Item Description Item Description Error Code The Error Code that will be attached to UDRs or batches. Description A description of the error code. A user may send optional information to Data Veracity from an Analysis or an Aggregation agent, as long as an Error Code has been defined. To this Error Code, any information may be appended using APL. See the example below. Example An Error Case can be appended using APL code. udrAddError( input, \"CALL ID ERROR\", \"The callId: \" + input.callId + \", Calling number: \" + input.anum ); In this example the \"CALL ID ERROR\" is defined in the Data Veracity Error Code dialog, found in the Error Code Web UI Note! To clear the errors for a UDR the udrClearErrors function should be used.",
    "title": "Error Codes - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204606841/Error+Codes",
    "word_count": 298,
    "char_count": 1770
  }
]