[
  {
    "chunk_id": 1,
    "text": "The answer field for CCBatchcycleUDR may contain a UDR that is described here or a UDR in Charging Answer UDRs . AcquisitionExceptionUDR This UDR represents the exception thrown when a direct batch acquisition operation of a collection of chargeable items fails in the connected SAP CC Server system. Field Description Field Description message (string) A string description of the error message reason (string) A string description of the reason for the exception REASON_ACCESS_NOT_FOUND (string) This exception is thrown when the service identifier (SID), user service identifier (USID), and consumption date specified in the operation request, do not correspond to existing access data in the customer master data of the service provider. REASON_ACQUISITION_NOT_ALLOWED (string) This exception is thrown when the acquisition operation request is not allowed. REASON_EXPORT_FAILURE (string) This exception is thrown when the chargeable item cannot be exported. REASON_INVALID_ACCESS (string) This exception is thrown when one of the access information subelements specified in the operation request (service identifier (SID), user service identifier (USID), or consumption date) is empty. REASON_INVALID_CHARGEABLE_ITEM (string) This exception is thrown when the chargeable item to acquire is not specified in the operation request or its name is empty. REASON_SERVER_FAILURE (string) This exception is thrown when an unexpected error occurs during the acquisition of the chargeable item. REASON_TARGET_NOT_FOUND (string) This exception is thrown when the provider contract (or subscription) targeted by the access cannot be found in the customer master data of the service provider. REASON_COMMUNICATION_FAILURE (string) This exception is thrown when a communication failure occurs during the acquisition of the chargeable item. AcquisitionResultsUDR This UDR represents the operation results replied by the connected SAP Convergent Charging server in response to a batch acquisition operation request of a chargeable item or a collection of chargeable items. For the field definitions, see the section below, AcquisitionResultUDR. AcquisitionResultUDR This UDR represents the operation result replied by the connected SAP Convergent Charging server in response to a batch acquisition operation request of a chargeable item or a collection of chargeable items. Field Description Field Description exception (AcquisitionExceptionUDR (sapcc.batch)) This field indicates the exception that describes the error encountered during the acquisition of the chargeable item. For more details on the possible values, see the section above, AcquisitionExceptionUDR. isSuccessful (boolean) This field indicates whether the corresponding chargeable item was acquired successfully. operandReference (string) This field is populated with the code or the reference (if no code exists) that identifies the operand of the operation request. If the operation is not auditable, the operand reference is null.",
    "title": "Batch Answer - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204642810/Batch+Answer",
    "word_count": 415,
    "char_count": 2991
  }
]