[
  {
    "chunk_id": 1,
    "text": "Usage usage: vcexport [options] Options Options Description Options Description [-d, --directory] Use this option to specify in which directory you want to place the exported data. If the directory does not exist, it will be created. [-es, --excludesysdata] Use this option to exclude system data from the export. For example, you can exclude ECS related data, event categories, and workflow alarm values. [-f, --folders] Use this option to specify which folders you want to include in the export. For example, mzcli <user name>/<password> vcexport -d MyDirectory/ -f Default Alarms will export the configurations in the folders Default and Alarms to the directory MyFolder. If this option is not used, the configurations in all folders will be exported. [-im, --includemeta] Use this option to include meta data in the export. This will not be done by default, since not including meta data will make it easier to make a file compare between the exports. [-o, --overwrite] Use this option to enable existing exports in the stated directory to be overwritten. This command exports configurations in a format that is adapted for version control systems. The vcexport command exports the configurations into a flat structure, i e with file extensions instead of directories. For each exported configuration, a .xsd file will be generated in which the structure of the data is stored, which will produce a more compact format than the other export commands can offer. Return Codes Listed below are the different return codes for the vcexport command: Code Description Code Description 0 Will be returned if the export was successful. 1 Will be returned if the command could not be interpreted, e g if a option that does not exist has been entered. 2 Will be returned if the export failed. 3 Will be returned if the folder you want to export to, stated with the -d, --directory option, could not be created. 5 Will be returned if the folder(s) stated, when using the -f, --folders option, does not exist.",
    "title": "mzcli - vcexport - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/547980405/mzcli+-+vcexport",
    "word_count": 330,
    "char_count": 2000
  }
]