[
  {
    "chunk_id": 1,
    "text": "In order to send a UDR to the ECS, a workflow must contain an ECS forwarding agent. To perform a table lookup for all UDRs, an Analysis agent is used. If the lookup succeeded, the UDR is sent on the OK route to be saved on disk, while the failing UDRs are sent to the ECS forwarding agent. In the collection workflow the same evaluation is tried again. If it fails, the UDR is sent back to the ECS with the same configuration. To be able to collect ECS data, the UDRs or batches must each belong to an existing reprocessing group, and the reprocessing state must be set to New . Open A workflow collecting and validating ECS data Since we want to redo the processing made in the forwarding workflow, we keep the configurations of the ECS Inspector and ECS forwarding agents the same as in the previous workflow. Workflow Properties The Error tab in the Workflow properties must not be configured to handle cancelBatch behavior, since it will never be valid for ECS collection workflows. No calls to cancelBatch are allowed from any agent since it will cause the workflow to immediately abort. ECS Collection Agent All UDRs conforming to the collection criteria are selected and processed as a batch. Analysis Agent The Analysis agent only needs to validate and route the UDRs. The Error Code and Error Case are already associated with the UDR. Example - Analysis agent udrRoute( input, \"error\" ); Example - Reassigning to a Different Reprocessing Group Suppose there is a workflow collecting and validating UDRs from the ECS. If the validation fails, the UDRs are sent back to the ECS with an associated Error Code. UDRs assigned to a new or a different Error Code are directed to a new reprocessing group. If you need to associate these UDRs with a different reprocessing group, udrClearErrors must be called prior to udrAddError . The exception is if the new Error Code is associated with the same reprocessing group. Case 1 - Same reprocessing group If the new Error Code belongs to the same reprocessing group: Using udrClearErrors results in a new Error Code and reprocessing group to be associated with the UDR in the ECS. This method avoids several Error Codes pointing at different reprocessing groups, which makes automatic group assignment impossible. Leaving out udrClearErrors results in old and new Error Codes (including the reprocessing group) to be associated with the UDR in the ECS. Case 2 - Different reprocessing group If the new Error Code belongs to a different reprocessing group: Using udrClearErrors results in a new Error Code and reprocessing group to be associated with the UDR in the ECS. Leaving out udrClearErrors does not result in any association to a reprocessing group, however both Error Codes are associated with the UDR in the ECS. Note! All UDRs collected when activating the workflow are processed as one batch. Any call to cancelBatch causes the workflow to abort immediately. For more information, refer to cancelBatch . Note! For more information on the UDR functions mentioned above, see UDR Functions | udrAddError and UDR Functions | udrClearErrors . For details on the cancelBatch workflow function, see Workflow Functions | cancelBatch .",
    "title": "ECS Collection Workflow (UDR) - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204673020",
    "word_count": 538,
    "char_count": 3185
  }
]