[
  {
    "chunk_id": 1,
    "text": "The workflow table is located at the bottom of the workflow template. There must always be at least one valid and runnable workflow per workflow configuration, otherwise it will not be valid. The three leftmost columns gather the workflow meta data: Valid, ID, and Name. A workflow table always contains these columns. The ID is automatically generated starting at 1. The ID is unique within the workflow configuration. The Name is generated based on the ID, for example 'Workflow_1'. The names can be edited, however, if two workflows have exactly the same name a validation error will occur. The workflow table is populated depending on settings made in the Workflow Properties dialog, in the Workflow Table tab. For example adding rows and field type settings is done there and will propagate changes in the workflow table. Apart from the three first columns, columns in the table represent fields of Default and Per Workflow type. See Workflow Properties for further information about the field types. You can also configure your own fields to be referenced by your APL code, which can be updated. The fields are configured in the Workflow Properties and referenced by the APL command dynamicFieldGet . The fields can be of either boolean , int , or string type, and you can configure different categories for the fields, for an easier overview. Open Example of a workflow table If there is a default value for a field, it is displayed in the table as <default value> . If no default value is set in the agent in the template, < > is displayed. If the field is of a Per Workflow type and not yet defined, the symbol is shown in the cell pointing out that the cell is not valid. Different icons that can appear in the workflow table: Icon Description Icon Description Open Workflow is not yet validated Open Workflow is valid and runnable Open Workflow is invalid Open The cell is invalid. Open The field contains an External Reference. The order of table rows can be switched to not ordered, ascending or descending by clicking on the header one or multiple times. Info! Number fields will be numerically ordered and other fields will be ordered alphabetically. If External References are used, ordering will be done alphabetically by External Reference name. If the column is for a number field, numbers will be numerically ordered and separately grouped from the alphabetically ordered External References cells. Table Toolbar The workflow table toolbar presents you with options to manipulate each workflow and any data within the rows. The following are the buttons found on the bar: With no workflows selected With no workflows selected Open Option Description Search Allows you to search the text of all columns. The Valid column is excluded from the search as it only have icons for values. Add workflow Creates a new workflow by adding a row into the workflow table. The button opens the Add Workflow dialog and allows you to rename the workflow. If you have set some of the agent configuration to be configurable per workflow in the Workflow Properties then you will be able to configure those fields. Export Opens an export dialog where you select and save workflow configurations in a file. With this export file you transfer and update workflow table data either on your current machine or on a different client. The export file can be created in the following format: .csv The .csv export file contains a header row, comma (,) delimited fields, and text values that are delimited by a quotation mark (\"). Exported fields that contain profiles are given a unique string identifier. The ID and Name fields are exported as well. In the export file, External References are enclosed in braces ({}) and preceded by a dollar symbol ($), for example ${OUTPUT_DIR} . For further information see External Reference Profile . Import Opens an import dialog where you can import an exported file. This file might contain, for example, data that has been saved in the workflow table, locally or on a different client. This command supports the following file format: .csv Selecting Keep old workflows will result in the contents of the file being appended into the workflow table. Selecting Save before import will save the workflow configuration before proceeding with the import. This is so you can rollback to the previous version in case the import goes wrong. Importing a table may result in any of the following scenarios: If the ID number of the imported workflow (a table row), is identical to the ID number of one of the rows that are already in the table, the imported entry overwrites the existing one. If the ID number of the imported workflow is -1, the imported entry is added to the bottom of the table. If the ID number of the imported workflow does not exist in the table and is not equal to -1, the imported entry is added to the table. The ID number remains the same number as it was in the import file. With one workflow selected Open Option Description Clear selection(s) Clears the currently selected row so that it is not selected anymore. Edit Opens the Edit Workflow dialog where you are able to edit the agent configuration field values that have been set to be configurable per workflow. For more on what per workflow is, refer to Workflow Properties . Delete Removes the entire workflow and all configurations associated with the selected row. If removed, the ID number of that workflow will never again return within that workflow configuration. Validation Message Opens an Information dialog where a message regarding the validity of the template, workflow, and cell is shown. With many workflows selected Open Option Description Clear selection(s) Clears all currently selected row(s). Delete Removes the entire workflow and all configurations associated with the selected rows. If removed, the ID number of that workflow will never again return within that workflow configuration. Right-Click Menu Item Description Item Description Edit Opens the Edit Workflow dialog where you are able to edit the agent configuration field values that have been set to be configurable per workflow. For more on what per workflow is, refer to Workflow Properties . Delete Removes the entire Workflow that is associated with the selected row. If removed, the ID number of that workflow will never again return within that workflow configuration. To remove more than one workflow, select all the relevant rows. Validation Message Opens an Information dialog where a message regarding the validity of the template, workflow, and cell is shown.",
    "title": "Workflow Table - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204997546",
    "word_count": 1100,
    "char_count": 6560
  }
]