[
  {
    "chunk_id": 1,
    "text": "The rollback procedure is designed to restore the system to its original state before the upgrade. If the upgrade fails, a rollback will be triggered automatically to revert the file system, configuration files, and database to their previous states. This ensures system stability and consistency. You can do a manual rollback but this is not recommended if changes have been made to the system or database after the upgrade, since it may result in inconsistencies or corruption. Automatic Rollback When an upgrade fails, the rollback process begins automatically. Below is an example of the logs you might encounter during an upgrade from version 9.3.1.9 to 9.3.2.0: === Starting rollback in /mzhomes/mz1 === Old version: 9.3.1.9 === Rolling back from attempted upgrade to 9.3.2.0 Once the rollback process is complete, you will see the following confirmation: ============================== ROLLBACK COMPLETE =============================== Manual Rollback If you have completed an upgrade and want to do a rollback, you can initiate a rollback manually. It is assumed that no configurations have been updated or added in the upgraded version and that the installation directory has not been removed. If the installation directory has been removed, you need to follow the instructions in General Preparations Platform before performing the rollback. You can perform a manual rollback by running the following command: ./setup.sh rollback During a rollback, the process uses backup files stored in the following directory: <my_mz_home>/tmp/upgrade/backup This directory is created during the upgrade process and is essential for rollback in case of any failure. The directory above is the default directory, you can also define another directory by using the property upgrade.temp.dir , see Upgrade Preparations .",
    "title": "Rollback for Standard Upgrades - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/550731808",
    "word_count": 272,
    "char_count": 1814
  }
]