[
  {
    "chunk_id": 1,
    "text": "Usage logger -pico platform Usage: logger -pico name [-reset] Reset logging to default. This will log to any package/class at the default level. Cannot be used in combination with other optional parameters. [-stacktrace ON | OFF ] Turn stacktrace on/off. Default is on. Cannot be used in combination with other optional parameters. [-level OFF | ERROR | WARN | INFO | CONFIG | DEBUG | TRACE | FINEST | ALL ] [-file filename ] Send logging to additional file. If used, the command applies only to the specified filename. [-package package/class,.. ] Only log specific package/class. Default is any package/class. The command applies only to the specified package. With this command you can edit log settings for the picos and update the logging dynamically. Options Option Description Option Description [-reset] Resets the logging to default settings. This option cannot be used in combination with any other option. [-stacktrace] Turns stacktrace on or off. The default value is on and this option cannot be used in combination with any other option. [-level] Determines for which severity levels events should be logged; OFF, ERROR, WARN, INFO, CONFIG, DEBUG, TRACE, FINEST, or ALL. [-file] Will log to an additional file stated with filename. [-package] Will only log events for the stated package or class. Return Codes Listed below are the different return codes for the logger command: Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if there are missing arguments: Pico not running Pico name missing Unknown failure 2 Will be returned if the level is missing or invalid. 3 Will be returned if the file is missing. 4 Will be returned if the package is missing or invalid. 7 Will be returned if the stacktrace is missing or invalid. 8 Will be returned if reset has been used incorrectly.",
    "title": "mzcli - logger - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/547979554/mzcli+-+logger",
    "word_count": 306,
    "char_count": 1847
  }
]