[
  {
    "chunk_id": 1,
    "text": "This section describes the properties related to the Legacy Desktop that you can set in the STR. A subset of the properties below are explicitly set in the file default.conf during installation. This file must not be updated. If you want to set or override properties, you should update client.conf instead. Note! You can override properties in the STR using the Desktop Launcher. For more information, see Desktop Launcher . Advanced Properties java.library.path Default value: ${mz.home}/common/lib/native This property must be set to ${mz.home}/common/lib/native . mz.crypto.hash.algorithm Default value: SHA-256 This property is to use the crypto algorithm for hashing data, for example, files. mz.crypto.key.crypt Default value: AES This property is to use the crypto algorithm to encrypt and decrypt sensitive data within communications, for example, passwords. The value can be set to AES/GCM/NoPadding for a higher level of security. Note! If you have set the value to AES/GCM/NoPadding, and you try to decrypt data, and it does not succeed on the first attempt, the property value reverts to AES. mz.crypto.key.stream Default value: PBKDF2WithHmacSHA256 This property is to encrypt configurations when you have a user password for the encryption. The value can be set to PBEWithMD5AndDES . Note! If the decryption fails when using the selected algorithm, it will try to use the other algorithm. mz.editor.use.bold.italic Default value: true If the cursor is out of position in the APL or Ultra Editor in the Desktop, this may be due to problems with bold and italic fonts. To fix this issue, add this property and set the value to false . mz.gui.apl.color.comments Default value: #b22222 With this property you can specify the color you want to use for comments in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.constants Default value: # add8e6 With this property you can specify the color you want to use for constants in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.error Default value: #ff0000 With this property you can specify the color you want to use for errors in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.functions Default value: #0000ff With this property you can specify the color you want to use for functions in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.keywords Default value: #a020f0 With this property you can specify the color you want to use for keywords in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.normal Default value: #000000 With this property you can specify the color you want to use on your regular APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.owntypes Default value: #b8860b With this property you can specify the color you want to use for user defined types in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.strings Default value: #bc8f8f With this property you can specify the color you want to use for strings in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.color.types Default value: #228b22 With this property you can specify the color you want to use for types in the APL code. Colors are entered in hex format, e g \"#666666\". mz.gui.apl.syntaxfile Default value: \"\" With this property you can specify a file that contains further components within the APL code that you want to be able to highlight. The value should contain path and file name to the syntax file. mz.gui.apl.syntaxhighlighting Default value: yes This property specifies whether you want the text in your APL code to be color coded according to code definitions or not. The text is color coded according to the following definitions; brown = strings, dark blue = functions, light blue = constants, green = types, orange = user defined types, purple = key words, red = comments mz.gui.color.space.active Default value: \"\" This property can be added in order to change the background color of the Desktop. Possible values are: blue, green , yellow , orange , red , darkblue , darkgreen , magenta , or darkred . mz.gui.editor.autocomplete Default value: true This property specifies whether you want the editor to automatically close brackets, parentheses, and quotation marks. Disable it by specifying \"false\". mz.gui.editor.command Default value: notepad.exe This property specifies the command used for starting the editor you want to use for editing APL code or Ultra Formats. If you, for example, want to use Emacs the command should be emacs.exe . mz.gui.editor.menufontsizes Default value: 8,10,12,14,18,20,24,36 This property specifies the font sizes you want to be able to choose from when editing APL code or Ultra Formats in the APL Code Editor and the Ultra Format Editor. The current value is displayed between the \"-\" and \"+\" magnifying glasses to the left in the button list in the editors and can be changed by clicking on the magnifying glasses, or using the key combinations CTRL+ and CTRL- The current value can also be changed by opening the right-click popup menu and selecting Font Size . mz.gui.editor.name Default value: Notepad This property specifies the editor display name in menus. mz.gui.restart.tabs Default value: false This property determines whether the tabs that are open when exiting Desktop should be remembered or not. The default behavior is that the tabs will not be remembered, but setting this property to true will restore the open tabs the next time Desktop is opened. Note! Setting this property to true may cause the startup of Desktop to be bit slower. mz.gui.systemexport.default.dir Default value: \"\" This property can be added in order to configure the default directory you want to use when clicking on the Browse... button when doing a system export. The value must be the full path to an existing directory, e g /home/mz . mz.gui.systemimport.default.dir Default value: \"\" This property can be added in order to configure the default directory you want to use when clicking on the Browse... button when doing a system import. The value must be the full path to an existing directory, e g /home/mz . mz.gui.udreditor.limit Default value: yes This property can be used to support decoding of files that are larger than 3MB. When set to yes the UDR File Editor will only read up to 3MB and then stop, when set to no the UDR File Editor will continue to read until the end of the file is reached. mz.gui.ufl.color.comments Default value: #b22222 With this property you can specify the color you want to use for comments in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.constants Default value: # add8e6 With this property you can specify the color you want to use for constants in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.error Default value: #ff0000 With this property you can specify the color you want to use for errors in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.functions Default value: #0000ff With this property you can specify the color you want to use for functions in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.keywords Default value: #a020f0 With this property you can specify the color you want to use for keywords in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.normal Default value: #000000 With this property you can specify the color you want to use on your regular Ultra format text. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.owntypes Default value: #b8860b With this property you can specify the color you want to use for user defined types in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.strings Default value: #bc8f8f With this property you can specify the color you want to use for strings in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.color.types Default value: #228b22 With this property you can specify the color you want to use for types in the Ultra formats. Colors are entered in hex format, e g \"#666666\". mz.gui.ufl.syntaxfile Default value: \"\" With this property you can specify a file that contains further components within the Ultra formats that you want to be able to highlight. The value should contain path and file name to the syntax file. mz.gui.ufl.syntaxhighlighting Default value: yes This property specifies whether you want the text in your Ultra Formats to be color coded according to code definitions or not. The text is color coded according to the following definitions; brown = strings, dark blue = functions, light blue = constants, green = types, orange = user defined types, purple = key words, red = comments mz.gui.wfeditor.maxrows Default value: 500 This property can be added to change the maximum number of allowed rows in the workflow table. If this property has not been added, the default value of 500 rows will apply. mz.ultra.bitfield.codec Default value: \"false\" This property selects the implementation that is to be used for ultra bit_block . If set to true, the newly selected implementation will be used. Values that are not set using this property will use the old implementation. pico.bootstrapclass Default value: com.digitalroute.ui.MZDesktopMain This property specifies the bootstrap classes used by the Desktop. pico.cache.basedir Default: ${mz.home}/pico-cache This property must be set to ${mz.home}/pico-cache . pico.tmpdir Default: ${mz.home}/tmp This property must be set to ${mz.home}/tmp . pico.inhibit.startmessage Default value: \"false\" This property determines if the start message, generated when starting the Desktop client, should be logged or not. The default value is false , which means that the start message will be logged. Excluding the property entirely will have the same effect. Setting the property to false will result in no logging of the start message. pico.logdateformat Default value: \"YYYY-MM-DD\" This property specifies the date format to be used in the log files. See SimpleDateFormat (Java Platform SE 8 ) for further information. pico.name Default value: \"<pico instance type>\" This property specifies the name of the pico instance used for the Desktop. pico.pid Default value: $MZ_HOME/core/log This property specifies the directory you want the Desktop to write process ID (PID) file to. pico.stderr Default value: $MZ_HOME/core/log This property specifies the directory you want the Desktop to write standard errors to. pico.stdout Default value: $MZ_HOME/core/log This property specifies the directory you want the Desktop to write standard output to. pico.swing Default value: yes This property specifies how you want notifications to be made for this pico. For Desktops you usually want notifications to be made in the GUI, and in that case this property should be set to yes , meaning that Swing will be used. For other picos, such as the Platform and the Execution Context, this property will usually be excluded, which will result in notifications being sent to the console instead. pico.tmpdir Default value: ${mz.home}/tmp This property specifies the pico temp directory you want the Desktop to use. pico.type Default value: desktop This property specifies the type of pico instance used for the Desktop. swing.aatext Default value: true This property specifies that Java anti-aliasing should be used, which will improve the display of graphical elements in the user interface.",
    "title": "Legacy Desktop Properties - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204613093",
    "word_count": 1857,
    "char_count": 11634
  }
]