[
  {
    "chunk_id": 1,
    "text": "To open the Data Veracity Maintenance system task configuration: Go to Build screen and select SystemTask folder from the Configurations Navigator . Open DataVeracity_Maintenance workflow in SystemTask Click the DataVeracity_Maintenance workflow. In the workflow, double-click the agent icon or select the agent icon and click the Edit button to open the agent configuration dialog. Pre Delete Any UDRs that has the state Pre_Delete will have to be approved for deletion by a user with the appropriate privileges and permissions. Pre_Delete UDRs will not be removed by the DataVeracity_Maintenance System Task workflow. Cleanup Tab Open Da taVera city_Maintenance configuration Setting Description Setting Description Reprocessed If this check box is selected, UDRs with the state Reprocessed will be deleted from all Data Veracity tables when they are older than the number of days stated (maximum 999 days). If disabled, the UDRs will remain until manually cleaned out via the Search option in the Data Veracity Web UI . If 0 (zero) is entered, all UDRs with state Reprocessed will be removed whenever the cleanup task is performed, with a minimum time interval of one hour. Default setting is 7 days. Delete_Approved If this check box is selected, UDRs with the state Delete_Approved will be deleted from all Data Veracity tables when they are older than the number of days stated (maximum 999 days). If disabled, the UDRs will remain until manually cleaned out via the Search option in the Data Veracity Web UI . If 0 (zero) is entered, all UDRs with state Delete_Approved will be removed whenever the cleanup task is performed, with a minimum time interval of one hour. Def ault set ting is 7 days.",
    "title": "Data Veracity Maintenance System Task Configuration - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205684804/Data+Veracity+Maintenance+System+Task+Configuration",
    "word_count": 276,
    "char_count": 1703
  }
]