[
  {
    "chunk_id": 1,
    "text": "Using the Documentation Generator, you can create documentation for the configurations that you have created. Generating Automated Documentation To open the Documentation Generator, click the Tools button in the upper left part of the Desktop window, and then select Documentation Generator from the menu. Open The Documentation Generator To generate documentation on the configurations in the system, select the Output Target directory in which you want to generate the documentation. To select a directory click the Browse... button, select the target directory, and click the Save button. Click the Generate button. You can then open the generated HTML file (index.html) in your web browser from the selected target directory. Open Documentation displayed in web browser Content of the Documentation The documentation generated includes up-to-date information on the saved configurations. The sections included vary according to the type of configuration documented and how it is used. The possible sections included are the following: Section Description Section Description Workflow An image of the configuration. This section is only included for workflow configurations. Globals The variables and constants are declared globally. This section is only included for APL Code configurations. Functions The APL functions. This section is only included for APL Code configurations. Description The content is provided by the user in the configuration profile, using the Documentation dialog. For example, you can provide a description and the purpose of the configuration in the dialog. For further information on how to populate this section, see the Documentation section in Desktop User Interface . Uses A list of all the configurations that the configuration uses, for example, APL code or Ultra format. Used By A list of all the configurations using the configuration. Access A list of the users who have access to the configuration.",
    "title": "Documentation Generator - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204676088/Documentation+Generator",
    "word_count": 291,
    "char_count": 1940
  }
]