[
  {
    "chunk_id": 1,
    "text": "The ECS Insert event is triggered when data is inserted into ECS, i e: When cancelBatch is called from a batch workflow. When UDRs are sent to ECS via an ECS Forwarding agent. ECS Insert event specific fields ecsMessage - With this field you can configure notifications to be sent only for certain messages associated with the cancelBatch function. If UDRs are inserted, the message will be \"None\". Use regular expressions to filter on this field. ecsMIM - This field enables you create a regular expression based filter for specific MIM values, i e notifications will only be generated for data containing the specified MIMs. ecsSourceNodeName - This field enables you configure notifications to be sent only for insertions made from specified agents. For batches, this will be the agent issuing the cancelBatch , while for UDRs this will be the ECS Forwarding agent. Use regular expressions to filter on this field. ecsType - For this field you can select if you want notifications to be generated for only batches, only UDRs or both, i e All . ecsUDRCount - This field enables you to configure notifications to be sent only for batches containing a certain amount of UDRs. Use regular expressions to filter on this field. agentName - This field enables you configure notifications to be sent only for events issued from specified agents. Use regular expressions to filter on this field. Fields inherited from the Base event The following fields are inherited from the Base event, and can also be used for filtering, described in more detail in Base Event : category - If you have configured any Event Categories, you can select to only generate notifications for ECS Statistics events with the selected categories. See Event Category for further information about Event Categories. contents - The contents field contains a hard coded string with event specific information. If you want to use this field for filtering you can enter a part of the contents as a hard coded string. However, for ECS Statistics events, everything in the content is available for filtering by using the other event fields, i e eventName, errorCodeCountForNewUDRs, etc. eventName - This field can be used to specify which event types you want to generate notifications for. This may be useful if the selected event type is a parent to other event types. However, since the ECS Statistics event is not a parent to any other event, this field will typically not be used for this event. origin - If you only want to generate notifications for events that are issued from certain Execution Contexts, you can specify the IP addresses of these Execution Contexts in this field. receiveTimeStamp - This field contains the date and time for when the event was inserted into the Platform database. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2012-06.*\" for catching all ECS Statistics events from 1st of June, 2012, to 30th of June, 2012. severity - With this field you can determine to only generate notifications for events with a certain severity; Information, Warning, Error or Disaster. However, since ECS Statistics events only have severity Information, this field may not be very useful for filtering. timeStamp This field contains the date and time for when the Execution Context generated the event. If you want to use timeStamp for filtering, it may be a good idea to enter a regular expression, for example, \"2012-06-15 09:.*\" for catching all ECS Statistics events from 9:00 to 9:59 on the 15th of June, 2012. Fields inherited from the Workflow event The following fields are inherited from the Workflow event, and described in more detail in Workflow Event : workflowKey workflowName workflowGroupName",
    "title": "ECS Insert Event - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204670865/ECS+Insert+Event",
    "word_count": 625,
    "char_count": 3753
  }
]