[
  {
    "chunk_id": 1,
    "text": "When an Ultra Format Definition is updated, the system automatically converts, or updates, persistent data by default when it is accessed, in order to reflect changes. You can either completely disable this automatic update or enable it for only a selection of formats. You can also set default values for added fields. The following agents and applications can handle persistent data: Application Handling Application Handling Database Collection Agent Collected UDRs are updated. Decoder (using MZ Tagged ) Processed UDRs are updated. Aggregation Sessions All UDRs belonging to the same format definition - historic and updated - are considered valid for comparison. If historic UDRs exist within old sessions, or the session format itself has been updated, the session and its content is updated the next time it is accessed. ECS UDRs are updated whenever they are read from the ECS by the ECS collection agent or accessed through the ECS Inspector . Note! Attempts to collect, process, or update historic UDR data when the automatic conversion for a specific format is disabled causes the workflow to abort (or return an exception, when done outside workflow processing). Conversion Rules If you remove fields from the format definition, they are deleted and cannot be retrieved. If you add fields, they are set to either 0 (zero), true ( numeric types), false ( boolean types), or null (all other types), by default. If you change the type of an existing field, it can cause the field content to be deleted. For example, if you change the type from string to int , the field is set to 0 (zero), provided that no valid default value is defined. Only numerical types ( int , long , etc) are directly interchangeable. If a numeric value exceeds the number of bytes allowed in the new type, it is truncated. Disabling Automatic Conversion In the Ultra Format Converter , you can disable the automatic conversion to new format versions, and instead define default values for UDR fields added in the new version. Open the Ultra Format Converter by selecting Manage  Ultra Format Converter . Open Ultra Format Converter Setting Description Setting Description Convert Select for which UDR types to enable conversion. There are two options: All - All formats are considered, regardless of the types listed (default). Selected Only - Only the formats listed in this window are considered. UDR Types If you have selected to convert Selected Only in the Convert drop-down list, you need to add UDR types in this section. Field/Value section (Default Values) If you have added UDR types in the UDR Types section, it is possible to add default field values of the selected UDR type(s). This may be useful if fields are added to the format, or the type of an existing field is changed. The latter case is especially useful since the old field values are reset if the types are not interchangeable. Note! It is not possible to assign values to old, already existing fields. This can be configured but will not take effect.",
    "title": "Ultra Format Converter - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204744190",
    "word_count": 505,
    "char_count": 3012
  }
]