[
  {
    "chunk_id": 1,
    "text": "To open the Build screen , click the Build button on the top menu bar. This is the interface where you create and manage configurations. Open Build screen This view has two sections: Display List  The left side of the Build screen shows the Main option that displays all available configurations in the system, and the existing, committed workflow packages in the Workflow Packages section. If you select a workflow package, the Browser displays the content of the selected package and if you want to display all configurations regardless of workflow package, click the Main menu item. At the bottom of this section you can click the Create package button to create workflow packages. For more information, see Workflow Packages . Configurations Navigator  In the Configuration Browser you can create, manage, delete, and rename the configurations in the system if you have selected Main in the Display List . Configuration Browser The configurations can be either profiles that belong to specific agents, common profiles, or other types such as Event Notification or APL Collection Strategies. For more information, see Configuration Types . Option/Value Description Option/Value Description Open Selection Checkbox Select the checkbox for those configurations that you want to perform actions for. See section Table Action Bar with Configuration(s) Selected below for more information. Name Displays the name of the configuration. Valid Displays the validity of the configurations. Fields are automatically validated in agents and other core functionality. Encrypted Displays the encryption status of the configuration. Locked Shows if the configuration is locked or not. Permission Displays the permissions granted to the current user of the configuration. Permissions are shown as R (Read), W (Write), and X (eXecute). If the configuration is encrypted, an E is also added. Owner Displays the username of the user that created the configuration. The owner can: Read, modify (write), and execute the configuration Modify the permissions of user groups to read, modify, and execute the configuration. Modified date Displays the date when the configuration was last modified. Subfolders in the Configuration Browser Note! Subfolders in this context are visual representations of areas that you have partitioned to keep your configurations. They are meant to make your configuration browser look neat and tidy. They do not represent actual subfolders. You can enable subfolders to allow you to sort your configurations within your folders, making it easier to maintain larger implementations. To enable subfolders, you must set the property mz.subfolder.enabled to true in the platform.conf file . Refer to Platform (in the System Properties section) for more information on how to set the property. To create subfolders, you must use the valid separators in the folder name when creating a new folder, like the folder names \"sftp_coll\" and \"cipher_sftp_coll shown on the image above. When subfolders are created, configurations are sorted into subfolders determined by the separator used in the folder name. The only valid separators in a folder name are \"_\" or \"-\". If any other character is used as a separator the folder will not appear with subfolders. Table Action Bar The table action bar is located on top of the Browser . The actions available change depending on if you have selected the checkbox for any configuration(s) or not. Open Table Action Bar with no configurations selected Open Table Action Bar with configuration(s) selected Table Actions with No Configurations Selected When no configurations are selected, the table action bar contains the following actions: Action Description Action Description Filter Click this button to open the Filter dialog where you can select which configuration types you want to view. Search This is a free text search box that you can use to search for specific workflow configurations that match the entered text. New Configuration Click this button to open the Configurations dialog where you can select which type of configuration you want to create. The configurations have a common set of buttons, see Common Configuration Buttons , and some have specific buttons that are described in the documentation for each configuration. New Folder Click this button to create a new folder to save your configurations in. Open The New Folder dialog Note! The maximum allowed length for a folders name is 40 characters. Refresh Click this button to refresh the list of configurations. Table Actions with Configuration(s) Selected When selecting the checkbox for one or more configurations, the table action bar is populated with different actions you can do for the configuration(s). The available actions are: Action Description Action Description Clear selection(s) Click this button to clear the selection of configurations. The table action bar shows the default actions. Delete Click this button to delete the selected configuration(s). You will be asked if you are sure you want to delete before deletion is done. Rename Click this button to open the Rename configuration or Rename folder dialog where a new name for the configuration can be entered. Open Encrypt Click this button to open the Encrypt configurations dialog where a password can be provided thus securing the configuration from unauthorized access. This button is disabled if you have selected a checkbox for a folder. Open Decrypt Click this button to open the Decrypt configurations dialog where the encryption password can be provided giving access to the configuration. This button is disabled if the selected configuration is not encrypted. Open Open Properties Click this button and select the option Properties to open the Properties dialog where you can configure the properties for the selected configuration. This button is disabled if you have selected a folder or multiple configurations. See the section Configuration Properties below for more information. Open Keyboard shortcuts Click this button to open the Configurations - Keyboard shortcuts dialog. Click anywhere outside the dialog to close it. Open Configuration Properties To open the Configuration Properties dialog, select the checkbox for the configuration you want to set properties for and click on the button with three dots in the table action bar and select Properties . This dialog has four different tabs; Basic , Permission , Reference , and History . The Basic Tab The Basic tab is the default tab in the Properties dialog. Open The Basic tab It contains the following information: Configuration Information Description Configuration Information Description Name Displays the name of the configuration. Type Displays the type of configuration. Key Displays the internal key used to identify the configuration. Folder Displays the name of the folder in which the configuration is located. Version Displays the version number of the configuration, see the History tab for further information about the different versions. Permissions Displays the permissions granted to the current user of the configuration. Permissions are shown as R (Read), W (Write), and X (eXecute). If the configuration is encrypted, an E is also added. For further information about permissions, see the Permissions Tab section. Owner Displays the username of the user that created the configuration. The owner can: Read, modify (write), and execute the configuration Modify the permissions of user groups to read, modify, and execute the configuration. Modified by Displays the user name of the user that made the last modifications to the configuration. Modified Displays the date when the configuration was last modified. If you want to use the information somewhere else you can highlight the information and press CTRL-C to copy the information to the clipboard. The Permission Tab The Permission tab contains settings for what different user groups are allowed to do with the configuration. Open The Permission tab As access permissions are assigned to user groups, and not individual users, it is important to make sure that the users are included in the correct user groups to allow access to different configurations. R W X E Permission Description R W X E Permission Description R - - - Allowed only to view the Configuration, given that the user is granted access to the application. - W - - Allowed to edit and delete the Configuration. - - X - Allowed only to execute the Configuration. R W - - Allowed to view, edit, and delete the Configuration, given that the user is granted access to the application. - W X - Allowed to edit, delete, and execute the Configuration. R - X - Allowed to view and execute the Configuration, given that the user is granted access to the application. R W X - Full access. - - - E Encrypted. The Reference Tab The Reference tab contains information about which other configurations that the current configuration refers to, and which other configurations that the current configuration is referenced by. Open The Reference tab The Reference tab contains two sub-tabs: Used By , which displays all the configurations that use the current configuration, and Uses , which displays all the configurations that the current configuration uses. If you want to edit any of the configurations, you can double-click the configuration to open it for editing. The History Tab The History tab contains version information for the configuration. Open The History tab In the table, the following columns are included: Column Description Column Description Version Displays the version number. Modified Date Displays the date and time when the version was saved. Modified By Displays the user name of the user that saved the version. Comment Displays any comments for the version. If you want to clear the configurations history, click the Clear Configuration History button. The version number is not affected by this.",
    "title": "Build View - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204997180/Build+View",
    "word_count": 1566,
    "char_count": 9922
  }
]