[
  {
    "chunk_id": 1,
    "text": "Events and errors encountered in the system are saved in the System Log. The System Log handles duplicate events within a time frame, and therefore every event and error has a first and last occurred date, as well as information on how many times it was repeated. You can select to filter out which events you want to see as well as delete selected events from the log. The System Log table will display a maximum of 500 000 entries. If you want to modify the maximum number of entries, add the Platform property mz.systemlog.maxresults to the platform.conf and modify the value, see Platform Properties . To open the System Log, go to Manage  Tools & Monitoring and then select System Log . Open The System Log If you have had the System Log open for a while, you can refresh the view by clicking on the Refresh button in the table action bar. System Log Table The System Log table displays the following options and values Column Description Column Description Open Selection Checkbox The selection check boxes can be used for selecting specific entries that you want to delete. If you select one or several check boxes, the table action bar will change to display a Clear and a Delete button. Last Occurred This column shows the date and time when the event last occurred. Severity This column shows the severity of the event: Info - An event with severity Info is an informative message, for example when a user logs in or a workflow is activated. Warning - An event with severity Warning is also an informative message but is considered to be slightly more serious than a regular information message, for example when a workflow sends data to ECS. Error - An error is logged when any part of the system fails, for example when a workflow aborts. If you display Event Details for an event with severity Error, you will see a stack trace that must always be included when contacting support. Fatal - Fatal is a severity that is never used by default, but may be used for user-defined agents. Type This column shows the event type: System Workflow User Message This column shows the message heading. If you display Event Details you will see the full message. First Occurred This column shows the date and time when the event first occurred. Repeated This column shows how many times this event has occurred. Area Indicates which part of the system the message originates from; user, system or workflow. Workflow/Agent The name of the workflow/agent from which the message originates. Message Area If an entry is selected from the list, further details about it is displayed in this area. Event Details If you click on the entry in the System Log table, you will see additional details about the event: Open Apart from the Last occurred, Message heading you will also see the following information: Information Description Information Description Creation date The date and time when the entry was registered. Origin The origin of the event, for example an IP address and port for a user event, or the host and port for a workflow event. Agent name Name of any agent involved. User name The user name of the user being the origin of the event. This information is only displayed for user events. Stack trace The full stack trace for errors. This information is only displayed for workflow events. Filter Open You can click on the Filter button to set filters for a more curated list of entries in the System Log. The Filter dialog will then open where you can configure your filter. Open System Log Filter An entry has to match all configured filter settings to be displayed in the System Log table. Item Description Item Description Severity The severity of the log entry; Info, Warning, Error, Fatal Type The affected entity. Date Range Within which period entries will be viewed. A few predefined options are available. If none are selected, all are considered. The default period is Today . The available options are: User-defined All Last hour Today Yesterday This week This month If you select User-defined , enter the Start date and time and End date and time . If neither are specified, all entries will match. Workflow Select to only view events relating to a selected workflow. All workflows for which entries have been registered are selectable in this drop-down-list. Only one workflow can be selected. Workflow Group Select to only view events relating to a selected workflow group. All workflow groups for which entries have been registered are selectable in this drop-down-list. Only one workflow group can be selected. Agent Select to only view events relating to a selected agent. All agents for which entries have been registered are selectable in this drop-down-list. Only one agent can be selected. Note! The System Log does not display agent events by default, in order for agent events to be presented in the System Log you have to configure agent events in an Event Notifications . Username Select to only view events relating to a selected user. All users for which entries have been registered are selectable in this drop-down-list. Only one user can be selected. Note! This filter will only apply to user events and not any other events with user name stated, and can therefore not be used for filtering out workflows created by specific users. Message Enter a free text search string to be matched by the messages in the entries you want to display. When you are finished, click OK to apply your filter settings. If you want to clear all filters, you can open the Filter dialog again and click on the Reset button. Deleting Entries You can delete either all entries in the System Log, or specific entries. To delete all entries, click on the Delete button in the table action bar. You will be prompted to confirm that you want to delete all entries. Click on the Delete button to confirm. If you want to only delete specific entries, select the check boxes for the entries you want to delete. The table action bar will change and display a Clear button and a Delete button. Click on the Clear button to clear all your selections, or on the Delete button if you want to delete selected entries. You will be prompted to confirm that you want to delete all entries. Click on the Delete button to confirm.",
    "title": "System Log - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204639211",
    "word_count": 1083,
    "char_count": 6230
  }
]