[
  {
    "chunk_id": 1,
    "text": "The creation of the database must be made by the oracle UNIX user, or another UNIX user with the same privileges, on the machine where Oracle is installed. The oracle UNIX user is assumed in this installation. Make sure that all previously defined directories, specified in the install.xml file, exist and are writable for the oracle user, then follow these steps: Make sure the environment variables for Oracle are set. For further information, see Setting Environment Variables for Platform . Make sure the Oracle data directories exist. These directories must be owned by the Oracle user. For further information see Properties for Oracle . Configure and start an Oracle listener for the database instance. The working directory for the listener is $ORACLE_HOME/network/admin . Edit the listener.ora file to match what is set in install.xml . See Appendix A - Oracle Home Settings for an example. When the listener is configured, it needs to be restarted: $ lsnrctl stop $ lsnrctl start Create the Oracle database instance. The working directory is oracle . $ source ./oracle_create_instance.sh Depending on the hardware and the size of the database, this command may take up to one hour to execute. If no error occurs, the database creation is now complete and the rest of this section can be ignored. Hint! After the instance creation script is executed, there will be three log files in the /tmp directory that can be used for troubleshooting. The mz.log file contains Oracle responses from the database creation, the mzuser.log file contains Oracle responses from the user creation, and the mz_db.log file contains Oracle responses from the table creations. If the script fails, cleanup the system before the next try: Start SQL*Plus: $ sqlplus \"/ as sysdba\" Terminate the bad instance: SQL> shutdown abort SQL> quit Remove any files created by Oracle in any of the previously defined directories for Oracle data. If there is a need to change any installation parameter defined in the file install.xml , the installation must be restarted from the generation step. For further information, see Generation of Oracle Database Definition Files above.",
    "title": "Oracle Database Creation - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205029608/Oracle+Database+Creation",
    "word_count": 348,
    "char_count": 2154
  }
]