[
  {
    "chunk_id": 1,
    "text": "The ECS Inspector allows the user to inspect and maintain UDRs and batches located in the ECS, view and edit their content, and add them to Reprocessing Groups . The latter is a prerequisite for the data to be collected by an ECS collection agent. You may also restrict certain fields from being edited in the ECS. Apart from simply sending a UDR or batch to the ECS, a workflow can be configured to associate user-defined information with the ECS data. For UDRs, the Error Code and MIM information may contain user-defined information. For canceled batches, the Error UDR and Cancel Message may contain user-defined information. Note! The data itself is not saved to the database, only a reference to the data. Physically, the ECS data is saved in the directory defined by the property mz.ecs.path found in platform.conf . The default path is MZ_HOME/ecs . If the mz.ecs.path parameter is changed, the changes will take effect the next time data is inserted into the ECS. Existing ECS data is left at its current location and must not be moved. If required to do so anyway, move the content of the old mz.ecs.path directory to the new, and create a soft link in the old directory pointing out the new location. Note! Take special precautions when updating the Ultra formats. It is not possible to collect data from the ECS if the corresponding UDR has been renamed. If the format definition has changed, you can still collect the data. Changes to the formats are handled as follows: Added or renamed fields are assigned default values. Removed fields are ignored. Fields that have changed data types are assigned default values. The section contains the following subsections: ECS Inspector ECS Changing State Configuring Searchable Fields in the ECS ECS Restricted Fields Configuration Searching the ECS ECS Inspector Table ECS Error Codes ECS Reprocessing Groups",
    "title": "ECS Inspection - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204607337/ECS+Inspection",
    "word_count": 312,
    "char_count": 1865
  }
]