[
  {
    "chunk_id": 1,
    "text": "When selecting GCP as a file system, you will see one tab - General . Open File System profile - GCP - General tab General tab The following settings are available in the General tab in the File System profile: Setting Description Setting Description Authentication Details - Service Account Settings Environment-Provided Service Account Select this option, if you are configuring an environment-provided service account with this profile. This will disable the Input Option and Credentials File fields. Input Option Using this option you delegate how the GCP connection credentials are acquired, the available options are to select a JSON File or to fill in the information from a Form. Credentials File Enter the path to the delegated credentials file. This option is visible only when the JSON File option is selected as the input option. Import Credentials from File This button allows for credentials to be imported from a locally stored file. This option is visible only when the Form input option is selected. Project ID Enter the project ID. This option is visible only when the Form input option is selected. Private Key ID Enter the Private key ID. This option is visible only when the Form input option is selected. Client Email Enter the client's email. This option is visible only when the Form input option is selected. Client ID Enter the client ID. This option is visible only when the Form input option is selected. Other Information Enter other information that might be used with this profile. This option is visible only when the Form input option is selected. Location Settings Bucket Enter the target bucket name. Use GCP Profile Select this check box if you already have a GCP Profile set up, this will disable the fields above and allow you to utilize the credentials that you have defined in your chosen GCP Profile.",
    "title": "File System Type - GCP Storage - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/315162665",
    "word_count": 308,
    "char_count": 1841
  }
]