[
  {
    "chunk_id": 1,
    "text": "AcquireUDR This UDR is dedicated to requesting the connected SAP Convergent Charging Server to collect a list of chargeable items included in an acquisition parameter. The SAP Convergent Charging Server processes these chargeable items and stores them in temporary files. For field definitions, refer to the section below, AcquisitionParametersUDR. Field Description Field Description parameters Contained within this field is a list of chargeable items stored as an AcquisitionParametersUDR AcquisitionParametersUDR This UDR represents the data for the batch acquisition operation of a chargeable item or a collection of chargeable items in the charging client. Field Description Field Description chargeableItem (ChargeableItemUDR (sapcc)) A ChargeableItem represents the information that the client needs to perform the charge process. It consists of a name and a list of properties . consumptionDate (date) The date of the consumption event. The value should be a string representing a numerical value in the following format: 1, 0.1, 0.01, 0.001 etc. serviceid (string) The serviceId part of the access object linked to the customer master data defined in SAP Convergent Charging userid (string) The userId part of the access object linked to the customer master data defined in SAP Convergent Charging BlankChargeUDR (sapcc.batch.BlankChargeUDR) This UDR is used by the SAP CC Batch agents to submit a blank charge request to the SAP Convergent Charging server. The sapcc.batch.BlankChargeUDR extends from sapcc.BlankChargeUDR. For field definitions, refer to the section ChargeUDR in Charging Request UDRs . ChargeUDR (sapcc.batch.ChargeUDR) This UDR is used by the SAP CC Batch agents to submit a charge request to the SAP Convergent Charging server. The sapcc.batch.ChargeUDR extends from sapcc.ChargeUDR and contains one additional field. For sapcc.ChargeUDR files, refer to Charging Request UDRs . The additional field for sapcc.batch.ChargeUDR is provided below: Field Description Field Description reratingLockCode (string) The rerating operation lock code",
    "title": "Batch Request - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205001837",
    "word_count": 295,
    "char_count": 2069
  }
]