[
  {
    "chunk_id": 1,
    "text": "The runtime support is used for looking up the actual products based on the references received with the mapper support. The runtime support functions include: pccCreate pccGetUdr pccGetUdrList pccCreate This function creates a data set object that can be used with the pccGetUdr and pccGetUdrList functions described below. any pccCreate( string area ) Parameters Parameter Description Parameter Description area The name of the area which the function is operating against. Returns: A data set object that can be used with the pccGetUdr or pccGetUdrList functions. Example pccCreate(\"PROD\"); will create a data set object that can be used with the pccGetUdr and pccGetUdrList functions against the PROD area. pccGetUdr Retrieves a specific UDR based on the stated UDR type and key. drudr pccGetUdr( string typename, any key [, any dataset] ) Parameters Parameter Description Parameter Description typename The fully qualified typename of the requested UDR. key The reference to the requested UDR dataset The data set object that you want to use for retrieving the UDR. This field is optional, and if it is not used, the data set that was used last will be used for the retrieval. Returns: The matching UDR or null if no matching UDR was found. Example pccGetUdr (\"PCC.Products.Provisioning.Notification\", 50); will retrieve a UDR of the type PCC.Products.Provisioning.Notification with the key 50 . pccGetUdrList Retrieves a list with all the UDRs with the stated UDR type. list<drudr> pccGetUdrList( string typename [, any dataset] ) Parameters Parameter Description Parameter Description typename The fully qualified UDR typename of the requested UDRs. dataset The data set object that you want to use for retrieving the UDRs. This field is optional, and if it is not used, the data set that was used last will be used for the retrieval. Returns: A list containing all the UDRs of the requested type. Example list<drudr> notificationsList = pccListData (\"PCC.Products.Provisioning.Notification\"); will return a list named notificationsList with all the UDRs that have the type PCC.Products.Provisioning.Notification .",
    "title": "APL - PCC Runtime Support - Buckets - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204677417/APL+-+PCC+Runtime+Support+-+Buckets",
    "word_count": 323,
    "char_count": 2121
  }
]