[
  {
    "chunk_id": 1,
    "text": "The Kafka batch collection agent consumes messages from the topic and partitions stated in the Kafka collection agent's configuration, which contains the following settings: Setting Description Setting Description Profile Browse and select the profile the agent should use, as defined in the Legacy Kafka Profile . All Select this option if you want messages to be collected from all of the partitions. Range Select this option if you want messages to be collected from the range that you specify. Specific Select this option if you want messages to be collected from the specified partition(s). This is a comma-separated list. Batch Size Use this field to set the number of messages you want in each batch. If this field is set to 0, all messages will be collected in one batch. Note! For best performance, avoid setting the batch size too small, as running many batches every second can reduce efficiency. Default Offset settings The Kafka batch collection agent will collect the messages in sequence, and when the batch is finished the last number in the sequence will be the offset for the messages in the next batch. If the next message in sequence does not exist in the next batch for some reason, the Default Offset settings can be used to determine where the Kafka batch collection should start. Start at Beginning Select this option if you want the agent to start collecting from the first message in the queue. Start at End Select this option if you want the agent to start collecting from the last message in the queue. This means that the workflow will not collect anything, but the offset will be updated to the last messages for the next run. Note! Use the new https://infozone.atlassian.net/wiki/x/wwDzEQ for transactional topics. Input/Output Data Input Data Messages from the Kafka Log. Output Data Legacy KafkaUDR",
    "title": "Legacy Kafka Batch Collector - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/301138581/Legacy+Kafka+Batch+Collector",
    "word_count": 305,
    "char_count": 1831
  }
]