[
  {
    "chunk_id": 1,
    "text": "In order to grant permission to users to have different level of Data Veracity access privilege, you can configure the Data Veracity and Data Veracity Data Masking application permissions in Access Controller. For more information on configuring user access group permission, refer to Access Controller . Data Veracity Application Permission The following table lists the actions allowed for each Data Veracity interface in Data Management based on the selected permission, Execute and Write . The permissions are selected for Data Veracity application in Access Controller. Data Veracity actions in Data Management Execute Permission Only Write Permission Data Veracity actions in Data Management Execute Permission Only Write Permission Search & Repair Allows users to: Search View UDRs Export CSV Load Filters All masked fields are viewed as **** Note! Users are allowed to select the Data Veracity profile if the Data Veracity profile is given the Read & Execute permission. Users are allowed to search if the Database profile in the selected Data Veracity profile is given the Read & Execute permission. Allows users to: Search View UDRs Export CSV Load Filters Save/Update Filters Mark Delete Set State Execute Repair UDRs Save/Update Repair Rules Delete records When adding a Repair Rule, the Restricted Field is disabled Users are able to view the original data for masked fields Approve Delete Allows users to: Search for PRE_DELETE records Review View UDRs Export CSV Note! Users are allowed to select the Data Veracity profile if the Data Veracity profile is given the Read & Execute permission. Users are allowed to search if the Database profile in the selected Data Veracity profile is given the Read & Execute permission. Allows users to: Search for PRE_DELETE records Review View UDRs Export CSV Approve records Reject records Repair Jobs Allows users to view the repair jobs records Allows users to view the repair jobs records Error Codes Allows users to view the Error Codes Allows users to: View Error Codes Create Error Codes Edit Error Codes Delete Error Codes Filters Allows users to view the Filters Allows users to: Search Filters View Filters Create Filters Edit Filters Delete Filters Restricted Fields Allows users to view the Restricted Fields Allows users to: View Restricted Fields Create Restricted Fields Edit Restricted Fields Delete Restricted Fields Repair Rules Allows users to view the Repair Rules Allows users to: View Repair Rules Create Repair Rules Edit Repair Rules Delete Repair Rules Data Masking All masked fields are viewed as **** All masked fields are viewed as raw data without masking Data Veracity Data Masking Application Permission The Data Veracity Data Masking permission is required to configure masked fields or view masked data. The following lists the actions are allowed based on the selected permission: Execute Only - All masked fields are viewed as **** Write - Users are able to view the original data for masked fields",
    "title": "Managing Data Veracity Access Permission - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204672668/Managing+Data+Veracity+Access+Permission",
    "word_count": 476,
    "char_count": 2985
  }
]