[
  {
    "chunk_id": 1,
    "text": "This section describes properties that are typically set on a cell level and applicable to the Platform, ECs and SCs. Note! You cannot add JVM arguments or classpaths on the cell level. If you need to add JVM arguments or classpaths that are applied to all pico processes, it is recommended that you do so by using templates. Property Description Property Description mz.apl.use_51_integer_arithmetic_rules Default value: false Set this property to true if you want to use the same integer arithmetic handling as in MediationZone version 5.1. mz.client.dateformat Default value: yyyy-MM-dd This property determines the default format for displaying dates for the client. mz.drdate.lenient Default value: false This property enables lenient interpretation of the date/time in the string parameter in the APL function strToDate . With lenient interpretation, a date such as \"January 32, 2016\" will be treated as being equivalent to the 31nd day after January 1, 2016. With strict (non-lenient) interpretation, an invalid date will cause the function to leave the submitted date variable unchanged. mz.name Default value: MZ This property specifies the name of the MediationZone system. This will be displayed along with IP address and port to the right in the status bar at the bottom of Desktop. mz.outputstream.use_compact Default value: false This property enables compact serialization of data. Enabling the property can optimize the size of your serialized data. mz.preset.aggregation.storage.path Default value: false This property enables hardcoding of the Aggregation profile directory to the specified path. The Desktop user will still be able to see the set directory, but not change it. mz.preset.dupUDR.storage.path Default value: false This property enables hardcoding of the Duplicate UDR profile directory to the specified path. The Desktop user will still be able to see the set directory, but not change it. mz.preset.interwf.storage.path Default value: false This property enables hardcoding of the Inter Workflow profile directory to the specified path. The Desktop user will still be able to see the set directory, but not change it. mz.httpd.security Default value: false This property enables HTTP communication protected by TLS (i e HTTPS). mz.server.dateformat Default value: yyyy-MM-dd HH:mm:ss This property determines the default format for displaying timestamps. mz.server.datepartformat Default value: yyyy-MM-dd This property determines the default format for displaying dates. mz.server.timepartformat Default value: HH:mm:ss This property determines the default format for displaying times for the server. mz.webserver.xframeoptions This property determines if X-Frame-Options are enabled in the Platform- and EC Web Interface in order to protect from framing. The valid values are: DENY - The X-Frame-Options are enabled so that the Web Interface cannot be displayed in a frame. ALLOW - The X-Frame-Options are disabled so that the Web Interface can be displayed in a frame. ALLOW-FROM <specific origin> - The X-Frame-Options are disabled on a specific origin. This means that the Web Interface can only be displayed in a frame on the specified origin. SAMEORIGIN - The X-Frame-Options are disabled on the same origin as the Web Interface. This means that the Web Interface can only be displayed in a frame on the same origin as the Web Interface itself. pico.cache.basedir Default value: $MZ_HOME/pico-cache This property specifies the directory that should be used for the pico-cache that is cashing information about all running picos, which is used by all servers and clients. pico.rcp.connection.timeout Default value: The value specified for pico.rcp.timeout This property determines the the RCP open connection timeouts in seconds. If you do not specify a value for this property, the value is the same as that set for the property pico.rcp.timeout . pico.rcp.platform.host Default value: \"\" This property specifies the IP address or the hostname of the Platform, to be used by other pico instances (e g Desktop, Execution Context, and mzsh). When you enter the hostname as the value of this property, if a failover occurs, the hostname is retrieved from the DNS enabling reconnection. If you enter the IP address as the value of this property, if it is a static IP address, reconnection issues may occur if the IP address changes. pico.rcp.platform.port Default value: 6790 This property specifies the port that is used for communicating with the Platform. pico.synchronizer.port Default value: 6791 This property specifies the port that is used for synchronizing files from the Platform to external ECs. pico.rcp.timeout Default value: 30 This property determines the RCP handshake and heartbeat timeouts in seconds. pico.rcp.tls.require_clientauth Default value: false This property specifies if client authentication is required when these are not running on the local host.",
    "title": "Cell Properties - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205881399/Cell+Properties",
    "word_count": 736,
    "char_count": 4916
  }
]