[
  {
    "chunk_id": 1,
    "text": "Set the Execution Container related properties described below in the install.xml file. The properties are described in the order they appear in the install.xml file. Common Properties Property Description Property Description pico.rcp.platform.host Default value: \"\" Example value: 192.168.0.190 This property specifies the IP address or the hostname of the Platform to be used by other pico instances such as Execution Contexts, Service Contexts, or Command Line. If a failover occurs and you have entered a hostname as property value, the hostname is retrieved from the DNS enabling reconnection. If you have entered a static IP address as property value, reconnection issues may occur after a failover, if the IP address has changed. pico.rcp.platform.port Default value: 6790 This property specifies the port for connecting the Execution Contexts to the Platform. pico.rcp.server.host Default value: \"\" This property specifies the IP address or hostname of the pico instances. It is used to determine the interface that the pico instances must bind to and the IP address/hostname to be used by connecting processes. If a failover occurs and you have entered a hostname as property value, the hostname is retrieved from the DNS enabling reconnection. If you have entered a static IP address as property value, reconnection issues may occur after a failover, if the IP address has changed. When the value of this property is left blank, the pico instance binds to all IP addresses of the host. This means that the pico listens for inbound network traffic on all network interfaces, and may attempt to use any local IP address for outbound network traffic. Note! If the host has more than one IP address, this property has to be set with the correct IP address. Make sure to set the property if you use IPv6, or if a high availability environment is configured. For information about high availability, see High Availability . mz.webserver.port Default value: \"9000\" This property specifies the port for connecting to the Desktop. Config Properties Property Description Property Description mz.name Default value: DR This property specifies the name of the MediationZone deployment. Execution Context Properties - Not Used in Platform Only Installations Property Description Property Description mz.eclist Default value: ec1 This property specifies the EC(s) to be installed. Only applicable if install.types includes ec. To specify multiple ECs, the values should be delimited by comma: ec1,ec2,ec3 ec.backlog.dir Default value: ${mz.home}/tmp This property specifies the directory where ECs can store their backlogged events. If this parameter is removed, the EC's events are not logged. Only applicable if install.types includes ec. ec.webserver.enabled Default value: true This property specifies if the web server of the Execution Contexts should be active. Only applicable if install.types includes ec. ec.webserver.port Default value: 9090 This property specifies the EC web server port. Only applicable if install.types includes ec. Note! If you specify several ECs, you need to modify this value to use separate port numbers for each EC once the installation is completed. Do this by using the mzsh topo set command: mzsh topo set topo://container:<container>/pico:<name>/val:config.properties.ec.webserver.port <new_port_number>",
    "title": "Execution Container Properties - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205029670/Execution+Container+Properties",
    "word_count": 501,
    "char_count": 3340
  }
]