[
  {
    "chunk_id": 1,
    "text": "TLS can be set up to demand authentication from all clients that run outside the local host. The Platform, ECs, SCs will then ask for valid certificates from each connecting pico instance. After you have set up TLS, as described in TLS Standard Setup , follow the steps below to enable client authentication. Set the properties that specifies the keystore path and the passwords in each Execution Container. Use the same values as for the Platform Container. There are two methods that you can use to make the client/server certificates available on all containers. Copy the keystore file that was created in TLS Standard Setup from the Platform Container to each of the Execution Containers. The target path is specified by the property pico.rcp.tls.keystore . Create a keystore and key pair on each Execution Container, then export and import the certficates. The certificate from the Platform Container must be exported to all Execution Containers. The certificates from the Execution Containers must be exported to the Platform Container. Run the following command to export a certificate: $ keytool -keystore <keystore file> -export -rfc -alias <alias_name> -file <certificate filename> Run the following command to import a certificate: $ keytool -import -alias <alias_name> -file <certificate_file_name> -keystore <keystore file> -keypass <password> -storepass <password> Enable client authentication by setting the property pico.rcp.tls.require_clientauth to true . Restart the system Desktops When client authentication is enabled, each desktop installation must authenticate itself to the Platform using a private key. You have to import this key in the Desktop Launcher in order to connect to the Platform. The certificate must also be imported as a trusted certificate in the Platform keystore. Run the following command to create a keystore that contains a private key. $ keytool -genkey -keystore <keystore file> -alias <alias> -keyalg RSA -keysize 2048 Copy the keystore file to the host that will run the Desktop Launcher. Create a certificate file that is associated with the key that you created in the previous step. $ keytool -keystore <keystore file> -exportcert -alias <alias> -file <certificate filename> Import the certificate to the platform $ keytool -keystore <platform keystore> -import -file <certificate filename> -alias <alias> Open the Desktop Launcher. Right-click on a MediationZone instance and then select Instance Settings from the popup menu. Select the Security tab. Right-click on the text field under Client Key and select Import Key From File . Select the key file that you copied in step 2.",
    "title": "Enabling Client Authentication - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204647240/Enabling+Client+Authentication",
    "word_count": 403,
    "char_count": 2633
  }
]