[
  {
    "chunk_id": 1,
    "text": "Subject to user permission settings that is configured via the Reference Data Profile and Access Controller, Reference Data Management allows you to manipulate the data within the query result of your table. You can insert one or more new rows, edit one or more fields in the data. You can even remove rows of records from the result. Any insert, edit or delete action applied to the data set will cause the modification status bar to appear. The modification status bar will display the total uncommitted modification count and a Review button to open the Review Modification(s) dialog. The Review Modification(s) dialog allows you to review, discard or commit the modifications. On commit, the Reference Data Management will attempt to commit the changes into the database table and refresh the query result with the latest changes. Note! Data set is the scope in which modifications are applied. When switching data set, any uncommitted changes will be discarded. Any uncommitted changes will also be discarded when changing the query configurations or leaving Reference Data Management page. Note! Manipulating the data is only applicable if the Standard Search Type is selected in the Query dialog. Refer to Querying A Table In Reference Data Management for more information. 1 Inserting rows 2 Editing the fields 3 Removing rows Inserting rows To insert your rows into the table: Click on Insert Row button in the query result view of the Reference Data Management dashboard. The Insert Row button is enabled once you have successfully queried a result. The Insert Row dialog will pop up. Input fields will be created for each column for you to fill in all relevant data into. Be fully aware of the data type for each of these columns and fill them in accordingly as any mismatch data type will cause an error when you commit the rows into the table. Once you are done filling in the fields, click on Apply to complete the action and close the dialog. Open To add additional rows, just click on Add another row and fill in the data for the new row. Once you have completed filing in all the rows you want to insert, click on Apply to complete the action and close the dialog. Note! Only columns with supported data types are available in the Insert Row dialog. All supported columns in the table will be present in the Insert Row dialog, even if you did not choose to display all of them in your query result. Note! While in the Insert Row dialog, any columns on the table that are set to NOT NULL will have their fields highlighted in red when empty. If you have set a character limit for the data in the columns, the fields in the Insert Row dialog will also have the same limit. The new row(s) are now ready for review. Click on the Review button to open the Review Modification(s) dialog. There will be a green INS label on the query result view to indicate that the row is under review and has yet to be committed into the table. Open In the Review Modification(s) dialog, you can review the row(s) that you have added and check for any mistakes. Open If the row contains a mistake, you can discard that row from the Review Modification(s) dialog and insert it again with the correct data. Once everything is reviewed and is correct, you may click on Commit . A confirmation dialog will appear prompting you to continue or to cancel. On success, you will see a green notification on the top of your browser that will show you how many data changes have been successfully committed. You can then download the SQL script used for inserting the row(s) or you can also click on Details to view details of the commit. Once you are done, you may close the notification. Open On any failure during the commit, you will see a red notification on the top of the your browser and no rows will be inserted. Open You can download the SQL script or click on details to see more details on the error. Open You can click on Force Commit to attempt to insert some of the row(s) into the table. Editing the fields You can only edit one row at a time from the query result view. To edit row(s) in the table: Click on the meatball menu button on the row you want to edit the value of and select Edit to open the Edit dialog. Open Input fields will be created for each column and current values for the fields will be filled in. Update the value(s) of the field(s) you wish to change. Once you have edited enough, click on Apply to complete the action and close the dialog. Note! Only columns with supported data types are available in the Edit dialog. All supported columns in the table will be present in the Edit dialog, even if you did not choose to display all of them in your query result. Note! While in the Edit dialog, any columns on the table that are set to NOT NULL will have their fields highlighted in red when empty. If you have set a character limit for the data in the columns, the fields in the Edit dialog will also have the same limit. Open The updated row(s) are now ready for review. Click on the Review button to open the Review Modification(s) dialog. There will be a blue UPD label on the query result view to indicate that the row is under review and the edit is yet to be committed into the table. Open In the Review Modification(s) dialog, you can review the row(s) that you have edited and check for any mistakes. Open If the row contains a mistake, you can discard that row itself from the Review Modification(s) dialog and edit it again with the correct data. Once everything is reviewed and is correct, you may click on Commit . A confirmation dialog will appear prompting you to continue or to cancel. On success, you will see a green notification on the top of your browser that will show you how many data changes have been successfully committed. You can then download the SQL script used for altering the row(s) or you can also click on Details to view details of the commit. Once you are done, you may close the notification. On any failure during the commit, you will see a red notification on the top of the your browser and no rows will be altered. You can download the SQL script or click on details to see more details on the error. You can click on Force Commit to attempt to edit some of the row(s) in the table. Removing rows To remove rows from the table: There are 3 ways to remove rows. You can select only one row, multiple rows or remove all of the rows in the data set. To remove one row: Click on the meatball menu button on the row you want to remove and select Delete . Open To remove multiple rows: Select multiple rows to remove at one time by clicking on the check box at the left of each row. Then click on the Delete button on the table toolbar. Note! Due to the lazy loading feature, selected rows will be cleared if scrolled too fast or too far away from the selected row(s). It is estimated that the table is able to handle selection within a window of 150 rows with moderate scrolling speed. Open To remove all rows in the data set: Click on the Delete button on the table toolbar without selecting any rows. Open A confirmation dialog will appear and you can click on Ok to mark the row(s) for removal or Cancel to stop the operation. You will still need to review the removal before it gets completely deleted from the table. The marked row(s) are now ready for review. Click on the Review button to open the Review Modification(s) dialog. There will be a red DEL label on the query result view to indicate that the row is under review and the removal is yet to be committed into the table. Open In the Review Modification(s) dialog, you can review the row(s) that you have marked for removal and check for any mistakes. In case there are also new rows that are being inserted or rows being updated included in the review, information for rows marked for deletion can be found with a red background. Open If the marked row is not what you want removed, you can discard it from the Review Modification(s) dialog and it will no longer be marked for removal. Once everything is reviewed and is correct, you may click on Commit . A confirmation dialog will appear prompting you to continue or to cancel. On success, you will see a green notification on the top of your browser that will show you how many data changes have been successfully committed. You can then download the SQL script used for dropping the row(s) or you can also click on Details to view details of the commit. Once you are done, you may close the notification. On any failure during the commit, you will see a red notification on the top of the your browser and no rows will be dropped. You can download the SQL script or click on details to see more details on the error. You can click on Force Commit to attempt to delete some of the row(s) in the table.",
    "title": "Manipulating The Data In Reference Data Management - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204743480/Manipulating+The+Data+In+Reference+Data+Management",
    "word_count": 1608,
    "char_count": 8781
  }
]