[
  {
    "chunk_id": 1,
    "text": "The WSCycle UDR represents an operation that is specified in the WSDL file. The naming structure is WSCycle_[operationName] . The agent using a WS profile will have as many input and output types as operations in the web service defined by the WS profile. The number of fields and field types in a WSCycle UDR will be set based on how the Web Service operation is defined in the WSDL file. Each WSCycle UDR contains the number of fields necessary to hold the information needed when sending or receiving a request or response. For example an operation with nothing in the input and output messages and no declared fault types will have no other fields than the ones from the AbstractWSCycle UDR. Open WSCycleUDR The structure of the WSCycleUDR_operationName depends on the definition of the operation in the WSDL file. The following table will present more information about possible fields. Field Description Field Description param (type corresponding to the input type) This field exists only if the operation has at least one request message type in its input message declaration. The param field type corresponds to the type defined in the XML schema, simple or complex type. If it is a complex type, a UDR containing fields corresponding to the types in the complex type will be created. Note! If the name of a complex input type in the XML Schema starts with a lower case character, the input type might be represented by several fields. The name of each of the fields is the name of the input type, prefixed by param_ . response (type corresponding to the output message of the operation) This field exists only if the operation has a response message that is not empty. The field shall be set before the WSCycleUDR is routed back to a Web Service Provider agent to send back a response message to the requester. This field is set to a value corresponding to the response message when the WSCycle UDR comes from a Web Service Request agent. fault_FaultTypeName (FaultTypeName is optional) It is possible to declare fault types for an operation. Messages of the fault types can be sent back from a Web Service instead of an ordinary response message. To send back a fault message instead of an ordinary response message, you have to set one of the fault fields. The FaultTypeName part of the field name will be the name of the declared fault type.",
    "title": "The Web Service WSCycle UDR Type - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204643983/The+Web+Service+WSCycle+UDR+Type",
    "word_count": 408,
    "char_count": 2354
  }
]