[
  {
    "chunk_id": 1,
    "text": "usage: wfexport <workflow configuration> <export file> [-csv|-tsv|-ssv] [workflow configuration password] This command creates a file, (CSV, TSV, or SSV), of the data that is stored in the Workflow Table. This file contains a header row that lists the names of the Workflow Table columns. Option/Parameter Description <workflow configuration> Specify the workflow configuration that you want to export. <export file> Specify the name of the export file [-csv|-tsv|-ssv] Specify one of the wfexport supported formats according to which the export file should be created: CSV (Comma Separated Value) - Default format SSV (Semicolon Separated Value) TSV (Tab Separated Value) Note! Text strings within each value are delimited by a quotation mark (\"). In the export file, External References are enclosed in braces ({}) preceded by a dollar symbol ($). For example: ${mywf_abcd} . For further information see External Reference Profile . Similarly, Execution Settings in the export file, are enclosed in braces ({}), but are preceded by a pound symbol (#). For example: #{mywf_exsettings} . For further information see Execution Settings below. To prevent a workflow table column from being updated by the export file data when importing, delete that same column from the export file. [workflow configuration password] For an encrypted export file, provide a password. Example - General use of wfexport Create the file wf_disk_collection.csv under the tmp directory. $ wfexport Default.disk_collection /tmp/wf_disk_collection The wf_disk_collection.csv export file: \"ID\",\"Name\",\"[Disk_1]Directory\",\"[Disk_1]Filename\" 1,\"workflow_1\",\"/tmp/in\",\"in.file\" 3,\"workflow_3\",\"/tmp/in3\",\"in3.file\" 100,\"workflow_100\",\"/tmp/in100\",\"in100.file\" 109,\"workflow_110\",\"/tmp/in101\",\"in101.file\" 110,\"workflow_110\",\"/tmp/in101\",\"in101.file\" 111,\"workflow_112\",\"/tmp/in112\",\"${a}\" 112,\"workflow_113\",\"/tmp/in113\",\"a\" Execution Settings An export file of a workflow configuration may include settings for an EC. Setting Description Valid Values Setting Description Valid Values type The configuration type. execsettings enabled Specifies whether or not the configuration is enabled true or false disttype The workflows load balancing method. sequential , wfcount , machineload, or roundrobin . For further information see Workflow Properties . ecgroups A vertical bar (|) delimited string of the configured Execution Context groups. The list is enclosed with brackets. Hint! Multiple ecgroups can be specified at once. [] = an empty ecgroups. Example - Export data of EC configurations With an EC configuration, the export file will include: #{type=execsettings#enabled=true #disttype=wfcount#ecgroups=[ec1|ec2]} With a disabled EC configuration, the export file will include: #{type=execsettings#enabled=false} Return Codes The following is a list of return codes for the wfexport command: Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if the number of arguments is incorrect. 1 Will be returned If login credentials are incorrect. 1 Will be returned if configuration permission is denied. 3 Will be returned if the directory does not exist or has no write access. 5 Will be returned if the export file has an incorrect file suffix. 6 Will be returned if the configuration name is incorrect. 7 Will be returned if the configuration does not exist. 9 Will be returned if an encryption passphrase is needed. 10 Will be returned if the user does not have the read permission to access the workflow. 11 Will be returned if the configuration could not be loaded. 12 Will be returned if the export fails (refer to the logs for details).",
    "title": "wfexport - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/298614810",
    "word_count": 514,
    "char_count": 3666
  }
]