[
  {
    "chunk_id": 1,
    "text": "Workflow configurations may be designed, configured, and saved step-by-step, but are still not valid for activation until fully configured and valid. A valid workflow configuration contains three types of configuration data: Workflow data : General information related to the workflow configuration, for instance, error handling. Workflow structure data : Contains the agents and routes. A route indicates the flow of data depending on the name of the route and the internal behavior of its source agent. Agent specific data : Each agent has a different behavior. Thus, each agent in the workflow configuration requires different configuration data in order to operate. When a workflow is saved, it is silently validated and if some of its configuration is invalid or missing, a dialog will state this and ask whether to still save the workflow or not. Validity is not necessary in order to save a workflow configuration. The workflow can be incomplete or the agent configuration can be faulty. The only exception is that all workflows in the workflow configuration must have unique names. When data is imported to the workflow table, the content is not validated, only the correct number of columns and types are checked. If validation errors occur during the import, the user is asked whether the import should be aborted or continued (that is, importing with errors). Aborting an import results in restoration/rollback to the previous table. How Workflow Validation Works When you click the ( Validate ) button, the workflow configuration validation is started. The validation is done in two steps: Validation of the workflow configuration. If the workflow configuration is invalid, an Information dialog is opened showing details, such as if configuration data or routes are missing, if referenced MIM resources are no longer available, or if configuration data in an agent is missing. The details can be changed by modifying the agent configuration, after clicking OK . If the workflow configuration is invalid the validation process ends there. Example of an invalid workflow Information dialog If the workflow configuration is valid, the validation of the workflow table starts. The values in the table are validated according to each agent's specifications. There is also a check that values have been added for all cells in the per workflow columns. The result is presented in a validation dialog and possible workflow errors are indicated in the workflow table. You can view the validation message for a specific workflow by selecting the corresponding action in the pop-up menu. If none of the workflows in the workflow configuration are valid, you get a dialog saying none of the workflows are valid. If it is not evident why the workflow(s) is erroneous, you can select one or more rows in the workflow table and then click on Validation Message to display a dialog with error message(s). Open Validation dialog for workflow table Note! External References are validated only during runtime. How to tell when the workflow is valid or invalid There is a label at the top of the workflow template, to the right of the workflow template name, that indicates if the workflow configuration is valid or invalid. Open Open Validity labels for workflow template For workflows, the workflow table for each row has the following symbols: Open which indicates that the workflow and related fields in that row are valid Open which indicates that the workflow and related values for the configuration in that row are invalid For example, data type can be invalid (if there are words in a numeric value only field), or a mandatory field could be empty. You can also tell if a workflow is invalid in the Configuration Browser in the Build view if the workflow configuration name is RED in color. Open Configuration Browser with an invalid workflow configuration",
    "title": "Workflow Validation - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204638608",
    "word_count": 628,
    "char_count": 3859
  }
]