[
  {
    "chunk_id": 1,
    "text": "System Importer enables you to import data to your system from a ZIP file or a remote source like Git or AWS S3. The import contains data about your system, its configurations, and run-time information. System Importer imports data that has been exported by the System Exporter. Note! In Legacy Desktop, you can also import from a directory. The file exported by the System Exporter can contain data from the following categories: Configuration: Workflow configurations, Profiles, Workflow groups, Ultra formats, Event Notifiers and Alarms etc. Run-Time Data: Data that is produced by the system during workflow execution, for example, ECS UDRs, Aggregation Sessions, etc. System: Other customizable parts such as Error Codes, Reprocessing Groups, Configuration Folders, Pico Host, Ultra, User, or Workflow Alarm Value. Workflow Packages: Workflow Packages are compiled versions of configurations, and are created in the Workflow Package mode in the System Exporter. To open the System Importer, go to Manage  Tools & Monitoring and then select System Importer. Open Source Type: Select the source of the export from either: Local : A locally stored export can be selected or dropped in the selected area. Remote: An export stored in a remote source. Currently available for Git and AWS S3. Git is only available in the Desktop interface . Available entries : Contains a tree layout view of the data you can select to import. Logs : Contains a log of the import process Importing from Local Source To import data/configurations from your local machine: Select the appropriate options according to your preferences by clicking the Options button. Click the Select File... button to select the directory where the data to be imported is located. Alternatively, you can also drag and drop the file in the Drop file here area. Open System Importer with log In the Available Entries field, expand the folders and select the check boxes for the entries you want to import. You can also use the Search field to find the appropriate entry to import. Click on the Import button to start the import process. After the import is completed, the Available entries field is cleared of all directories, and the selected file is also removed. You can perform an initial test import to check for any errors. To do this, click the Dry run button. This does not import the entry into Configurations . When the Dry Run is complete, the Available entries field is not cleared off and the selected file is not removed. You can proceed to click the Import button to import data. Open Dry run logs Upon clicking the Import button, it immediately changes into the Abort button, which enables you to cancel the Import process. After clicking abort, the file is removed and you will need to reimport the file to continue the import. If the directory structure of the imported file is not identical to that of the exported material, the import will fail. Update the dynamic configuration data in the collectors with the file sequence numbers that you had noted down before performing the Export. For further information, see the section, To Export Data, in System Exporter . Enable all the workflows that are configured with Scheduling. Before importing Inter Workflow and Aggregation profiles, empty the Workflow data stream. Otherwise, these agent profiles will be overwritten by the profiles that are included in the imported bundle and might not recognize or reprocess data. Imported Workflow groups are disabled by default. You need to activate all the members, their respective sub-members, and the workflow group itself. When you import a User it is disabled by default. A User with Administrator permissions must enable the user and revise which Access groups the user should be assigned to. Imported Alarms are disabled by default. You enable an Alarm from the Alarm Detection. Imported Event Notifications are disabled by default. You enable an Event notification from the Event Notification Configuration. Importing from Remote Source To import data/configurations from a Git branch or AWS S3 bucket: Select the appropriate options according to your preferences by clicking the Options button. Click the Browse button to choose a File System Profile with type Git or AWS S3. Open Choose File System Profile Click the Select Source to choose the folder to import from. The following image shows the import using Git. Open The following image shows the import using Amazon S3. Open Continue from step 4 in Importing from Local Source . Options Click the Options button to open the Options menu. Open The Options menu The Options menu has multiple settings described in the following table: Setting Description Setting Description Import options Abort On Error Select this option to abort the import process if an error occurs. If an error occurs and you do not select this option, the import will be completed, but the imported data might contain erroneous components. Note! Invalid Ultra and APL definitions are considered erroneous and result in aborting the import. Import External Reference Database Values Select this option if you want to import external reference values. Select Dependencies Select this option to have dependencies follow along with the entries that you actively select. Preserve Permissions Select this option to preserve user permissions in the current system when importing a configuration. Clear this option to accept overwriting of user permissions in the current system. Import Configuration From Package Select this option if you would like to import the Workflow Package (MZP) as a configuration instead of a Workflow Package. New Owner Use this drop-down menu to reassign the ownership of configurations to another user, during an import. Workflow groups executions suppress option No Suppress Select this if you do not want to suppress the workflow group execution. Hold Execution Select this option to prevent scheduled Workflow groups from being executed while importing configurations. Restart For information, see systemimport . Stop and Restart For information, see systemimport . Stop Immediately and Restart For information, see systemimport . Wait for Completion and Restart For information, see systemimport . Beside t he Options button, these buttons exist: Button Description Button Description Expand All Select this option to expand all of the folders to display the folders and all the configurations that they contain. Collapse All Select this option to collapse the folders so only the folders are visible.",
    "title": "System Importer - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204998199/System+Importer",
    "word_count": 1048,
    "char_count": 6537
  }
]