[
  {
    "chunk_id": 1,
    "text": "To open the ECS Inspector, click the Inspection button in the upper left part of the Desktop window, and then double-click ECS Inspector in the menu. Initially, the dialog is empty and must be populated with data. Click Search to open the Search ECS dialog. The columns differ depending on whether the search is done for UDRs or batches. For further information, see Searching the ECS . Maximum Number of Displayed UDR Entries To ensure that the GUI does not have to handle too much data, the maximum number of displayed UDR entries is set to 100,000 UDR entries. However, in the configuration file for the Platform instance, you can change the maximum number of displayed UDR entries by setting the property mz.ecs.max.udr.search in the platform.conf file. Example Setting the property mz.ecs.max.udr.search to 10000: mzsh topo set topo://container:<platform container>/pico:platform/val:config.properties.mz.ecs.max.udr.search 10000 If you want quicker and smaller search results you can set this property to a lower value. Note! If the value of the property is set higher than the default value, it may result in poor performance. Note that this property only has effect when UDRs are inspected, not batches. Maximum Number of UDR Entries to Update To ensure that the Platform, using standard 256 Mb heap size, does not run out of memory, the maximum number of UDR entries to update or delete is limited to 15,000,000 UDR entries. However, this limit is easily increased using the Platform property mz.ecs.max.udr.update in the configuration file for the Platform instance. Example Setting the property mz.ecs.max.udr.update to 25000000: mzsh topo set topo://container:<platform container>/pico:platform/val:config.properties.mz.ecs.max.udr.update 25000000 Note! When increasing the default limit, you may have to increase the Platform maximum heap size as well. This is done by changing the -Xmx parameter in the configuration file for the Platform instance. As a general rule, the ECS needs another 10 Mb Platform heap space for every additional one million UDRs. Buttons in the ECS Inspector The following menu items apply for both batches and UDRs. Setting Description Search Displays the Search ECS dialog where search criteria may be defined to limit the entries in the list. For further information, see Searching the ECS . Matching entries are bundled in groups of 500 in the table. The list shows which group, out of how many, that is currently displayed. An operation targeting all matching entries, will have effect on all groups. Select All Selects all entries in the ECS Inspector. Refresh Refreshes the data in the table. Delete Removes selected entries, or if no entries are selected, all entries, provided that the reprocessing state (or RP State , see ECS Inspector Table ) is set to Reprocessed . There is a predefined cleanup task, ECS_Maintenance, if you prefer not to purge the ECS manually. For further information, see ECS Maintenance System Task . Note! If the maximum number of entries that can be displayed in the table has been exceeded. The delete operation will still be applied for all matching entries. Error Codes Displays the Error Codes dialog where error codes in the system may be configured. For further information, see ECS Error Codes . Reprocessing Groups Displays the ECS Reprocessing Group dialog, where reprocessing groups are managed. For further information, see ECS Reprocessing Groups . Searchable Fields Opens the ECS Searchable Fields dialog, where you can define specific UDR fields that you want to add as meta data that can later be used for making searches. See Configuring Searchable Fields in the ECS . Restricted Fields Opens the Restricted Fields dialog, where you can specify certain fields within certain UDR types that should be restricted from being updated in the ECS Inspector. See ECS Restricted Fields Configuration . Right-click Menu Options Right-clicking a row in the ECS Inspector shows row-specific menu options. Some options are batch- or UDR-specific, while other options apply to both batches and UDRs. Right-click menu options Explore UDR... Available for UDRs. Displays the UDR dialog presenting the content of the selected UDR(s). The dialog is also displayed if you double-click on a cell in the UDR Type column in the table of entries. In the dialog, the content of the UDR can be changed, except for the field Original Data . Open The UDR dialog For further information, see the Ultra Reference Guide . Explore Error UDR... Available for batches. Displays the Error UDR Viewer presenting the content of the Error UDR (if any). The viewer is also displayed if you double-click on a cell in the Error UDR column in the table of entries. Open The Error UDR viewer It is not possible to change the content of an Error UDR. Set Tag on UDR(s)... With this option you can set tags on selected UDRs. Select the UDR(s) you want to tag, right-click and select Set Tag on UDR(s)... A dialog opens where you can enter a Tag Name . Entering Tag Name The Tag Name is visible in the Tag column in the ECS Inspector. Clear Tag(s) on UDR(s)... Select this option to remove tags for the selected UDRs. Set State... Defines the state of a selected number of entries or, if no entries are selected, all entries. Possible states are New or Reprocessed . The state Reprocessed indicates that the entry has been collected by an ECS Collection agent and has been reprocessed with errors. Already processed data can be reset to New to enable recollection. When the state is changed, the timestamp in the Last RP State Change column in the ECS Inspector is updated. See ECS Changing State for more information. Note! If the number of matches is larger than the maximum number of UDRs to be displayed the state change is still applied for all matching entries. Assign to RPG... Assigns a selected number of entries or, if no entries are selected, all entries, to a reprocessing group (RPG). Grouped entries can be collected simultaneously by an ECS collection agent. Open Message when collecting grouped entries Note! Assignments to reprocessing groups can be made automatically for each new entry. In order for this to happen, the data must be assigned an Error Code in the workflow, and this Error Code must be mapped to the reprocessing group in the ECS Error Code dialog. Bulk Edit... Available for UDRs. Several UDRs (selected or matched) may be edited simultaneously with the Bulk Editor. The Bulk Editor has a Preview option, which makes it possible to preview the changes prior to approving and saving. When changes have been made you can select to view only the modified entries, the untouched entries, or all entries in the ECS Inspector. Open The ECS Bulk Editor Note! If the number of matches exceed the maximum number of entries that can be displayed, it may be a good idea to set up a workflow for editing the entries using APL instead of performing a bulk edit. Click the Apply Changes button, to display the Bulk Edit Result dialog, which displays modified and untouched entries. Open The Bulk Edit Result dialog Now you can select if you want to view the Entire Result Set , Modified Only , or Untouched Only entries in the ECS Inspector. Click View to make your selection. The selected entry type is displayed in the ECS Inspector. Information about what selection you made is displayed in the top right corner, above the ECS inspector table, e.g. \"Modified Entries from Bulk Edit\" or \"Entire Work Set from Bulk Edit\". Hint! If you want to view the changes before applying them, you can click on the Preview button. The Bulk Edit Result - Preview dialog opens, giving you a preview of the changes that are about to be made. If you are satisfied with the preview, click the Apply button, and the Bulk Edit Result dialog opens. For further information about the Bulk Editor, see the Ultra Reference Guide . Delete Open Removes selected, or if no entries are selected, all matched entries, provided that the reprocessing state (or RP State , see ECS Inspector Table ) is set to Reprocessed . The ECS does not have to be purged manually, there is a predefined cleanup task - ECS_Maintenance for automatic purging. For further information, see ECS Maintenance System Task . Note! If the maximum number of entries displayed in the table has been exceeded, the delete operation is still applied for all matching entries. View Batch... Available for batches. Displays the selected batch as raw data. Open View Batch",
    "title": "ECS Inspector - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205685310/ECS+Inspector",
    "word_count": 1410,
    "char_count": 8480
  }
]