[
  {
    "chunk_id": 1,
    "text": "Were excited to announce the release and general availability of MediationZone 9.3! This release brings several updates designed to optimize productivity, enhance scalability and performance, and strengthen security and compliance, including features focused on refining usability. In MediationZone 9.3, we have further advanced the platform's ability to handle real-time and batch data processing, deepened integration with major cloud platforms, and strengthened security features to protect sensitive data. These updates allow you to scale operations more effectively, streamline processes, and maintain secure, compliant environments. Some of the key features are: Kafka Enhancements This feature encompasses a complete refactoring of the Kafka agents, introducing a new set of collector agents and a real-time forwarder agent with support for subscribing to multiple topics per agent, with wildcard functionality. Improved support for batch processes also enhances efficiency when handling large volumes of data. The new agents enable scale-out capabilities with automatic rebalancing, ensuring that multiple workflows can efficiently manage and process data in parallel. The new agents bring significant usability and efficiency improvements in configuration, management, and operation, and enable you to seamlessly integrate Kafka with MediationZone for optimized data processing and management, see Kafka Agents . Integration with Amazon SQS In this release we are introducing dedicated publisher and subscriber agents for integration with Amazon Simple Queue Service (Amazon SQS), enhancing compatibility with AWS cloud services for customers operating in hybrid environments. These agents facilitate bidirectional communication between MediationZone and Amazon SQS, ensuring smooth messaging and data exchange within the AWS ecosystem. The new agents provide control and flexibility in managing SQS message queues, enabling efficient data processing and seamless integration with AWS services. With these agents, you can optimize your workflows, improve operational efficiency, and ensure reliable data transfer in AWS cloud environments. See SQS Agents for more information. Support Google Cloud Secret Manager for Secrets and Security profiles Securing sensitive information, such as passwords, certificates, and keys, is a fundamental requirement in todays digital landscape. The integration with Google Cloud Secret Manager in this release provides centralized secret management, allowing users to securely store and retrieve secrets while associating them with specific environments. This granular level of control ensures that only authorized individuals and systems can access the necessary credentials, offering a robust enhancement to overall security measures. See Google Secret Manager Profile for more information. Amazon S3 Agents for real-time workflows This feature enables real-time collection, transformation, and enrichment of data using Amazon S3, supporting critical use cases such as real-time data processing, disaster recovery, and data backup. It also facilitates scalable data storage and seamless integration with analytics and machine learning platforms. Previously, the Amazon S3 agents were only available for batch workflows. The inclusion of Amazon S3 agents for both batch and real-time workflows mirrors the capabilities of existing SFTP/SCP/FTP/Disk agents, ensuring comprehensive and flexible data management across different environments. This unified approach not only optimizes costs but also provides you with the ability to handle large volumes of data, enabling quick access to actionable insights and supporting robust data operations See Amazon S3 Agents for more information. Logging Enhancements The Logging Enhancements in MediationZone 9.3 introduce a new 'Log Filter' function, enabling you to adjust logging settings in real-time for an individual or group of picos. With this feature you can swiftly modify logging levels and apply filters to specific packages as needed. When special logging configurations are no longer needed, logging can easily be reset to their default settings. The update also enhances overall logging quality and usability by ensuring accurate and consistent logging across all agents and components. A thorough review and cleanup of existing logs have been completed to maintain system-wide consistency. See Log Filter for more information. We encourage you to explore all the detailed features and enhancements below to gain a comprehensive understanding of the capabilities in MediationZone 9.3: New Features Usability Desktop Search Log Filter Support for wfexport and wfimport mzsh Commands MZSH Command For Shutting Down Desktop and Legacy Desktop New Connectors New Kafka Agents Amazon S3 Agents in Real-Time Workflows Amazon SQS Agents APN Processing Agent SAP CC REST Agent MariaDB Support Supported Agents for MariaDB Additional APL Functions and Event Notifications Support MariaDB Integration and Security User Security Improvements SAP CTS+ Integration Reference Data Management Supports SAP HANA Authentication and Monitoring Google Secret Manager System Statistics Enhancements followRedirects Field for RequestCycle UDR in HTTP/2 Agents HTTP/2 Client Agent Support Additional OAuth Settings All of these are explained in more detail in MediationZone 9.3 Release . Information about where the release can be accessed is available here: Release Information . Overall user documentation is available at: MediationZone Documentation 9.3 . Enjoy!",
    "title": "MediationZone 9.3 Released! - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/blog/2024/09/24/331874639/MediationZone+9.3+Released",
    "word_count": 772,
    "char_count": 5542
  }
]