[
  {
    "chunk_id": 1,
    "text": "usage: wfimport [-keepOld [yes|no]] <workflow configuration> <export file> [workflow configuration password] This command updates the specified workflow configuration by importing workflows that are defined in the export file. Example - wfimport The workflow configuration Default.disk_collection workflow configuration is updated with with imported data from the file wf_disk_collection.csv . $ wfimport Default.disk_collection wf_disk_collection.csv Option/Parameter Option/Parameter [ -keepOld [yes|no] ] Set this option to yes to retain the existing workflow table data that is not updated by the export file. Set it to no to remove such data from the workflow table. The default value is no . <workflow configuration> The workflow configuration that you want to be updated by the export file. <export file> The export file name. For further information about the export file see wfexport . Note! wfimport imports the file formats: CSV (Comma Separated Value), SSV (Semicolon Separated Value), and TSV (Tab Separated Value). Text strings within each value are delimited by a quotation mark ( \" ). Exported fields that contain profiles, are assigned with a unique string identifier. The ID and Name fields are exported, as well. [workflow configuration password] To import a password protected workflow configuration, specify a password. Return Codes The following is a list of return codes for the wfimport command: Code Description Code Description 0 Will be returned if the command was successful. 1 Will be returned if the number of arguments is incorrect. 1 Will be returned If login credentials are incorrect. 1 Will be returned if configuration permission is denied. 2 Will be returned if the import file does not exist. 2 Will be returned if the import file directory does not exist. 3 Will be returned if the import file cannot be read (read permission). 5 Will be returned if the import file has an incorrect file suffix. 6 Will be returned if the configuration name is incorrect 7 Will be returned if the configuration does not exist. 8 Will be returned if the configuration is already locked. 9 Will be returned if an encryption passphrase is needed. 10 Will be returned if the user does not have the read and write permission to modify the workflow. 11 Will be returned if the configuration could not be loaded. 12 Will be returned if the import fails (refer to the logs for details).",
    "title": "wfimport - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/298647583",
    "word_count": 383,
    "char_count": 2400
  }
]