[
  {
    "chunk_id": 1,
    "text": "Generally, 10 GB of allocated storage space for the platform database is sufficient for typical installations. Note! Some customers use many times more than 10GB, depending on their processing volume and specific use cases. These figures are based on our experience with large customers who have complex use cases and their calculated database storage usage. The database storage should be regularly monitored, and additional space provided as needed to ensure there is always enough free space to accommodate any increase in database storage usage. This takes into account that the platform database storage space used will be maintained by ensuring SystemTask maintenance tasks listed below are scheduled to run and purge expired data automatically for: Archive data cleaner Configuration Cleaner ECS Maintenance Statistic Cleaner System Logs Cleaner User Cleanup To configure the maintenance tasks, click on the Build menu and expand the System Task folder. Sizing conditions The recommended sizing described here is valid as long as excessive database utilization is avoided. For production systems, it is crucial to minimize excessive logging and database inserts to ensure uninterrupted operation. Before transitioning a solution from development to production, it is important to Remove non-crucial system logging in APL as extensive logging to the system log could cause the database tables to grow unnecessarily Disable Debug on all workflows to reduce disk space used. In the same manner, if Error Correction System (ECS) is used, it is essential to have proper handling of all error cases so that the ECS database tables are not growing and that there is valid reprocessing logic in place for all types of error cases. In addition, database storage space used by Duplicate Batch functionality depends on its profile Max Cache Age settings. Exceptions Some product features can optionally store data in the database instead of disk. The sizing recommendation mentioned in this section does not take these into account since the required additional database space depends on each use case. As such the additional database space required must be calculated separately to be sufficient for accommodating these operations, if they are used. We recommend using a separate database for these functions rather than the platform database. These functions are: Audit Profile | Configuration Aggregation Profile | Session Tab Data Veracity Duplicate UDR Profile | SQL Storage Inter Workflow Profile | Configuration",
    "title": "Database Sizing - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/511639988/Database+Sizing",
    "word_count": 385,
    "char_count": 2514
  }
]