[
  {
    "chunk_id": 1,
    "text": "When a workflow group is executed and stopped depends on its configuration as well as on events that occur while running. To understand how a workflow group operates, see the state diagram below and the detailed description of the different states that follows. Open The Workflow Group state diagram State Description State Description Aborted The default behavior is that a workflow group does not assume the Aborted state until all of its members are back to Idle. When one member is in the Aborted state, the workflow continues until all the other members in the workflow group have finished execution. Then the workflow group gets into an Aborted state. Note! You can change the default behavior by using the Behavior when member abort settings in the Execution tab, see Execution in Managing a Workflow Group . When you stop a workflow group, it first assumes the Stopping state and takes care of all transactions. When this is done, the workflow group state changes to Idle. Hold A workflow group that is in the Idle state while being imported - either by the mzsh systemimport r | sr | sir | wr or by the System Importer configured to Hold Execution - enters the Hold state until the import activity is finished. The workflow group then resumes its Idle state. Idle The workflow group configuration is valid , and none of its members is currently being executed from within the workflow group. Invalid There is an error in the workflow group configuration. Note! The workflow group cannot be executed in the Invalid state. Running The workflow group is running, controlling the execution of its members according to the configuration settings. Stopping A manual stop of the workflow group, or of the parent workflow group, makes the workflow group enter the Stopping state. The workflow group remains in the Stopping state while all the members are finishing their data transactions. Then the workflow group goes into either the Idle or the Aborted state. Suppressed Workflow groups that are in the Running state while configurations are being imported - either by the mzsh systemimport r | sr | sir | wr command, or by the System Importer configured to Hold Execution - enter the Suppressed state. In this state any scheduled members are prevented from being started. The workflow group remains in this state until the import activity is finished. Then, if the workflow members are still running, the real-time workflow group returns to the Running state. Batch workflow groups remain in the Suppressed state until their members complete their execution. Then, the workflow group state becomes Idle. Note! If the workflow group is in the Suppressed state, and you stop all the workflow group members, the workflow group enters the Stopping state. If this happens while an import process is going on, the workflow group moves from the Stopping state to the Idle state, and then to the Hold state.",
    "title": "Workflow Group States - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204605010/Workflow+Group+States",
    "word_count": 488,
    "char_count": 2903
  }
]