[
  {
    "chunk_id": 1,
    "text": "Alarm Detection helps you define the criteria for the generation of alarm messages. You select a condition, or combine a set of conditions, that within specific limits, generate an alarm message. To monitor the system alarms, you use the Desktop. Note that you can deliver alarm messages to SNMP monitoring systems, as well. To create a new Alarm Detection configuration, click Build  New Configuration in the Desktop, and then select Alarm Detection from the Configurations window. To open an existing Alarm Detection configuration, double-click on the configuration in the Configuration browser, or right-click a configuration and then select View Configuration . The Alarm Detection configuration contains the standard configuration buttons as described in Common Configuration Buttons and one additional button: Button Description Button Description Open To define a variable to use in the APL code, see the APL Reference Guide , and the section below, Workflow Alarm Value for further information. Defining an Alarm Detection To define Alarm Detection, you must Configure the Alarm Detection and Add an Alarm Condition. An Alarm Detection definition is made up of: A condition, or a set of conditions, see the section below, Alarm Conditions An object such as host, pico instance, or workflow, that the alarm should supervise The parameter that you want the alarm to supervise, for example, the Statistics value Time and value limits of supervision To create a valid alarm detection configuration make sure that: The Alarm Detection includes at least one condition. Two conditions within an alarm guard the same object: host, pico instance, or workflow. Two conditions are set to the same time interval criteria. This section contains the following subsection: Alarm Detection Configuration",
    "title": "Alarm Detection - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204670892",
    "word_count": 276,
    "char_count": 1795
  }
]