[
  {
    "chunk_id": 1,
    "text": "This chapter contains a brief overview of the PCC architecture. For further information about the architecture and system requirements, see the PCC Installation Instructions . The Policy Charging and Control solution is designed for high availability with high throughput and low latency. The setup of the solution depends on which type of data repository you have selected: Couchbase, Redis (ElastiCache Cluster on AWS), or MySQL Cluster. PCC Setup when Using Couchbase When using Couchbase, the setup is divided into the following parts: Open PCC Architecture when using Couchbase [CZ01] and [CZ02] - Two separate Platforms Containers, their databases, and various monitoring and management processes for the collection of statistics. Two [CZs] are required for failover purposes, and one of them will be on standby. [EZ01] and [EZ02] - Two Execution Containers, hosting the pico instances, i.e ECs, that run the workflows that are required by the PCC solution. Two are required for failover purposes. [DR01], [DR02] and [DR03] - A Couchbase cluster that contains the Data Repository where all data pertaining to processing is stored. The minimum cluster should consist of three nodes with one replication per bucket. Names within [ ] are used throughout the document to describe on what machines the corresponding function is to be installed, e.g [CZ01] or [EZ01] . When the number is omitted, e.g [CZ], the name refers to both [CZ01] and [CZ02] etc. PCC Setup when Using Redis When using Redis for PCC in AWS, you use Amazon ElastiCache. Monitoring functions are not included in this setup. The setup is divided into the following parts: Open PCC Architecture when using Redis [CZ01] and [CZ02] - Contain the Control Zone and various management processes for the management of the data repository. Two [CZs] are required for failover purposes, and one of them will be on stand-by. [EZ01+DR01], [EZ02+DR02] - Contain the Execution Zones, where the workflows are executed, as well as the Data Repository where all data pertaining to processing is stored. Two [EZs] are required for failover purposes. PCC Setup when Using MySQL Cluster When using MySQL Cluster, the setup is divided into the following parts: Open PCC Architecture when using MySQL Cluster [CZ01] and [CZ02] - Two separate Platforms Containers, their databases, and various monitoring and management processes for the collection of statistics. Two [CZs] are required for failover purposes, and one of them will be on stand-by. [EZ01] and [EZ02] - Two Execution Containers, hosting the pico instances, i e ECs, that run the worfklows that are required by the PCC solution. Two are required for failover purposes. [DR01] and [DR02] - Contains the Data Repository where all data pertaining to processing is stored. Names within [ ] are used throughout the document to describe on what machines the corresponding function is to be installed, e g [CZ01] or [EZ01] . When the number is omitted, e g [CZ], the name refers to both [CZ01] and [CZ02] etc.",
    "title": "System Architecture and Requirements PCC - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205783357/System+Architecture+and+Requirements+PCC",
    "word_count": 487,
    "char_count": 3013
  }
]