[
  {
    "chunk_id": 1,
    "text": "This page contains additional sets of platform related properties described below in the install.xml file. The properties are described in the order they appear in the install.xml file. The properties are categorized as follows: 1 General Database Properties 2 3pp Properties 3 Common Properties 4 Config Properties 5 Notification Properties 6 Execution Context Properties - Not Used in Platform Only Installations 7 Desktop Properties General Database Properties Property Description Property Description mz.jdbc.type Default value: derby This property specifies the platform database you want to use. The supported options are derby , oracle , postgresql , or saphana . mz.jdbc.user Default value: mzadmin This property specifies the username of the database that the Platform will use during runtime. mz.jdbc.password Default value: mz This property specifies the password of the jdbc user. The password can be changed at a later stage. For further information about changing the database password, see Changing Database Password in the System Administrator's Guide . mz.jdbc.url Default value: \"\" This property can be used to explicitly specify the JDBC URL. If it is not specified, it is calculated based on the other database parameters described above. 3pp Properties Property Description Property Description mz.3pp.dir Default value: /opt/3pp This property specifies the directory where to store 3pp files required by various parts of the system, such as jar files for Oracle, the SAP RFC agent, the SAP JCo agent, the SAP CC agents, the JMS agents, Data Veracity, the Kafka profile, and the various DB connectors. The files are moved to the $MZ_HOME/3pp directory during installation. Note! Ensure that the directory specified for this property is located outside of MZ_HOME during installation. Common Properties Property Description Property Description pico.rcp.platform.host Default value: \"\" Example value: 192.168.0.190 This property specifies the IP address or the hostname of the Platform to be used by other pico instances such as Execution Contexts, Service Contexts, or Command Line. If a failover occurs and you have entered a hostname as the value of this property, the hostname is retrieved from the DNS enabling reconnection. If you have entered a static IP address as the value of this property, reconnection issues may occur after a failover, if the IP address has changed. pico.rcp.platform.port Default value: 6790 This property specifies the port for connecting the Execution Contexts to the Platform. pico.rcp.server.host Default value: \"\" This property specifies the IP address or hostname of the pico instances. It is used to determine the interface that the pico instances must bind to and the IP address/hostname that to use by connecting processes. If a failover occurs and you have entered a hostname as the value of this property, the hostname is retrieved from the DNS enabling reconnection. If you have entered a static IP address as the value of this property, reconnection issues may occur after a failover, if the IP address has changed. When the value of this property is left blank, the pico instance binds to all IP addresses of the host. This means that the pico listens for inbound network traffic on all network interfaces, and may attempt to use any local IP address for outbound network traffic. Note! If the host has more than one IP address, this property has to be set with the correct IP address. Make sure to set the property if you use IPv6, or if a high availability environment is configured. For information about high availability, see High Availability . mz.webserver.port Default value: \"9000\" This property specifies the port of the Platform Web Interface. When installing a second MediationZone instance, this port value must be replaced in order to not clash with the first instance. Config Properties Property Description Property Description mz.name Default value: DR This property specifies the name of the MediationZone deployment. Notification Properties Property Description Property Description mz.notifier.mailfrom Default value: \"\" Example value: mzadmin@company.com This property specifies the sending signature to use for event generated e-mails, presented as a label. mz.mailserver.host Default value: \"\" Example value: SMTP.server This property specifies the name or IP address of the mail server to use for event generated e-mails. Execution Context Properties - Not Used in Platform Only Installations Property Description Property Description mz.eclist Default value: ec1 This property specifies the EC(s) to be installed. Only applicable if install.types includes ec. ec.backlog.dir Default value: ${mz.home}/tmp This property specifies the directory where ECs can store their backlogged events. If this parameter is removed, the EC's events are not logged. Only applicable if install.types includes ec. ec.webserver.enabled Default value: true This property specifies if the web server for Execution Contexts should be active. Only applicable if install.types includes ec. ec.webserver.port Default value: 9090 This property specifies the port of the EC web server. Only applicable if install.types includes ec. Note! If you specify several ECs, you need to modify this value to use separate port numbers for each EC once the installation is completed. Do this by using the mzsh topo set command: mzsh topo set topo://container:<container>/pico:<name>/val:config.properties.ec.webserver.port <new_port_number> Desktop Properties Property Description Property Description ui.webserver.port Default value: 9001 This property specifies the port of the Desktop interface. Only applicable if install.types includes ui.",
    "title": "Additional Platform Properties in install.xml - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204736101",
    "word_count": 849,
    "char_count": 5697
  }
]