[
  {
    "chunk_id": 1,
    "text": "MediationZone is able to access the properties file that is stored on the Amazon Web Service S3 bucket. Selecting the S3 properties file option will open up additional properties to be configured. These properties pertain to the connection details and location of the External Reference file that sits in the Amazon Web Service S3 bucket. Open External Reference profile dialog - S3 Properties File Setting Description Setting Description External Reference Type From the drop-down list select the External Reference source type. The following types are available: S3 Properties File - A file on an Amazon Web Service S3 bucket Properties File - A file on the Platform Container host Environment Variable - Exported environment variables from the Platform's startup shell. Use IAM Roles and Policies Enabling this checkbox will allow the user to utilize the AWS Identity and Access Management credentials to access the S3 bucket. The platform will acquire the IAM credentials from an AWS configuration file, created using the AWS CLI command. Secret Key The secret key for the S3 bucket. Part of the connection credentials required for the platform to connect to the S3 bucket to acquire the property file. Access Key The access key for the S3 bucket. Part of the connection credentials required for the platform to connect to the S3 bucket to acquire the property file. Regions The region that the S3 bucket is located in. Bucket Name The name of the S3 bucket. File Path Name Enter the path and name of the properties file. Local Key The name of the External Reference. Properties File Key The name of the External Reference in the properties file or environment variable. Value The current value of the External Reference in the properties file or environment variable. To update the value from the Properties file, use the Refresh button. If values are not displayed, make sure that a properties file is available in the specified path or that the environment variables are set. Note! Environment variables that are set after Platform start are not available in the External Reference profile.",
    "title": "AWS S3 Support for External Reference Profile - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204998598/AWS+S3+Support+for+External+Reference+Profile",
    "word_count": 344,
    "char_count": 2097
  }
]