[
  {
    "chunk_id": 1,
    "text": "You can use the Google Secret Manager profile to setup up the access credentials and properties for connecting to a Google Secret Manager environment. Currently, the profile can be used in the following Profiles: Secrets Profile Security Profile Buttons The contents of the buttons bar may change depending on which configuration type has been opened in the currently displayed tab. The Google Secret Manager profile uses the standard buttons that are visible for all configurations, and these are described in Common Configuration Buttons . The Edit menu is specific for the Google Secret Manager Profile configurations. Button Description Button Description External References Click on this button to enable External References in the Google Secret Manager profile configuration. This can be used to configure the following fields: Project Id Private Key Id Private Key Client Email Client Id Other Information For further information, see Using External Reference in Agent Profile Fields and External Reference Profile . Note! If there is a proxy in your network environment, it will work with a proxy that does not require authentication. Currently, it does not work with a proxy that requires authentication. Refer to HTTP Proxy Support for more details. Configuration Open Google Secret Manager Profile Setting Description Setting Description Environment-Provided Service Account When MediationZone is deployed in a GCP environment, such as in Compute Engine, enable this option to retrieve the Service Account credentials provided by the environment. Project Id The GCP Project Id that hosts the GCP service that MediationZone should access. Private Key Id The Private Key Id to be used for the service account. Private Key The full content of the private key. Client Email The email address given to the service account. Client Id The Id for the service account client. Other Information The Auth URI, Token URI and info about the certs are to be added into this field.",
    "title": "Google Secret Manager Profile - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/227311617",
    "word_count": 310,
    "char_count": 1978
  }
]