[
  {
    "chunk_id": 1,
    "text": "The Error tab contains configurations related to error handling of the workflow. Since the batch concept does not exist for real-time workflows, batch related options in the tab are only valid for batch workflows. If you decide not to abort after one cancel batch you can choose whether to save errors to 1) the ECS (Error Correction System) or 2) Data Veracity . These two options are both described below. Open Error tab - Data Veracity batch error type Item Description Item Description Abort after one cancel batch If enabled, the workflow immediately aborts on the first Cancel Batch message from any agent in the workflow. The erroneous data batch is kept in its original place and must be moved or deleted manually before the workflow can be started again. Abort after one cancel batch followed by <configured amount> c onsecutive cancel batches If enabled, the value of <configured amount> indicates the number of allowed cancel batch calls, from any agent in a workflow before the workflow is aborted. The counter is reset between each successfully processed data batch. Thus, if 5 is entered, the workflow aborts on the 6th data batch in a row that is reported erroneous. All erroneous files, but the first one, are removed from the stream and placed into Data Veracity or the ECS . Do not abort after cancel batch The workflow will never abort. However, as with the other error handling options, the System Log is always updated for each cancel batch message, and files are sent to Data Veracity or the ECS . Error Batch Type When selecting Abort after one cancel batch followed by <configured amount> consecutive cancel batches or Do not abort after cancel batch options above, the Error Batch Type radio buttons are enabled. Choosing Data Veracity will send all erroneous batches to Data Veracity while choosing ECS will send the erroneous batches to the ECS. Data Veracity Batch Error UDR Data Veracity allows for the handling of erroneous batch files received from the input source. You must set up a database table prior to setting up the error batch handling for your workflows. For more information see Data Veracity . The Data Veracity Error UDR sections are grayed out until one of the Abort after one cancel batch followed by <configured amount> consecutive cancel batches or Do not abort after cancel batch alternatives is selected and Error Batch Type is set to Data Veracity . Item Description Item Description Error Code Select from a drop-down list of error codes that have been defined from the error code web interface. You can refer to Error Codes for instructions. The Error Codes are shared between Data Veracity and the ECS . Data Veracity Profile The Data Veracity profile to be used. Refer to Data Veracity Profile for instructions to set up the profile for use. Named MIMs MIM values to be associated with the erroneous batch file when sent to Data Veracity. The Named MIMs added in the Data Veracity Profile should be listed in the table. MIM Resource The Mim Resource column is populated with the MIM values that are based on the MIM parameters which are selected from the MIM Browser dialog. ECS Batch Error UDR A UDR that contains information on selected MIMs can be associated with the batch. This is useful when reprocessing a batch from the ECS, as the fields of the Error UDR will appear as MIMs in the collecting workflow. The batch UDR may be populated from Analysis or Aggregation agents as well. This is useful if you want to enter other values than MIMs. The ECS Batch Error UDR section is grayed out until one of the Abort after one cancel batch followed by <configured amount> consecutive cancel batches or Do not abort after cancel batch alternatives is selected and Error Batch Type is set to ECS . Open Error tab - ECS Error Bath Type Item Description Item Description Error Code Select from a drop-down list of error codes that have been defined in the Error Correction System Inspector. The Error Codes are shared between Data Veracity and ECS . Refer to Error Codes for instructions. Error UDR Type The error UDR to be associated with the batch. The appropriate format can be selected from the UDR Internal Format Browser dialog opened by selecting the Browse... button. The columns UDR Field and MIM Resource are populated depending on the selected UDR type. UDR Field A list of all the fields available for the selected Error UDR Type. MIM Resource The Mim Resource column is populated by clicking the MIM button. The preferred MIM to map to the Error UDR Type fields can then be selected from the MIM Browser dialog. Logged MIMs The column Error Mim holds information on what MIM resources to be logged in the System Log when the workflow aborts or sends UDRs and batches to ECS. These values may also be viewed from ECS (the MIM column). The most relevant resources to select are things that identify the data batch, such as the source filename, if available. Note that this is only a short summary of the functionality description. For further information, see Error Correction System .",
    "title": "Error Tab - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204638531",
    "word_count": 870,
    "char_count": 5047
  }
]