[
  {
    "chunk_id": 1,
    "text": "During the upgrade process, you must use the default application user, mzadmin , and correct password whenever you are prompted to enter it. The preparation steps will not affect the running system and can be done in advance. Before proceeding with the upgrade, make the following preparations: Verify that you are on a version from which upgrade is supported. You can check the current version by opening the About window in the Desktop, where the current version is listed in the Pico Version section. See the documentation space for the version you are currently running for more information. Install either Oracle JDK 17 or OpenJDK 17 on the server(s) where the Platform Container and Execution Containers are running. Verify that the System Requirements are met. If the operating system, or database need to be upgraded, this should be done prior to the upgrade. This has to be done for all machines that are hosting the system. Ensure that the environment variables are set correctly: Variable Description MZ_HOME This environment variable specifies where the software is installed. JAVA_HOME This environment variable specifies where the JDK is installed. PATH This environment variable specifies the search path and must contain the following directories: $JAVA_HOME/bin:$MZ_HOME/bin Example - Setting environment variables export MZ_HOME=/opt/mz export JAVA_HOME=/opt/jdk/jdk-17.0.2 export PATH=$JAVA_HOME/bin:$MZ_HOME/bin:$PATH Make an online backup of the database(s). For further information regarding how to perform an online backup, see Backup and Disaster Recovery Procedures . Note! If you are upgrading from 9.x, you can find the database backup instructions in the documentation for 9.x. It is important to make a backup of MZ_HOME for rollback purposes. To make a backup of your MZ_HOME, you can use the following command: Note! Ensure that all processes in your installation are shutdown prior to the backup. You can check which processes are running by using the mzsh status command. cd $MZ_HOME/../ tar -zcvf mzhome_backup.tgz <MZ_HOME directory> mv mzhome_backup.tgz <backup directory> Caution! Use of MZ_HOME backup The MZ_HOME backup is needed in case the upgrade fails. Caution! Use of Filebase persistence When you have the platform property mz.userserver.filebased set to true , to ensure a seamless upgrade process, it is imperative to export all the config before the upgrade and re-import it afterward. Failure to do so may result in the missing configuration data in the upgrade.The MZ_HOME backup is needed in case the upgrade fails. Create a directory to use when unpacking this release and future releases. For the purpose of these instructions, this designated directory is referred to as the staging directory . Important! The staging directory should not be the same directory as the one you created and set up as the MZ_HOME directory. Place the *.tgz file from your release delivery into the staging directory . Use a command line tool, go to the staging directory , and unpack the *.tgz file by running the following command: tar xvzf <filename>.tgz A directory is then created in the staging directory , containing the software to be installed. For the purpose of these instructions, this directory is referred to as the release content directory . Now copy the MZ license file into the release content directory . Note! If you are upgrading from an earlier major or minor version, you need a new license file. Contact Support | DigitalRoute on getting the MZ license file. cp mz.license <release content directory> Enter the release content directory and prepare the install.xml file by running the following command: cd <release content directory> ./setup.sh prepare The *.mzp packages have now been extracted, and the install.xml has been extracted into the release content directory . The install.xml file will automatically be populated with information from your existing installation. Note! Refer Updating the Installation Properties for Platform to know more about these properties and their default values. Important! When upgrading to this release, the install.admin.password property must be set according to your current admin password before proceeding with the ./setup.s h upgrade step. Important! If your existing MZ_HOME platform database is configured to use other database type than the default Derby, you need to check and update the respective database related properties from the install.xml file to match your current setup. Oracle See Properties for Oracle for details. The following properties require manual update: <property name=\"install.ora.owner\" value=\"mzowner\"/> <property name=\"install.ora.password\" value=\"mz\"/> PostgreSQL See Properties for PostgreSQL for details. The following properties require manual update: <property name=\"install.pg.owner\" value=\"mzowner\"/> <property name=\"install.pg.password\" value=\"mz\"/> SAP HANA See Properties for SAP HANA for details. Important! Oracle ojdbc.jars If you are using Oracle as the system database, you need to use Oracle 19c (19.20.0.0) JDBC drivers ( ojdbc8.jar/ojdbc10.jar ). Replace the jar files in $MZ_HOME/3pp and $MZ_HOME/lib folders The jar file can be downloaded from JDBC and UCP Downloads page .",
    "title": "Upgrade Preparations - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204669993/Upgrade+Preparations",
    "word_count": 787,
    "char_count": 5226
  }
]