[
  {
    "chunk_id": 1,
    "text": "The UDR types used by the Python Connector agent can be viewed in the UDR Internal Format Browser . To open the browser, open an APL Editor , in the editing area. Right-click and select UDR Assistance... and the browser opens. Open Python UDRs ConnectorConnect The agent outputs this UDR when the Use Connection Control option is selected and a new connection is being established. The ConnectorConnect UDR contains the connection details and allows the workflow to accept or discard the connection. The UDR must be routed back to the agent for the connection to be allowed or discarded. The following fields are included in the ConnectorConnect UDR: Field Description Field Description Allow (boolean) This field determines whether the connection is permitted or not, defaults to true. ConnectionId (int) This field contains the connection ID of the connection. Reason (string) This field can be used to explain why the connection is not permitted. TLSInformation (TLSInformation (python)) This field contains TLS information for the connection. ConnectorData The agent outputs this UDR when the Use per Connection Routing option is selected and a data is routed from an exploration tool. If you route a ConnectorData UDR back to the Python Connector agent, the data can be consumed from the specified connection only, otherwise the data can be consumed from all connections. The following fields are included in the ConnectorData UDR: Field Description Field Description ConnectionId (int) This field contains the connection ID. Data (any) This field contains the routed data. The data can be of any accepted type, such as a bytearray or UDR. ConnectorDisconnect The agent outputs this UDR when the Use Connection Control option is selected and a connection has been closed. The following fields are included in the ConnectorDisconnect UDR: Field Description Field Description ConnectionId (int) This field contains the connection ID. TLSInformation The TLSInformation UDR contains the details required to use TLS for connection between the Python Connector agent and an exploration tool using Python. The following fields are included in the TLSInformation UDR: Field Description Field Description CertificateChain (list <X509Certificate (python)>) This field contains the list of X.509 certificates in the certificate chain that is presented by the client. For further information, see the section below, X509Certificate. CipherSuite (string) This field contains the cipher suite. Protocol (string) This field contains the protocol. X509Certificate The X509Certificate UDR contains the certificate details. The following fields are included in the X509Certificate UDR: Field Description Field Description IssuerDN (string) This field contains the distinguished name (DN) of the issuer of the certificate. NotAfter (date) This field contains the expiry date of the certificate, i e the date after which the certificate is no longer valid. NotBefore (date) This field contains the date from which the certificate is valid. Signature (bytearray) This field contains the signature for the certificate. SubjectDN (string) This field contains the distinguished name (DN) of the subject of the certificate.",
    "title": "Python Connector UDR Types - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204740039/Python+Connector+UDR+Types",
    "word_count": 482,
    "char_count": 3203
  }
]