[
  {
    "chunk_id": 1,
    "text": "In a Database profile configuration, you can create database profiles for use in various agents, profiles, and APL functions. These include: Audit Profile Callable Statements (APL) Database Bulk Functions (APL) Database Table Functions (APL) Database Agents Data Masking Profile Event Notifications Prepared Statements (APL) Data Veracity Profile Shared Table Profile SQL Agents SQL Loader Agent Task Workflows Agents (SQL) What a profile can be used for depends on the selected database type. The supported usage for each database type is described in their respective pages. The Database profile is loaded when you start a workflow that depends on it. Changes to the profile become effective when you restart the workflow. Configuration To create a new Database profile, click the New Configuration button from the Configuration dialog available from Build View , and then select Database Profile from the list of configurations. The profile contains the standard configuration buttons as described in Common Configuration Buttons and one additional button: Button Description Button Description Open Click on this button to Enable External References in an agent profile field. Refer to Enabling External References in an Agent Profile Field in External Reference Profile for further information. The Database profile has two tabs; General and Properties . The General Tab In the General tab, the two radio buttons Default Connection Setup and Advanced Connection Setup make it possible to display different connection options. Default Connection Setup Select the Default Connection Setup radio button to use a preconfigured connection string. Open The Database profile configuration - General tab Setting Description Setting Description Default Connection Setup Select this option to configure a default connection. Advanced Connection Setup Select this option to configure the data source connection using a connection string. For further information, see the section below, Advanced Connection Setup. Database Type Select any of the available database types. You may need to perform some preparations before attempting to connect to the database for the first time. For information about required preparations, see the section below, Database Types. Database Name Enter a name that identifies the database instance. For example, when you configure the profile for an Oracle database, this field should contain the SID. Database Host Enter the hostname or IP address of the host on which the database is running. Type it exactly as when accessing it from any other application within the network. Port Number Enter the database network port. Username Enter the database user name. Password Enter the database password. Enable TLS Truststore Enable TLS/SSL for connection to an SAP HANA Database. This option will be enabled by default. This option applies only to SAP HANA and will only be visible when SAP HANA is selected as the Database Type . For information about advanced connection for SAP HANA with TLS/SSL enabled, you can refer to SAP HANA DB . Note! If the TLS truststore is configured for SAP HANA default connection setup, the following SAP HANA JDBC connection string properties will be added as well: encrypt=true hostNameInCertificate=* For information about SAP HANA connection string properties, you can refer to the SAP HANA documentation at the SAP Help Portal. TLS Truststore Enter the path and filename to the TLS/SSL trust store file that contains the SAP HANA hosting server's certificate. This option applies only for SAP HANA and will only be visible when SAP HANA is selected as the Database Type . TLS Truststore Password Enter the password for the TLS/SSL trust store file. This option applies only to SAP HANA and will only be visible when SAP HANA is selected as the Database Type . Try Connection Click to try the connection to the database, using the configured values. Advanced Connection Setup The Advanced Connection Setup enables you to specify a customized connection string. It can be used for Oracle RAC and Snowflake connections, or when you need to add additional properties to a connection. For more information, see the relevant subsections. Open Database profile configuration - Advanced Connection Setup Setting Description Setting Description Default Connection Setup Select to configure a default connection. For further information, see the section above, Default Connection Setup. Advanced Connection Setup Select to configure the data source connection using a connection string. Database Type Select any of the available database types. You may need to perform some preparations before attempting to connect to the database for the first time, see the respective pages for each database type for information. Connection String Enter a connection string containing information about the database and the means of connecting to it. Notification Service This field is used when the selected Database Type is Oracle. For more information, see Oracle . Username Enter the database user name. Password Enter the database password. Try Connection Click to try the connection to the database, using the configured values. The Properties Tab The Properties tab allows you to configure additional properties for certain database types. Open The Database profile configuration - Properties tab Currently, the following properties can be configured: Database Type Properties Database Type Properties CSV All properties described on the page http://csvjdbc.sourceforge.net/doc.html in the section section \"Driver Properties\" can be used. MySQL mysql.connectionpool.maxlimit Oracle oracle.pool.connectionwaittimeout oracle.pool.maxlimit oracle.net.encryption_client oracle.net.encryption_types_client oracle.net.crypto_checksum_client oracle.net.crypto_checksum_types_client PostgreSQL postgresql.connectionpool.maxlimit escapeSyntaxCallMode Note! Since PostgreSQL 11, there is support for stored PROCEDURE, prior versions of PostgreSQL support only the stored FUNCTION. Hence, a new connection property called escapeSyntaxCallMode has been introduced by PostgreSQL for users to configure. This property specifies how the driver transforms JDBC escape call syntax into underlying SQL, for invoking procedures or functions. In escapeSyntaxCallMode=select (the PostgreSQL default) mode, the driver always uses a SELECT statement (allowing function invocation only). In escapeSyntaxCallMode=callIfNoReturn mode, the driver uses a CALL statement (allowing procedure invocation) if there is no return parameter specified. Otherwise, the driver uses a SELECT statement. In escapeSyntaxCallMode=call mode, the driver always uses a CALL statement (allowing procedure invocation only) In case you are using Callable Statements with PostgreSQL, you can configure the escapeSyntaxCallMode connection property in the Database Profile. However, if this property is not configured in the Database Profile, it will be using the default escapeSyntaxCallMode =select. If you're utilizing Callable Statements with PostgreSQL, you have the option to set the escapeSyntaxCallMode property either within the Connection String parameters or within the Properties tab of the Database Profile. Should you choose to configure this property in both locations, priority will be given to the setting within the Connection String. SAP HANA sapdb.connectionpool.maxlimit Note! If you have configured any of these properties using topo or the Connection String field when making an Advanced Connection Setup , the properties configured in the Properties tab will override these. Database Types The following table provides information on the database versions supported. Database Version Database Version Cassandra 3.11.3 CSV - DB2 10 Derby 10 MS SQL Server 2008, 2008R2, 2012, 2014, 2016, Azure SQL Database, Azure SQL Data Warehouse/Parallel Data Warehouse MySQL 8 Netezza - Oracle 12cR2/19c PostgreSQL 12/13/14/15/16 Redshift - SAP Hana 2.0 (Please refer to SAP docs on latest supported SPS versions) Snowflake - Sybase IQ The version of Sybase IQ support through the use of the JCONN4 driver Teradata 16.20 TimesTen 11.2 Vertica 8.1 This section includes the following subsections: TimesTen Cassandra CSV Derby IBM DB2 MariaDB MySQL Netezza Oracle PostgreSQL Redshift SAP HANA DB Snowflake SQL Server Sybase IQ Teradata Vertica",
    "title": "Database Profile - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204671569",
    "word_count": 1214,
    "char_count": 8343
  }
]