[
  {
    "chunk_id": 1,
    "text": "For a SAP HANA database, set the following properties in install.xml. SAP recommends that SAP HANA be set up with TLS/SSL encryption enabled. For one way TLS/SSL, you only need to configure the install.sap.ssl.encrypt , install.sap.ssl.truststore , install.sap.ssl.truststorepassword , and install.sap.ssl.hostnameincertificate properties. For mutual authentication, you have to configure all the TLS/SSL properties. For information on how to generate the certificate for SAP HANA, refer to: https://help.sap.com/viewer/0eec0d68141541d1b07893a39944924e/2.0.04/en-US/02f21560bbc1495483373d266f7e1fc7.html Property Description Property Description install.sap.host Default value: 127.0.0.1 This property specifies the IP address or hostname of the database instance. install.sap.db.name Default value: MZ This property specifies the name of the SAP HANA database. install.sap.port.hdbsql Default value: 39013 This property specifies the port that will be used for hdbsql client while provisioning the SAP HANA database. i nstall.sap.port.jdbc Default value: 39044 This property specifies the port that will be used during runtime for jdbc connections towards the SAP HANA database. install.sap.instance.number Default value: 90 This property specifies the SAP HANA instance number. install.sap.systemdb.name Default value: SYSTEMDB This property specifies the SAP HANA System Database name. install.sap.tb.space.tab Default value: row This property specifies the name of the tablespace to use to create the table in. install.sap.ssl.encrypt Default value: true This property enables SAP HANA TLS/SSL encryption. If set to true , you must configure install.sap.ssl.truststore, install.sap.ssl.truststorepassword, and install.sap.ssl.hostnameincertificate. install.sap.ssl.truststore Default value: \"\" This property specifies the location and filename of the java keystore format truststore file. This property needs to be configured for both one way or mutual authentication. install.sap.ssl.truststorepassword Default value: \"\" This property specifies the truststore password. If no password is configured, you can set \"\" (empty string) as the value. This property needs to be configured for both one way or mutual authentication. install.sap.ssl.hostnameincertificate Default value: * This property specifies the hostname in the truststore certificate. You can use \"*\" as the value if there is no hostname configured. This property needs to be configured for both one way or mutual authentication. install.sap.ssl.keystore Default value: \"\" This property specifies the location and filename of the keystore file. This property is only used when enabling mutual authentication. install.sap.ssl.keystoretype Default value: \"\" This property specifies the keystore type. It can be JKS or PKCS12. This property is only used when enabling mutual authentication. install.sap.ssl.keystorepassword Default value: \"\" This property specifies the password of the keystore. This property is only used when enabling mutual authentication. install.sap.ssl.sslcryptoprovider Default value: \"\" This property specifies the TLS/SSL provider for keystores such as OpenSSL. This property is only used when enabling mutual authentication.",
    "title": "Properties for SAP HANA - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204996769/Properties+for+SAP+HANA",
    "word_count": 415,
    "char_count": 3215
  }
]