[
  {
    "chunk_id": 1,
    "text": "Git is the default File System Type selected when you create a new File System Profile. There is one tab below this - General . Open New Configuration - File system profile General tab The following settings are available in the General tab in the Git File System Type: Setting Description Setting Description Repository URL The URL to the repository. Git Provider Open the dropdown to select the Git Provider you want to connect to. The options are: GITHUB BITBUCKET GITLAB Username This field will only be available when BITBUCKET is selected as the Git Provider. Enter your Bitbucket username here. Token Token to access the repository. This field is optional. Use Secrets Profile Select the checkbox to use a Secrets Profile to get the Token. Get Branches Click this button to fetch the branches from the repository. If the connection is working, the Branch combo box will be populated. If the connection fails, an error dialog will be shown. Branch Select the branch to use. Note! It is not possible to create a new branch using Usage Engine. The branch must already exist in the repository specified in the Repository URL . View Repository Click here to browse the folders in the repository. It is only possible when the configuration is saved. Note! When you Save As, the remote repository is cloned to the platform and may take some time. This directory is $MZHOME/gitrepos by default. It can be changed by setting the property mz.git.basePath to some other path accessible from the Platform It is not possible to change the Repository URL or branch once the configuration is saved. Import of Git File System Profile An imported new Git File System Profile configuration will always be invalid since the repository has not been cloned. You clone the repository in the profile by clicking the Clone Repository button. Open Open When the cloning is done the text on the button will change to Preview Repository , and the configuration should now be valid, which you can verify by clicking the Validate button.",
    "title": "File System Type - Git - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/315392053",
    "word_count": 342,
    "char_count": 2015
  }
]