[
  {
    "chunk_id": 1,
    "text": "Search this document: PCC Rules from MediationZone is a Policy and Charging Control solution for 3GPP and non-3GPP environments. The uptake of mobile data services is not compensating for voice revenue in the developed markets, which makes it increasingly important to make data services more profitable for the service providers. Effective policy control is the key for service providers that are looking to manage the explosive growth in data traffic in a profitable way. Ensuring reasonable usage and allocating bandwidth based on a combination of subscriber and service criteria is essential when constantly updated offerings reflecting new services and technologies are required. PCC Rules is an extension of the Platform and delivers the capability to manage and retrieve policy rules based on 3GPP and non-3GPP definitions. The PCC Rules package will act as a rule repository, with which external systems can interact over different protocols, where the business logic will drive the selection of policy rules to be enforced by the appropriate network elements. The business logic is implemented as a workflow using the APL functions that are described in this document. The PCC Rules package comes pre-packaged with a 3GPP Gx Policy Rule Schema, according to [Gx Ref]. With PCC Rules you can create and apply different rules regarding Quality of Service and usage for different subscribers based on subscription type, location, current usage, etc. PCC Rules enable you to configure your Policy Control and Charging solution, either in a Desktop or by applying the APL functions in a batch workflow and/or using the REST HTTP Interface. Working with PCC Rules encompasses three different areas; Defining and updating rules - Includes creating, updating, and removing rules, which is done either in the Desktop, by using APL functions, or through the REST web interface. Managing updates of rules in runtime - Includes ensuring that when rules are updated in runtime, the latest rules will always be returned on rules lookup, which is done in a workflow using the APL functions described in this document. Looking up rules in runtime - Includes looking up rules based on requests from the network in runtime, which is done in a workflow using the APL functions described in this document. Prerequisites The reader of this document should be familiar with: The HTTP protocol, https://httpwg.org/specs/ Terms and Acronyms This section contains glossaries for all terms and acronyms used throughout the PCC and MediationZone documentation. Term/Acronym Definition Term/Acronym Definition PCC Policy and Charging Control PCRF Policy and Charging Rules Function 3GPP 3rd Generation Partnership Project Chapters The following chapters and sections are included: Data Model for PCC Rules Provisioning of PCC Rules Runtime APL Support for PCC Rules",
    "title": "PCC Rules - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204677251/PCC+Rules",
    "word_count": 442,
    "char_count": 2846
  }
]