[
  {
    "chunk_id": 1,
    "text": "Reference Data Management allows you to bulk load data to and from the database tables using the Import and Export function. Note! Both importing and exporting data apply to the Standard Search Type . If you have selected Join Table Search Type , only exporting is allowed. Refer to Querying A Table In Reference Data Management for more information. You can refer to the following for more information on its respective functions: 1 Importing Data 2 Exporting Data Importing Data You can import data into your table from a CSV file using Reference Data Management. Open Import dialog Option Description Option Description Select Files This button opens a file selection dialog. You can only select one file at a time but it is possible to upload multiple files for import. Each added file is listed below the button. The play button starts the import of the selected file. Ignore Error during Import When this check box is selected, errors during import are logged but does not interrupt the process. Settings Append When this radio button is selected, all rows to be imported into the table will be appended into the table as new rows. Truncate When this radio button is selected, all rows in the existing table will be truncated and the rows will be imported into an empty table. Text Qualifier Character This field specifies the special character used to indicate the start and end point of the value within a text based field. The character for text qualifier is configurable between single quote (') or double quote (). The default character is a double quote () Separator Character This field specifies the character that should be interpreted as separator between values in the imported file. The default separator is a comma. Exporting Data You can export data from the entire table or just the query result from the Reference Data Management. Note! Only supported data types(Varchar/String, Numeric, Data time, Boolean) will be added for exporting, non supported type will be excluded. Open Export dialog Options Description Options Description Column Selector Allows you to choose from a drop down list to include or exclude a particular column from the export. Clicking the All button will include all columns in the table. Text Qualifier Character This field specifies the special character used to indicate the start and end point of the value within a text based field. The character for text qualifier is configurable between single quote (') or double quote (). The default character is a double quote () Separator Character This field specifies the character that will be used for separating values in the export. The default separator is a comma (,) Export All Rows When this radio button is selected, all rows in the table will be exported. Example - Exported row values If the prefetchSize =0, maxRowsPerQuery =2500, and table size = 100,000: Export All Rows = 100,000 rows Export Retrieved Rows = 2,500 rows If the prefetchSize =200, maxRowsPerQuery =2500, and table size = 100,000. Export All Rows = 100,000 rows Export Retrieved Rows = 2,500 rows If the prefetchSize =1000, maxRowsPerQuery =200,000, and table size = 100,000. Export All Rows = 100,000 rows Export Retrieved Rows = 10,000 rows Export Retrieved Rows When this radio button is selected, the rows in the last query will be exported. The maxRowsPerQuery setting in the Reference Data Profiles Advanced tab controls the number of exported records, with a default limit of 50,000. Open Example of CSV exported data",
    "title": "Importing Or Exporting Data In Reference Data Management - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205656648/Importing+Or+Exporting+Data+In+Reference+Data+Management",
    "word_count": 581,
    "char_count": 3498
  }
]