[
  {
    "chunk_id": 1,
    "text": "MediationZone provides a comprehensive set of supporting functions to ensure effective management and operation of the system, enabling it to process very large volumes of data in a safe and consistent manner. Functionality Description Functionality Description Access Control Access to the system is controlled with user profiles, which are used to control access rights to all parts of the system. Alarm Detection Manager MediationZone can be configured to proactively monitor any execution characteristics of the system state. If a deviation is detected, an alarm is generated and can trigger a number of different events such as an SNMP trap, or email. Archiving The archiving system provides on-line storage on disk for file archiving. Automatic swap of disk partitions is included, as well as regular cleanup of old data. Auditing Audit and statistical information is generated and stored in user-defined database tables, from which reports can be generated. Data Veracity Data Veracity provides a repository of erroneous records and allows users to search, view, modify and reprocess the data. Error Correction System (ECS) ECS is a repository for usage data records (UDR) and batches failing a predefined set of processing rules. The system has full support for automatic grouping of data, purging, and automatic reprocessing. Event Notification Configuration An event notification configuration acts as a receiver/distributor of all messages generated within the MediationZone system. This makes it possible to output customized information and alarms to any target, such as a mail server, SNMP trap, or database table. Execution Manager The Execution Manager is used to control and monitor all workflows. Workflows are activated and deactivated, and user-defined views can be created to view runtime information presented in real-time. External Version Control MediationZone provides a special XML export and import format for storing configurations in an external version control system. Using external version control systems to store configuration artifacts allows for efficient collaboration, and control, during the complete lifetime of the solution. Pico Management Processes and threads are controlled through the Pico Manager, which can restrict access to certain hosts and monitor the memory and availability status. Pico management also ensures a single point of administration from a distributed architecture perspective, where the Pico manages software updates to all distributed execution environments. Reference Data Management Functions Reference Data Management deliver the capability to query and edit specific table sets in relational databases while schema permissions remain unaltered. System Export and Import The system export and import enables backup of configuration data  full or partial. The configurations are stored in XML files, which can also be exported into a ZIP archive. The export and import functionality is also very useful for migrating mediation configuration in between two different installations of MediationZone, such as production and test. System Statistics MediationZone automatically records a wide range of internal as well as external system statistics. This information can be used to monitor the performance of workflows or the utilization of hardware. System Topology Registry A data structure that holds configurations, service configurations, and attributes that control the behavior of MediationZone. The data in STR can be edited manually in a web GUI, editor, or via the command line. UDR File Configuration A UDR file configuration is used to examine and update data files, for example, when creating test data. It includes filtering capabilities, making it possible to list a selection of UDR fields. Usage Management Meters usage against a product definition, in order to provide balance management and support for complex, hierarchal aggregation structures Web Interface and Dashboard monitoring through Traffic Lights Monitoring the execution of all parts of MediationZone is performed using a web based operation and maintenance GUI. Any deviation to expected execution characteristics, such as an alarm, is immediately visible. Workflow Configuration A workflow configuration is created to design and configure Workflows and Tasks. Tools are also provided to debug and profile workflows. Workflow Group Configuration By creating a workflow group configuration, workflows can be grouped conceptually to any level of complexity. Common configuration and execution characteristics, such as scheduling and distribution criteria can then be applied collectively to all elements of a group.",
    "title": "Functionality - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/205816388/Functionality",
    "word_count": 681,
    "char_count": 4659
  }
]