[
  {
    "chunk_id": 1,
    "text": "Non-automatic maps provide explicit mapping between the external and internal format. Such mappings work on fields with primitive types and/or fields that are instances of other formats. In the latter case, the maps can be nested indefinitely. The following two examples demonstrate these concepts. Example - Non-Automatic Maps, all primitives In the following example a decoder, based on the in_map , does the following: Reads an instance of the external record ExtFormat . Associates ef1 with if1. That is, any reference to if1 forces decoding of the information of ef1 and in the process converts it to an integer. Associates ef2 with if2. That is, any reference to if2 forces decoding of the information of ef2 and in the process converts it to a string. external ExtFormat { ascii ef1 : static_size(4), padded_with(\" \"); int ef2 : static_size(2); }; internal IntFormat { int if1; ascii if2; }; in_map InMapFormat: external(ExtFormat), internal(IntFormat) { e:ef1 and i:if1; e:ef2 and i:if2; }; Example - Non-Automatic Maps, externals in externals In the following example a decoder, based on the in_map , does the following: Reads an instance of the external record ExtFormat2 . Associates ef1 with if1. That is, any reference to if1 forces decoding of the information of ef1 . The conversion between ExtFormat1 and IntFormat1 is, in this case, dictated by the in-map named InMapFormat1 as declared in InMapFormat2. external ExtFormat1 { ascii ef1 : static_size(4); }; external ExtFormat2 { ExtFormat1 ef1; }; internal IntFormat1 { int if1; }; internal IntFormat2 { IntFormat1 if1; }; in_map InMapFormat1: external(ExtFormat1), internal(IntFormat1) { e:ef1 and i:if1; }; in_map InMapFormat2: external(ExtFormat2), internal(IntFormat2) { e:ef1 and i:if1 using in_map InMapFormat1; }; As seen in the example, explicit map specifications for complex formats can become very large, even describing all the internals to map data too, can be a huge task. This is why automatic mapping is normally used.",
    "title": "Examples of Non-Automatic Maps - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204744259/Examples+of+Non-Automatic+Maps",
    "word_count": 311,
    "char_count": 2001
  }
]