[
  {
    "chunk_id": 1,
    "text": "This section contains information that is specific to the database type Oracle. Supported Functions The Oracle database can be used with: Audit Profile Callable Statements (APL) Database Bulk Lookup Functions (APL) Database Table Related Functions (APL) Database Collection/Forwarding Agents Data Masking Profile Event Notifications Prepared Statements (APL) Data Veracity Shared Table Profile SQL Collection/Forwarding Agents Task Workflows Agents (SQL) Properties When selecting the Oracle database type, you can configure the following properties using the Properties tab in the Database profile: oracle.pool.connectionwaittimeout oracle.pool.maxlimit oracle.net.encryption_client oracle.net.encryption_types_client oracle.net.crypto_checksum_client oracle.net.crypto_checksum_types_client Preparations A database driver is required to connect to an Oracle database. This driver must be stored in the Platform Container. Follow these if Oracle was not set up during the installation of the Platform Container: Download the JDBC driver ( ojdbc<version>.jar ) for the appropriate Oracle database version, and the ONS.jar driver in the case you use Oracle RAC. Copy the downloaded file(s) to the directory MZ_HOME/3pp in the Platform Container. Restart the Platform and ECs for the change to take effect. You should be able to select the Oracle option from the Database profile after this step. Advanced Connection Configuration for Oracle RAC The Advanced Connection Setup is used for Oracle RAC Configurations. To make the Connection String text area and the Notification Service text field appear, select the General radio button. The Username , Password, and Database Type fields will remain. If MediationZone is installed with the Oracle database, the Oracle RAC functionality Fast Connection Failover (FCF) is available. MediationZone supports FCF thus, the expectation is that there will normally be some exceptions generated during RAC instance failover. When FCF is configured, the system detects a lost connection, clears the database connection pool, and reinitializes the connection pool. During a RAC instance failover, you might experience exceptions, for example, when database transactions such as updates and inserts are done. Database exceptions are logged in the system. The Platform and Execution Contexts support the failover behavior. However, note that neither database collection nor forwarding agents support FCF. These agents have different types of database connection pool implementation. Open Database Profile Configuration - Advanced Connection Setup Setting Description Setting Description Connection String In the text field, a connection string can be entered. The connection string can contain a SID or a service name. The string added will not be modified by the underlying system. If a connection string is longer than the text area spaces a vertical scroll bar will be displayed to enable viewing and editing of the connection string. Notification Service Enter the Configuration that enables the Oracle Notification Service daemon (ONS) to establish a Fast Connection Failover (FCF). The ONS string that you enter should at least specify the agent ONS configuration attribute, which is made up of a comma-separated list of host:port pairs. The hosts and ports represent the remote ONS daemons that are available on the RAC agents. For further information see the Installation guidelines for Oracle RAC in the Installation Instructions .",
    "title": "Oracle - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204737654/Oracle",
    "word_count": 495,
    "char_count": 3474
  }
]