[
  {
    "chunk_id": 1,
    "text": "This section describes the standard upgrade procedure that should be used when it is important to minimize downtime and ensure that persisted data is retained. The Standard upgrades must be performed stepwise to the next consecutive main or minor version. Note! Read the Documentation Ensure to read through all the documentation for the Standard Upgrade Procedure and check out the Release Notes for Important information and Known Issues before proceeding with the Upgrade. This section contains the following subsections: Disconnect ECs Shut Down Workflows and Desktops Upgrade Preparations Upgrade Platform Container Upgrade Execution Container Post Upgrade Resume Workflow Execution If you plan to upgrade several versions, repeat the steps on the next page and onwards for each version. Use the setup.sh script provided for each version during the upgrade. Note! There may be changes to certain agents and functions in the new version. Before upgrading, you should take note of any changes or updates that may have happened to your components, as you may have to modify your configuration before it can work with the newer version. See MediationZone Release Information for detailed information about changes in each release. Note! If you have a High Availability setup, you are advised to deactivate the failover functionality in the HA cluster daemon. You must ensure that no HA activities can impede the upgrade procedure. Note! If you have any of the following configurations in your system: Workflow Packages Containing Web Services PCC Extensions (the *.mzp file(s) containing your own custom data model(s) need to be recompiled following the instructions on this page) you will have to perform some additional steps, see the respective page describing the steps for more information.",
    "title": "Standard Upgrade Procedure - MediationZone Documentation 9.3 - InfoZone",
    "url": "https://infozone.atlassian.net/wiki/spaces/MD93/pages/204669969/Standard+Upgrade+Procedure",
    "word_count": 278,
    "char_count": 1796
  }
]